{
    "id": "inzOQDR94h4bAaOVd7Db",
    "name": "DevFest Nantes",
    "categories": [{
        "description": "All Mobile, IoT subjects",
        "id": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "name": "📱 Mobile & IoT"
    }, {
        "description": "All Frameworks, libraries, HTML, CSS...",
        "id": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "name": "🌍 Web"
    }, {
        "name": "💡 Discovery ",
        "description": "Everything about IT but not related to development or technical stuff. ",
        "id": "febe50ff-d2d9-5400-97de-839c80abc636"
    }, {
        "description": "Tools / solutions / methods to run our app.",
        "id": "4fee2bdd-0cf4-5429-945c-42a422577ff5",
        "name": "☁️ Cloud & DevOps"
    }, {
        "name": "📝 Languages",
        "description": "Want to speak about a specific language.",
        "id": "3e79596d-6302-5601-a027-901bff9e2692"
    }, {
        "description": "Store data and how to use it to create robots!",
        "id": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "name": "🤖 BigData & AI"
    }, {
        "description": "Everything about Design & UX.",
        "id": "b8f42b3e-d1d0-5212-bb39-9dfad1b01661",
        "name": "💚 UX / UI"
    }, {
        "name": "🐱‍💻 SECURITY",
        "description": "All about software, web and network security",
        "id": "1e18bcfa-f91a-5ac0-b2f1-ee586837c398"
    }],
    "formats": [{
        "id": "e56e30ab-be22-5055-9138-a86a3249c766",
        "name": "📣 Conference",
        "description": "It could be a live code, slides, or both.\n50min including Q&A"
    }, {
        "name": "⚡️ Quickie",
        "description": "A short talk. \n20min including Q&A",
        "id": "fc2e9afb-3cba-5428-9214-c146862f2a52"
    }, {
        "name": "💻 Codelab",
        "description": "Hand's On! Let's code.\n120min workshop",
        "id": "bc4d1840-d260-5fb6-9e83-f1b0da239793"
    }],
    "talks": [{
        "id": "0CLboCSha2ZxwXGBK2p3",
        "title": "Séquenceur MIDI en NodeJS sur Raspberry PI",
        "level": "advanced",
        "abstract": "Je souhaite proposer de partager mon expérience sur la création d'un projet libre : \n\nUn séquenceur MIDI, développé en NodeJS sur Raspberry PI.\n\nIl s'agit donc d'un outil permettant de créer de la musique en live, très souple, et développé par mes soins afin de pouvoir customiser toutes les fonctionnalités en fonction de mes envies de création en live.\n\nTravaillant principalement sur Atari ST et Gameboy, il s'agit principalement de musique \"programmée\" à l'avance, avec peu de jeu \"live\".\nJ'ai créé cet outil pour travailler différemment, en créant mes morceaux en live avec une souplesse illimitée et personnalisée.\n\nCe séquenceur sert donc de moteur de création musicale en direct, et pilote différents synthétiseurs via le protocole MIDI, le tout contrôlé... en MIDI !\nAyant de fortes affinités avec le matériel vintage, je pilote un Atari ST, une nintendo NES, entre autres vieilles machines aux sons rappelant nos premiers jeux vidéos bien pixelisés.",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["85YULs8Zz2fCrYdFMO1cPz2RBif1"],
        "comments": "Bonjour à toute l'équipe,\n\nJe me permet de proposer ce sujet car on m'a invité à le faire.\nEn effet, plusieurs habitués du DevFest à Nantes étaient en accord pour dire qu'il serait intéressant de le partager au DevFest.\n\nC'est en effet un projet assez intéressant niveau code, car on rencontre des problématiques assez atypiques.\nEn effet, l'optimisation des performances, faire un outil compact, et interagir avec le protocole MIDI m'ont fait faire des choix techniques parfois surprenants, qu'il est pertinent de partager.\n\nEn terme de format, j'imagine bien un format de 50 minutes interactif, mêlant la technique au ludique, en illustrant mes propos avec mes machines et des moments musicaux.\n\nLe lien avec le thème ? Cet outil permet de créer des musiques, de les modifier et les faire évoluer à l'infini, le tout en direct... :)\n\nBonne réception, je pense enrichir tout ça avec des vidéos, le projet étant fraîchement développé, je termine une phase d'optimisation et d'amélioration et je pense passer à la phase de documentation et présentation en suivant.\nN'hésitez pas à me contacter si vous souhaitez davantage d'informations, ou si vous avez besoin d'images/vidéos...\n\nAu plaisir,\nGaëtan CIEPLICKI / 06-08-56-00-89"
    }, {
        "id": "1jiAsaKrbfhsEewsXaSH",
        "title": "Passez vos tests end-to-end en vitesse lumière avec Cypress",
        "level": "beginner",
        "abstract": "Sorti en beta en octobre dernier, Cypress connait déjà un grand succès dans le domaine du test End-To-End (E2E) jusqu’alors dominé par Selenium. Développé depuis 2015, l’équipe en charge du développement de Cypress prend un soin particulier à l’expérience développeur (DX).\n\nDans cette conférence, nous verrons brièvement ce qui caractérise Cypress de Selenium et nous ferons un live-coding qui nous permettra de passer en revue les principales fonctionnalités ainsi que les compromis à prendre en compte.\n\nA l’issue de cette présentation, faire des tests E2E ne sera plus une souffrance !\n",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["sNc6usDmBJMSPh0Z66CwVaE9xkv2"],
        "comments": "Si cela peut vous arranger, je peux faire cette présentation au format \"quickie\". \n\n"
    }, {
        "id": "2biQwBPvVMGgedXKUwMK",
        "title": "Le storytelling et la fiction pour imaginer de nouveaux lendemains  ",
        "level": "beginner",
        "abstract": "En tant qu’équipe, start-up, organisation ou collectivité, nous cherchons à imaginer à quoi pourrait ressembler notre futur dans 6 mois, 1 an, 5 ans, etc.\nMais souvent, cet exercice est complexe et le résultat est difficile à communiquer… Grâce à des approches de storytelling (narration) et de fiction, nous verrons comment imaginer ces nouveaux lendemains, les communiquer à nos parties prenantes pour les embarquer et ensuite, on l'espère, faire que ces lendemains rêvés se réalisent.  \nEt bien sûr, on s'inspire de pleins de films de science fiction pour faire ça...",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["fcH2tfSj1Adpr41mgn2sStSaC8f1"],
        "comments": "Peut aussi être proposé au format conférence"
    }, {
        "id": "2fkGjayxDkJ1lRuya9FZ",
        "title": "Il développe une solution SaaS sans se soucier de la sécurité … et ça tourne mal",
        "level": "intermediate",
        "abstract": "Suite à une idée totalement disruptive de son boss, notre Product Owner a pour mission de mettre sur le marché LA nouvelle solution SaaS dans des délais inaccessibles au commun des mortels. Dans cet empressement, notre héros prendra-t-il en compte la dimension sécurité nécessaire pour ce genre d'application web ? \n\nSon voisin de gauche, spécialiste en cybersécurité et néanmoins collègue lui donnera-t-il les outils clés à la sécurisation de sa solution ?\n\nAdaptera-t-il au sein de ses cycles de développement les bonnes pratiques sécurité à suivre pour des applications aussi populaire ?\n\nSaura-t-il imposer à ses équipes une hygiène sécurité irréprochable ?\n\nSi vous pensez que notre Product Owner est foutu, venez assister à ses péripéties jusqu'à la mise en prod !!!\n\nPS : Et si vous n'avez pas de voisin de gauche, on vous donnera quand même quelques clés pour la sécurité de vos applis.",
        "categories": "1e18bcfa-f91a-5ac0-b2f1-ee586837c398",
        "speakers": ["TPRAC3yFCUfEH9or8gzs7IDoyqc2", "zZwPoNW47CT8ftvBt6xBPboACAj1"]
    }, {
        "id": "3665sQThYqc75ayF6mHX",
        "title": "[Svetlana Isakova] Kotlin",
        "level": "beginner",
        "abstract": "The async/await feature allows you to write the asynchronous code in a straightforward way, without a long list of callbacks. Used in C# for quite a while already, it has proven to be extremely useful. In Kotlin you have async and await as library functions implemented using coroutines.\n\nA coroutine is a light-weight thread that can be suspended and resumed later. Very precise definition, but might be confusing at first. What 'light-weight thread' means? How does suspension work? This talk uncovers the magic. We'll discuss the concept of coroutines, the power of async/await, and how you can benefit from defining your asynchronous computations using suspend function\n",
        "speakers": ["CiJ9ahTlUSX1J6wj8C4PHpgEiHE2"]
    }, {
        "id": "3ycCNqqe5LL9hRt8CRYV",
        "title": "Creating a geolocation app powered by Firebase",
        "level": "intermediate",
        "abstract": "Location-based services apps are everywhere and probably you have installed dozens of them on your phone. Have you ever thought about creating a geolocation app? Or even integrate geolocation features into your existing project?\nIn this talk, I will demonstrate how to combine Google Maps API, Angular, and Firebase to build a fast and scalable geolocation app.\n\nThese location-based related features can benefit you as an entrepreneur who wants to launch an application with such capabilities as well as help developers to improve the user experience bringing peculiar and innovative ways for the users to interact with the apps they are working on.\n\nIn a nutshell, it'll cover:\n🗺️ All you need to know about Map Integration\n🛣️ Calculate distance and duration between locations\n🎈 Obtaining current location of a user and offering nearby options\n📍 Displaying marks with custom information\n🔒 Authentication with different providers\n🔥 Firestore to keep the data in sync \n🖼️ Cloud Storage for the built-in gallery section\n🌈 Cloud Functions for advanced techniques including image thumbnails and sub-collections removal\n🌩️ Cloud Messaging to send push notifications\n🌟 And of course, Firebase Hosting which provides a fast and secure web hosting",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "speakers": ["55naoSebhCMEl2HYrQPyD4ec8Xf2"]
    }, {
        "id": "4QlEcb9LkozTUYADRG9h",
        "title": "La puissance des pseudo-éléments",
        "level": "intermediate",
        "abstract": "Encore en 2018 il n'est pas rare de rencontrer des soupes de \"div\" et \"span\" pour la création d'**éléments visuels en CSS**, ou pour créer des séparateurs ou casser le rythme d'une grille, etc.\n\nL'utilisation des pseudo-éléments permet de faire **passer son code à un niveau supérieur** sans pour autant demander un effort surhumain d'appréhension.\n\nUn peu de théorique, beaucoup d'exemples et de la pratique permettront de rendre leur utilisation concrète et abordable. Vous verrez ensuite que vous ne pourrez plus vous en passer !\n",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["if5EFXF7TEgPy45VFB8ToIPmFJ63"],
        "comments": "J'ai utilisé le champ références pour vous communiquer des informations sur le talk/codelab déjà, mauvais usage du champ de ma part ?\n\nJe n'ai jamais donnée ce talk auparavant, mais j'en ai donnée d'autres et j'ai écrit que le sujet :\n\n* [Filtre photo en utilisant un pseudo élément](https://www.creativejuiz.fr/blog/css-css3/effet-delave-photos-css)\n* [Personnaliser les checkbox et radio](https://www.creativejuiz.fr/blog/tutoriels/personnaliser-aspect-boutons-radio-checkbox-css)\n* [Des compteurs en CSS](https://www.creativejuiz.fr/blog/tutoriels/les-compteurs-en-css)\n* [Un effet feuilles superposées](https://www.creativejuiz.fr/blog/tutoriels/css3-effet-feuilles-superposees)\n* [Des ombres complexes](https://www.creativejuiz.fr/blog/tutoriels/ombre-avancees-avec-css3-et-box-shadow)\n\nCe n'est que pour les astuces et démos visuelles, certains exercices et exemples pratiques permettront de faire ressortir bien des utilisations de ces pseudo-éléments."
    }, {
        "id": "6JZR1rOYJmGg9tsYNjz7",
        "title": "Ghost in the Machine",
        "level": "intermediate",
        "abstract": "In this session, we'll bridge the real and the virtual. We'll first explore how to build a simple Android Things powered robot. This simple robot car uses both off-the-shelf and 3d printed parts.\n\nThen we'll close by building a simple Augmented-Reality remote control app. We'll be using Google's ARCore and Sceneform libraries.\n\nSome familiarity with Kotlin and OpenGL is helpful, but not required.\n",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "speakers": ["FyAyhxJKVSfr68mZTAKQZLV2nGQ2"],
        "comments": "### Extra details\n\nWork in progress deck:\nhttps://drive.google.com/open?id=1qYvOBYcujCI9pd1REu9YGCDEDs01OZXV\n\nUpcoming content: (TBD might vary)\n\n- ARCore+Sceneform remote control setup\n- [TBD] Robot control software can record / replay, planning to add this in\n- [TBD] Full fabrication of the robot platform. Either with 3D printing _or_ cardboard prototyping, inspired by Nintendo Labo.\n\n### Prep notes\n\nDuring this talk, part of my demo has the robot car moving about on the floor. It could be useful to have live video on the projector of the car on the floor. Note that I can likely manage this myself using a simple webcam setup.\n"
    }, {
        "id": "7VpXwNDlXfD3VwpOu7hb",
        "title": "Highway to Elm!",
        "level": "beginner",
        "abstract": "Entre les problèmes de `null` et d'`undefined`, les cas d'erreur non traités, les régressions dans les dépendances npm et les refactoring hasardeux, il est compliqué de livrer sereinement du JavaScript en production !\n\nC'est un mal nécessaire, puisqu'il s'agit du seul langage compatible avec tous les navigateurs, non ? **Non !**\n\nJe vous propose de découvrir une alternative, Elm, dont la première promesse est troublante mais limpide : **plus d'erreurs au runtime !**\n\nNous verrons comment ce langage spécialement pensé pour créer des applications web garantit des mises en production sereines, loin de tous ces soucis que posent les applications JavaScript.",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["xRNeGxIeNcdAegOPlnYeBKFVX2o1"],
        "comments": "Le langage Elm est récent, mais beaucoup de gens s'y intéressent déjà (comme on peut le voir dans les enquêtes State of JavaScript des deux dernières années) Il regroupe toutes les bonnes pratiques du développement front-end tel qu'on le pratique aujourd'hui, permettant au développeur d'être très productif en réduisant au maximum la charge cognitive. En effet, le compilateur – par exemple – nous assiste avec des messages d'erreur limpides et permet même une approche compilator-driven development: pour ajouter une nouvelle fonctionnalité, il suffit de modifier une partie puis de se laisser guider par ses indices jusqu'à ce que ça compile. En Elm, plus la codebase augmente en taille, plus c'est un plaisir de développer !\n\nJ'aborde dans ce talk l'angle de la confiance qu'on peut avoir dans du code Elm. Pour preuve, NoRedInk fait tourner 200 000 lignes de code depuis deux ans, avec un bilan impressionnant : une seule runtime error due à une erreur humaine ! Je montrerai comment cela est possible en expliquant les mécanismes du langage et en insistant particulièrement sur les avantages que cela procure pour le développeur pendant le développement.\n\nJe veux qu'ils découvrent que ce langage va leur permettre de créer des applications web très rapidement et que celles-ci seront bien plus robustes que leur équivalent JavaScript, notamment parce que le refactoring est très simple et fiable en Elm.\n\nJ'ai donné des talks dans plusieurs conférences depuis plus de deux ans (dont plusieurs l’année passée sur Elm). Vous pouvez en retrouver quelques-uns ci-dessous :\n\n - Devoxx Belgium (EN) :\n   - https://www.youtube.com/watch?v=Ofx6LFCYea0\n   - https://www.youtube.com/watch?v=dIABJZsvfWI\n - Voxxed Days Singapore (EN) : https://www.youtube.com/watch?v=-OpwnoGwKuY\n - Devoxx France (FR) :\n   - https://www.youtube.com/watch?v=pSHTe2xTGDc\n   - https://www.youtube.com/watch?v=J09wjZBzJGg\n   - https://www.youtube.com/watch?v=9jac-QibQaM\n - Riviera Dev (FR) :\n   - http://rivieradev.fr/session/103\n   - http://2016.rivieradev.fr/session/49\n - MiXiT (FR): https://vimeo.com/album/4563996/video/215620393"
    }, {
        "id": "A0heUysez4Fq7SMKTy3W",
        "title": "Talk Réservé Gael Musquet",
        "level": "beginner",
        "abstract": "Talk sur les enjeux et les solutions des problèmes de communication en cas de catastrophes naturelles.\n\nOn a vu le talk avec Audrey, il est super !!",
        "speakers": ["bAkrQrssjgU1zb5V2y2QpVnuCmf1"]
    }, {
        "id": "AF3qTf3zD6Ac0fRLXdyh",
        "title": "Neuro Game Experience : Votre pensée prend le contrôle !",
        "level": "beginner",
        "abstract": "Onepoint, le CHU de Nantes et l’école centrale vous invitent à une démonstration vidéo-ludique mêlant neurosciences, intelligence artificielle et réalité virtuelle : \n\n# Piloter son avatar 3D... par la pensée !\n\nCette présentation vous fera découvrir des cas d'application concrets des technologies BCI (Brain to Computer Interface), Machine Learning, développement 3D, IoT... et un peu de Matlab.\n\nTout cela est au service de la recherche médicale, mais vous pourrez aussi commencer à fantasmer sur les thèmes passionnants abordés par la science-fiction : \n- Avatar... le film, en vrai… c'est possible ? \n- Matrix… on y va tout droit ?\n- L'humain augmenté d'Elon Musk… c'est pour quand ?\n",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["uxepB1vrpvUnujmGe6AwG9jWXy52", "8UQcYy7KXNWw379dG3b04DtwwWu1"],
        "comments": "Les démos et présentations seront déjà éprouvés à la DigitalWeek 2018 (Sessions/Démos à la Nantes Game Xperience 2018 les 8 et 9 septembre).\nNous avons plusieurs speakers potentiels entre les membres du labo du CHU, l'école centrale et Onepoint… \nLe sujet sera affiné/réorienté pour le DevFest 2018.\nL'idée est ici de s'adresser plutôt aux développeurs, mais de leur montrer une application des technologies BCI, AI, 3D qui soit à la fois concrète et utile (la recherche médicale), mais qu'on peut aussi envisager pour de très nombreux autres débouchés.\n "
    }, {
        "id": "D9NRj2GATVk9zzGJsSfT",
        "title": "Optimize App Downloads with Android App Bundle and Dynamic Delivery",
        "level": "intermediate",
        "abstract": "An Android App Bundle is a new upload format that includes all your app’s compiled code and resources, but defers APK generation and signing to Google Play.\n\nGoogle Play’s new app serving model, called Dynamic Delivery, then uses your app bundle to generate and serve optimized APKs for each user’s device configuration, so they download only the code and resources they need to run your app. You no longer have to build, sign, and manage multiple APKs to support different devices, and users get smaller, more optimized downloads. Additionally, you can add dynamic feature modules to your app project and include them in your app bundle.\n\nIn this talk, we discuss how to configure your app to build app bundles and make the most out of Dynamic Delivery; use the Play Console to inspect and manage your app bundle; test your app bundle locally using bundletool and integrate these tests into you CI builds; and use the Play Core Library API to request, monitor, and manage on demand downloads.",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "speakers": ["ka9PvCQiKfRIrxlIQxqIz4LPf092"],
        "comments": "Hello!\n\nI work at Google Developer Relations and write the official documentation for Android App Bundles, Dynamic Delivery, Android Studio, and the Android build system using Gradle. I'd be happy to share my knowledge and spread the word on all that's new at DevFest Nantes."
    }, {
        "id": "DckZxnYCVXOVUB5EOlOQ",
        "title": "Istio, we have a problem! Understanding and fixing bugs with a service-mesh",
        "level": "intermediate",
        "abstract": "Istio, we have a problem! We've just deployed a shinny new set of micro-services and it behaves in a strange manner. Hard to say why with so many moving parts...\n\nLet's leverage the newly installed service mesh to understand what we've deployed, find the root problem, fix it with a bandaid and then do a proper, non trivial, blue-green deployment of a v2.\n\nThat will involve the Service Graph, Prometheus monitoring, Grafana Dashboards, Traffic mirroring, all orchestrated in a simple manner by Istio.",
        "categories": "4fee2bdd-0cf4-5429-945c-42a422577ff5",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["E9KBYRpQ2udwy6wkEldMgQdZypw2"]
    }, {
        "id": "Df5YXay5Fq4SUb5crM8R",
        "title": "Concourse : CI/CD version 2020 !",
        "level": "intermediate",
        "abstract": "Comme on dit souvent : il n'y a pas que ... Et cette fois-ci c'est Jenkins. De sérieuses alternatives existent avec des approches réellement innovantes.  D'abord pensé pour les **pipelines**, et nativement bâti sur **Docker**, Concourse fait parti des outils de **CI/CD** de nouvelle génération.\n\nVenez découvrir Concourse, développé par **Pivotal** et utilisé pour tous leurs pipelines. Après plusieurs mois d'utilisation, je souhaite vous faire partager les idées et concepts de Concourse, puis place à la pratique pour vous montrer quelques idiomes/patterns (et ainsi éviter les premiers pièges !).\n\n_Bonus : Découvrez comment installer un environnement de test en quelques secondes !_",
        "categories": "4fee2bdd-0cf4-5429-945c-42a422577ff5",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["DQHwfFU9oBZMzOpKLxOWdymoK053"]
    }, {
        "id": "DubbsXvQ6bZJtZwVM4aw",
        "title": "Enlarge your team !",
        "level": "beginner",
        "abstract": "Passer de 1 à 10. Ou de 10 à 30. C’est le rêve de beaucoup d’entrepreneurs, mais qui n’est pas sans difficultés. Les petits problèmes du départ peuvent rapidement devenir des monstres à gérer si on ne s’est pas préparés. Parce que la taille compte, voici un retour sur les erreurs que j’ai pu commettre, et des choses qui ont bien fonctionné.",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["gc7UU76X8rPr0TlUxisWFi8deWD2"],
        "comments": "Je n'ai pas encore réalisé ce talk, mais je le ferai pour la première fois au web2day cette année. Il sera plus orienté équipe de devs si jamais vous le sélectionnez puisque c'est de toute façon ce que j'ai le plus connu.\n\nMon précédent passage au DevFest : https://www.youtube.com/watch?v=6aQK6GoTbxM\n\nBisous !"
    }, {
        "id": "EoEUXvoHi51Snm9kjxrB",
        "title": "La conquête de l'espace se déroule dans votre poche.",
        "level": "beginner",
        "abstract": "Et si je vous disais que pour partir dans l'espace vous n'avez pas besoin de passer par la NASA ?\n\nVenez embarquer dans un talk qui vous fera traverser un champ d'astéroïdes, conquérir Mars, et même peut-être trouver des aliens...\n\nVotre navette ? Un smartphone.\nVotre fusée ? Un bout de carton et deux lentilles.\nVotre départ ? Immédiat !",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["H9ABELSm38U2QOiMM5hA3XRlqh13"],
        "comments": "Format : Slides + Livecoding\n\nVoici le plan prévu (40min + 10min de Q&A) :\n\n1. (`5min`) Présentation rapide de l'API Cardboard et des différences avec l'API Daydream (et très globalement les autres API de VR disponibles)\n2. (`10min`) Explication des différents Degrees of Freedom, du Sound Spatialization et du render des images avec distortion + livecode d'un voyage en First Person dans l'espace (mise en place d'un projet Cardboard à partir d'un projet Android, et ajout d'une scène, d'un traitement d'input et d'un son)\n3. (`10min`) Explication des interactions possibles avec un Cardboard, du mécanisme de Raycasting (livecode de shoot sur des astéroïdes avec le mécanisme de raycasting)\n4. (`10min`) Démonstration des contraintes et problématiques, comme l'optimisation, le temps de calculs max pour éviter le motion sickness ou les limitation imposées par la plateforme liés à la VR et à l'API Cardboard (mise en pratique avec un ajout massif d'événements : une invasion d'aliens qui va réduire les Frames Per Second et illustrer le motion sickeness)\n5. (`5min`) Conclusion \n\nPour éviter de dépasser mon temps imparti, l'ensemble des Assets et des parties de code qui ne sont pas au coeur du talk seront déjà prêtes, et les parties de livecodes ne correspondront qu'à ce qui est présenté.\n\nPour chaque partie de livecode, j'aurai une version déjà compilé et installée sur mon téléphone que je pourrai caster sur l'écran pour la présentation."
    }, {
        "id": "EvA2JoADi5d8bHGeYbYW",
        "title": "Kubeflow : Tensorflow on Kubernetes",
        "level": "intermediate",
        "abstract": "L’intelligence artificielle est en train de révolutionner tous les domaines : médecine, pharmacie, automobile, même l’informatique en lui-même. Mais la multitude d’outils mis à disposition des développeurs rend la portabilité et l’entrainement de modèle compliqué, non répétable et non scalable.\nDurant ce talk, nous verrons comment déployer Kubeflow, un projet tirant partie de la puissance de Kubernetes afin d’entrainer des modèles de Machine Learning basé sur Tensorflow. Nous verrons aussi comment grâce aux GPU et Kubernetes, nous pouvons accélérer la phase d’apprentissage de chaque modèle. Enfin, nous verrons comment entrainer un modèle de machine learning simplement grâce à JupyterHub.",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["VeBTP8lqOYaXBCpwTlGjBW2n1yH2"],
        "comments": "This talk is about training, serving and export machine learning model based on TensorFlow and Kubernetes easily"
    }, {
        "id": "FF83uoI8p21o7CkYJhEm",
        "title": "Comment perdre sa surchage featurale ?",
        "level": "beginner",
        "abstract": "Le cycle de vie d'une application est un chemin nébuleux et plein de dangers. La complexité ne fait que croitre durant les mois et les années d'utilisation. L'un des plus gros challenges d'un développeur est de pouvoir la contrôler tout en ajoutant de nouvelles fonctionnalités (features).\n\nDes solutions existent : le ré-écriture de code ou encore la maitrise de la dette technique. En effet, ces deux actions permettent de lever \"la complexité accidentelle\". Mais que faisons nous de la \"complexité essentielle\" ? La complexité qui n'est pas liée au code.\n\nLa seule solution : Supprimer des fonctionnalités ! Ce talk vous expliquera comment perdre la surcharge featurale de vos applications en comprenant la différence entre la complexité essentielle et la complexité accidentelle, mais aussi en vous donnant des clés pour mener à bien ce changement dans vos équipes projet.",
        "categories": "b8f42b3e-d1d0-5212-bb39-9dfad1b01661",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["JkWN4X6967cvBrV2x8vKf1QrHS93"],
        "comments": "Je suis obligée de soumettre au CFP du devfestnantes de cette année, vu comme je me suis éclatée en 2017 :)\n*fingercrossed*"
    }, {
        "id": "Gae2z13SryUB3j9rP003",
        "title": "Stargate : Téléportez vous sur Mars (avec votre smartphone) !",
        "level": "beginner",
        "abstract": "# Passez la porte des étoiles avec AR Core !\n\nLa réalité augmentée est arrivée depuis quelques temps sur nos smartphones… Le jeu \"Pokemon Go\" a connu un grand succès populaire, mais ce n'était que les prémices de cette révolution qui sera bientôt accessible au grand public. En effet, avec les nouveaux SDK \"AR Core\" et \"AR Kit\", les progrès sont fulgurants et commencent même à faire de l'ombre aux terminaux dédiés comme le célèbre Hololens (et bientôt le très attendu Magic Leap).\n\nVenez donc découvrir comment utiliser le SDK Google AR Core, Unity 3D  et une vidéo 360° pour vous téléporter vers la destination de votre choix (Mars, La lune, station spaciale, …) avec simplement votre smartphone (Android).\n\nVous repartirez ainsi avec votre \"porte spacio-temporelle\" et pourrez la partager à tou(te)s vos ami(e)s terriens !\n\nLes prérequis :\n* PC \n    * Windows 10\n    * Unity3D version récente (2017)\n* Smartphone :\n    * Terminal compatible avec ARCore : https://developers.google.com/ar/discover/supported-devices\n    * Android version 7+, en mode développeur, avec accès au Play Store\n    * Câble USB pour connexion PC - Smartphone\n\nNB: Avoir déjà déployé soi-même une App sur son smartphone Android est conseillé.\n\n",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["uxepB1vrpvUnujmGe6AwG9jWXy52", "8UQcYy7KXNWw379dG3b04DtwwWu1"],
        "comments": "Bonjour,\n\nNous proposons ce talk en tant que Code Lab, car il nous parait assez facilement jouable pour/par tout public avec un bon effet \"Whaouhou\" à l'arrivée.\nNos aurons sans doute un troisième speaker (Jérémy).\n\n\nDevfestement,\nSébastien"
    }, {
        "id": "HywRLwSAH6gxCnZ1J3UK",
        "title": "Un joli template ne rendra pas votre produit utilisable",
        "level": "intermediate",
        "abstract": "Vous avez trouvé un template Bootstrap Angular React Material Design 4.0 qui *“fait le job”*, et vous vous dites *“pas besoin d’un designer”*. Vous lancez votre produit, et là surprise : les utilisateurs n’y comprennent rien. Comment est-ce possible ? Vous avez pourtant de jolis boutons Material Design et les couleurs ne piquent pas les yeux, c’est à ne rien y comprendre ! \n\nMais le design, c’est plus que des jolis boutons. Travailler avec des templates est possible, mais **pas sans une réflexion en amont sur les besoins, les parcours et une solide architecture d’information**. Nous ne sommes pas des machines ! Au travers d’exemples de projets réussis et d’échecs, je souhaite montrer **comment remettre l’utilisateur au cœur de nos projet et produits tout en utilisant efficacement votre framework ou template préféré.**\n",
        "categories": "b8f42b3e-d1d0-5212-bb39-9dfad1b01661",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["mgaHfTteB0VlvHg0kEK8J4XUm5G2"],
        "comments": "Le talk peut-etre fait en 25 comme 45 minutes.\nJe ne souhaite pas être filmée moi mais aucun problème à ce que que mes slides et ma voix soient enregistrés "
    }, {
        "id": "IDBmKA8wjQdkVjiFvpam",
        "title": "Redécouvrir l’univers connu avec des dataset de la NASA",
        "level": "beginner",
        "abstract": "Cela fait des années que l’humanité explore le ciel, rêvant de voyages intersidérales et de nouvelles colonies planétaires. Et toi, as-tu envie de partir 3h avec nous à la découverte de l'univers ?\n\nIl se trouve que la NASA possède un formidable jeu de données publiques, notamment celui qui est utilisé pour la recherche d’exoplanètes, c’est-à-dire de planètes situées en dehors de notre système solaire.\n\nNous vous guiderons, au cours de ce Hands-on, dans les différentes étapes permettant de redécouvrir des exoplanètes en utilisant Warp10, une plateforme open-source de traitement de séries temporelles.\n",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["nBxUaLBVQxU9dbiIfiUpR9T5Tsx2", "uGGZuv5ZwmbTOZhWhBujIEIhQ7W2", "pYuiGicpt0MenD8NEMhZXtk6VSr1"],
        "comments": "On est vraiment contents de comment ce lab HelloExoWorld a marché dans les conférences où on l'a presenté, on a eu a chaque fois des retours très enthousiastes. \nLorsqu'on a vu que la thématique du DevFest 2018 tait l'espace, on ne croyais pas nos yeux, quelle meilleur endroit pour parler de exoplanètes et des données de la NASA ? \n\nOn a mis tout le [matériel didactique sur  le web](https://helloexoworld.github.io/hew-hands-on/), car on croit à fond dans la démarche ouverte et car l'objectif de notre\nassociation est aider à faire avancer la science citoyenne et donner l'envie au plus grand nombre de se lancer à jouer avec les merveilleux dataset que la NASA ou l'ESA mettent\nà disposition du public.  Pouvoir présenter HelloExoWorld à Nantes nous permettrait de toucher un grand nombre de développeurs, et les accompagner dans la découverte du dataset, des time series et des outils d'analyse.\n\nEn termes de logistique, à nous trois on a géré des labs à 50-60 personnes, mais si vous prévoyez une salle avec plus de capacité on peut faire appel à un 4ème speaker (Emmanuel Feller, de Lunatech) pour nous épauler, afin d'être disponibles pour que tout le publique puisse suivre, poser des questions eta voir du support de  qualité. \n\nLa seule chose dont les participants auront besoin est un navigateur web recent, toutes les données seront sur des serveurs gracieusement mis à disposition du projet  par OVH et Clever Cloud. Pour palier à une possible défaillance réseau, nous aurons aussi un router wifi et toutes les dataset et outils installés sur nos machines, afin de pouvoir faire tout le lab en offline,\n\n"
    }, {
        "id": "Ja66RxbywoqfQ2njF06a",
        "title": "Top Speaker : Sujet Data par Ingrid",
        "level": "beginner",
        "abstract": "Sujet sur la mise en place d'analyse de données dans ces apps. Je la motive à soumettre le sujet histoire de tracer le sujet",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "speakers": ["bAkrQrssjgU1zb5V2y2QpVnuCmf1"]
    }, {
        "id": "Jo5lwm7DZO2Yij39SSLo",
        "title": "Kotlin : Le back du futur, le codelab",
        "level": "beginner",
        "abstract": "Depuis l’annonce par Google du support de Kotlin sur Android, les développeurs d'applications mobiles se sont fortement intéressés à ce langage récent. Mais \"**Nom de Zeus !**\" est-ce réservé aux développeurs mobiles ? Non, Non et Non. Kotlin tourne sur la JVM alors autant en profiter dans tous nos projets.\n\nViens nous rejoindre pour découvrir toutes les facettes de ton futur prochain langage préféré. À travers plusieurs exercices, tu apprendras à transformer ton vieux Java en Kotlin puis à penser directement en Kotlin pour plus de \"**fun**\" et moins de \"**void**\".\n\nPas encore persuadé que ce codelab est fait pour toi ? Regarde ces avis de développeurs déjà convaincus :\n\n    \"Java ? Là où on va, on n’a pas besoin de Java !\"\n  Un développeur backend à propos de son prochain projet en Kotlin.\n\n    Faut voir grand dans la vie, quitte à coder sur la JVM, autant choisir un language qui ait d’la gueule !\"\nUn autre développeur backend après la conférence Kotlin : Le back du futur.\n\n\n**Doc Gautier et Adrien Mc Fly**",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["QNcsmbf38GaAYxMzfIiyT9bOZDE3", "GaTXktSpMGXO1RIGafgjJ9m87oB3"],
        "comments": "Nous allons alterner un petit peu de théorie entre chaque exercice pratique.\n\nLes participants réaliseront progressivement un algorythme de conversion de date en chiffre vers date en toutes lettres.\n\nNous fournissons à chaque étape des tests unitaires pour valider l'exercice et permettre à ceux qui avancent vite de continuer en autonomie.\n\nEnfin, pour passer d'un exercice à l'autre, nous passons simplement d'une branch git à une autre\n\n1. declarations variables, fonctions et class (dataclass)\n2. conditions, filtres, streams\n3. créer un companion\n4. Paramètres nommés, gestion du null\n5. Paramètre optionnel\n6. Mise en place de ktor\n7. Ajout un point d'entrer REST avec notre algorythme de conversion"
    }, {
        "id": "KfPaChaOipOdJXXwaPOv",
        "title": "What Can We Learn With JavaScript Fatigue?",
        "level": "beginner",
        "abstract": "By the time I’m writing this abstract NPM has 568,191packages. Tomorrow an average of 447 new ones will be published. In this talk, I will not complain about it. Instead, we will study this phenomenon in depth and see what can we learn from JS Fatigue and how to deal with it without headaches.\n\nThe whole reason for JS Fatigue is not the huge amount of modules we’ve got available, the real issue is the mindset we have when writing code. With an average of 447 new packages a day and lots of new technologies appearing it seems impossible to keep up with the insane velocity things happen in the JavaScript ecosystem, but actually you don’t necessarily need to.\n\nIn this talk, I won’t talk about the language itself and I won’t talk about frameworks. I will talk about what how this ended up happening and why we should see it as a positive thing from a software engineering point of view. For a very long time we have been talking about componentization and reusability and now that we’ve got it we started complaining about it, how did that happen?\n\nWe will talk about Unix Philosophy, about the current state of open source software development and about our role as software engineers, after all, we’re not paid to write code, we are paid to solve problems.",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["GmJvMDty6FcEme9n8SOEhA8bylm2"],
        "comments": "I have chosen the `Web` category for this talk because even though it has JavaScript on its title, I think it is more focused on software engineering when it comes to developing for the web platform.\n\nRecently I have been very active in the JavaScript community and I'm one of [Chai.js](https://www.npmjs.com/package/chai) core maintainers. Chai has about 5 million downloads a month and is one of the 50 most popular packages on NPM. I also maintain [Sinon.js](https://www.npmjs.com/package/sinon), another very popular NPM package. Due to this experience, I've got a pretty wide view of the whole JavaScript ecosystem and I've also had contact with many developers so I understand how they feel about it and what are their main struggles regarding JS Fatigue.\n\nI have been speaking all across the world last year and wherever I go JS Fatigue always comes up when chatting with other developers, this is an extremely hot topic and this talk has important lessons for every developer to see. Even though we will use the JavaScript ecosystem as an example this talk will be language agnostic so everyone can get a grasp in a more efficient way to solve problems and build software.\n\nThe blog post I've written about this is the most accessed one in my website and got to the first place on HackerNews the day after I published it, which demonstrates how much people care about this topic."
    }, {
        "id": "Mbe5tcjbsIbisiNjJQ7B",
        "title": "MACHINE LEARNING & JS : TAKE YOUR PWA TO THE NEXT LEVEL",
        "level": "intermediate",
        "abstract": "Machine learning is no longer just for snake charmers (pythonista) or those with access to powerful computational resources. As part of the PAIR project, the Google Brain team released last year the deeplearn.js library which has since evolved into TensorFlow.js. Tensorflow.js takes advantage of WebGL to allow among other things to build and train neural networks in the browser from scratch or using techniques such as transfer learning.\n\nAlso a recent release of Tensorflow backend for Tensorflow.js now allows you to fully take advantage of the hardware (GPU, TPU, CPU ) directly on the server side via Node.js.\n\nI will explain you during this talk, based on my own experience, how I took my progressive web app to the next level using machine learning as well as the possibilities available to implement machine learning into your browser.",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["HRuxHSCcItYjNHFdRGCXK31LwHI2"],
        "comments": "Hello! The same talk was originally propose as a conference  with my colleague but unfortunately he will be traveling that day so he will no longer be available to do it with me so instead I'm proposing a quickie :)"
    }, {
        "id": "NwrVGVGi0JrbkA8tSZDr",
        "title": "Les nouveautés \"serverless\" de Google Cloud",
        "level": "beginner",
        "abstract": "Des millions de personnes échangent des selfies sur Snapchat ou jouent à Super Mario Run tous les jours. Savez-vous où ces applications tournent ? C'est le vénérable Google App Engine et l'infrastructure de Google Cloud qui permettent aux développeurs de se focaliser sur leur code et de laisser le soin de scaler l'application à Google. \n\nQue vous déployiez des applications avec App Engine, ou des fonctions avec Cloud Functions, vous ne vous souciez plus de serveurs ou de clusters à provisionner et vous payez proportionnellement à l'utilisation, sans coûts fixes. \n\nDans cette session, découvrons ensemble ce qu'il y a sous le capot, et surtout les nouveautés \"serverless\" de Google au delà d'App Engine et Cloud Functions.",
        "categories": "4fee2bdd-0cf4-5429-945c-42a422577ff5",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["T0c4tdkG6PTJTDajvQVpJRzFsU63"],
        "comments": "Cette présentation couvrira des nouveautés annoncées à Cloud Next San Francisco fin juillet.\nJ'ai gardé l'abstract un petit peu vague, car les nouveaux produits / fonctionnalités / etc ne sont pas encore officielles, donc je ne peux pas les mentionner dans l'abstract pour le moment :-(\nJe propose de mettre à jour éventuellement l'abstract après Next pour préciser plus le sujet.\nEn tout cas, le talk tel que décrit dans l'abstract peut-être publié tel quel, vu que je ne révèle (pour le moment !) rien de top secret :-)"
    }, {
        "id": "OSeRNhvgAv183XS9gPAA",
        "title": "Event loop et asynchronisme en JavaScript",
        "level": "intermediate",
        "abstract": "Sans utilisation des web workers, JavaScript est un langage monothread, qui offre cependant la possibilité d'exécuter du code de manière asynchrone.\n\nA travers une exploration du fonctionnement de la stack, de la queue et de l'event loop, ce quickie sera l'occasion de comprendre les limitations de cette gestion l'asyncrhonisme en JS.",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["PRuMzxC7NVbsVnJP07AbHR2cNFx2"]
    }, {
        "id": "P0BvVxVudz7UVHZt9XMb",
        "title": "La \"process communication\" ou comment faire rentrer les gens dans des cases pour mieux communiquer avec eux",
        "level": "beginner",
        "abstract": "La Process communication propose des outils pour expliciter les problèmes de communication et pour les résoudre . Elle est utilisée par les psychologues de la NASA afin de s'assurer de la meilleure collaboration possible entre les astronautes pendant leurs missions. \n\nBon dans l'IT, d'accord, on ne risque pas de faire exploser une fusée lors de soucis de communication avec nos collègues. Pourtant la communication, tout le monde sait que c'est un facteur important à la réussite d'un projet, à la bonne ambiance dans une équipe, ou simplement dans nos échanges avec nos proches. Pour autant parfois malgré toute nos bonnes intentions, des situations conflictuelles naissent, et peuvent nous affecter. \n\nJe vous partagerai durant ce quickie les 6 types de personnalités décrites dans la Process Communication. A chaque type de personnalité correspondent : des caractéristiques comportementales, un mode de percevoir le monde, des besoins psychologiques, un « canal » de communication privilégié.\n\nA la fin de ce quicky, vous en saurez plus sur vous même mais aussi vous serez capable d'identifier et de mieux comprendre les profils de votre manager, vos collègues, vos proches. Et surtout vous verrez comment communiquer avec eux pour vivre dans un monde doux, paisible et merveilleux avec plein de bisounours ! _(j'ai bien dis bisounours, pas des toupoutous à la Alain Chabat  ;).)_\n",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["aJ1AY0He6aQsACtISRIGq5mIcsA3"]
    }, {
        "id": "PJCe625jLE7vr3ErJKfb",
        "title": "Serveur d'intégration mobile gitlab ci avec Fastlane",
        "level": "beginner",
        "abstract": "Pour ce talk version courte, je présente notre serveur d'intégration d'application mobile.\n\nLa création et la diffusion d'une application mobile sont des tâches répétitives et fastidieuses, mais il est possible de les automatiser. Le but est de gagner en rapidité de livraison, et d'améliorer la qualité de l'application.\n\nNous utilisons gitlab-ci et Fastlane pour compiler l'application, déployer une version beta, lancer des tests unitaire et générer un rapport avec screenshots automatique de chaque écrans, sur plusieurs devices et dans  plusieurs langues. Cela permet rapidement de contrôler le rendu de l'application sur plusieurs tailles d'écrans.\n\n\n\n",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["TlarIquBIndJVIf5bcVSfo2f9Ze2"]
    }, {
        "id": "QK5zrQexrJGKfkjw7OOg",
        "title": "Machine Learning made simple with MLKit",
        "level": "beginner",
        "abstract": "Machine learning is becoming an important part of mobile development to help us provide a frictionless experience for our apps users. However at the same time it can be a pretty complex subject to tackle. Luckily for us though, Firebase MlKit is now available for us to ease this implementation into our apps.\n\nIn this talk I want to introduce you to Firebase MlKit and how you can integrate it into your production apps. We'll look at how we can perform face recognition, image labelling, text recognition and several more commonly used mobile use cases. Firebase makes it so easy that you'll walk away with the confidence in being able to provide these experiences to your users in no time! \n",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["TPWhOWHNJAchLUJWXi1RORH4xF32"],
        "comments": "Speaking timeline: https://github.com/hitherejoe/PublicSpeaking"
    }, {
        "id": "QkY6ihye8sdR63spnafH",
        "title": "Automate your whole iOS Projects (& share resources with Android)",
        "level": "intermediate",
        "abstract": "During the life of a project, there are a LOT of tasks quite repetitive and time-consuming. But not all people know how much those steps can all be automated!\n\nWith this session you'll have an overview of which tools and techniques can be useful to automate various steps of the lifetime of your project, including :\n - the creation and configuration of your Xcode project, its build settings and build phases\n - its initial structure to be ready for the architecture of your choice\n - the configuration of Fabric & Crashlytics & 3rd party libraries\n - internationalising & localising your strings and sharing them with the counterpart Android project\n - maintaining constants for all your resources\n - generating your database model, and sharing with the counterpart Android project\n - generating repetitive code\n - doing Code Reviews & commenting on common mistakes on Pull Requests\n - running your tests\n - automating AppStore submission (binary & metadata automation)\n",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "speakers": ["1azTdqRhX2ceYqyoELvdgtjWChl2"]
    }, {
        "id": "SLvpelJLCS8yvPcP1I5e",
        "title": "The postmodern API: gRPC on Android.",
        "level": "intermediate",
        "abstract": "\nMost of mobile apps today need communicating with a server. And most of them rely on REST APIs to do so, putting aside how it’s implemented or whether it respects the REST Architecture or not. In a context of distributed and autonomous back end teams, adopting micro-services as an architectural approach, many developers have been arguing about the efficiency of loosely typed interfaces of REST. \n\nSince 2015 when Google open sourced gRPC many of them have been using it alongside Protocol Buffers as message format instead of REST and JSON. \nBut not all of the front end developers followed through, which made backend developers duplicate efforts to add specific endpoints in REST.\n\nIn this talk we will see how Android Developers can make faster server calls, while saving battery life and data usage, by creating a gRPC client for Android.",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["TFTWgPHaF4U3BGSHGFEfjXCUZ5i2"],
        "comments": "Dear Organizers, \n\nAt Vente-Privee, our  back end teams have been using micro-services, alongside gRPC to communicate between them. This helped them gain in flexibility and productivity, using different languages for different purposes. Yet when it comes to our API, they still had to use REST and JSON. \n\nIn this quickie talk we want to advocate the use of gRPC client on the front end and specifically on mobile, to enhance app performances and unload back end developers from REST API creation."
    }, {
        "id": "SMvJigGfKiQb56ZmNBkG",
        "title": "What's up TC39 ?",
        "level": "beginner",
        "abstract": "Il y a aujourd'hui plus de 30 propositions dans le backlog du TC39. Que nous réserve le futur ? Si vous n'avez pas envie d'aller vous perdre dans les compte-rendus de réunion du comité, je vous raconterai où nous en sommes aujourd'hui et à quoi ressemblera le Javascript de demain.",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "speakers": ["DNlgKL7C5DNK0y48Lf7ylPB4bmk2"],
        "comments": "Je parlerai de ce qui est dans le pipe du TC39 et donc de ce qui va (surement/peut-être) arriver dans ECMAScript.\n\nJe commencerai par une petite présentation du comité et de son fonctionnement.\nOn verra ensuite des choses qui sont déjà en Stage 4 et devraient arriver bientôt comme `rest/spread operators` ou les  `async iterations` mais aussi des propositions bien moins avancées comme les `decorators`,  `import` ou `observable` qui sont en Stage 1, 2 ou 3\n"
    }, {
        "id": "SVbCNWKAsIkHWH5NVskC",
        "title": "PHP8 et Just In Time Compiling",
        "level": "intermediate",
        "abstract": "Les grandes lignes de la roadmap de PHP 8 viennent d'être annoncées. La compilation à la volée (Just In Time Compiling or JIT) est le premier élément de la liste.\n\nCe n'est pas une surprise, les ingénieurs de Zend travaillent sur ce sujet depuis plusieurs années, et beaucoup de modifications du moteur PHP apportée par la version 7 étaient un travail préparatoire à ce changement technologique.\n\nCette conférence a pour but de démystifier ce qu'est un JIT et d'apporter de la lumière sur le fonctionnement de celui en cours d'élaboration au sein du moteur PHP.\n",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "speakers": ["CN3O5R3XQ7SUdiSFVUO1zmtRkPk1"]
    }, {
        "id": "SyHZu1duvU6XTxibpC62",
        "title": "Vanilla JS 2018",
        "level": "intermediate",
        "abstract": "Imaginez une application Web qui utiliserait toutes les nouvelles APIs des navigateurs en même temps. Ce n'est peut être pas le projet le plus raisonnable pour un besoin client mais pour de la veille, c'est passionnant ! Je vous propose un retour sur cette expérience un peu hors du commun.\n\nOn a tous vu une conf ou lu un article sur une nouvelle fonctionnalité des navigateurs mais ce n'est pas toujours évident de se faire une idée quant à la question : \"ok mais globalement, vers où on va ?\"\n\nJ'ai donc lancé un projet bac à sable nommé Vanilla JS 2018. Il a des règles strictes (sinon on s'ennuie !) :\n- Interdiction totale de l'utilisation de code source externe au projet\n- ‎Volonté d'utiliser autant de nouvelles normes que possible. Quelque soit les univers : HTTP, HTML, DOM, JS, CSS.\n- ‎Tout est autorisé du moment que ce soit une norme non propriétaire et que cela fonctionne dans au moins 2 navigateurs (flags autorisés).\n\nNous parlerons d'un bon nombre de sujets :\n- HTTP/2\n- Web Components\n- Virtual Dom\n- State Management\n- Web Workers\n- Service Workers\n- CSS Grid\n\nJe vous propose de vous présenter les résultats d'un \"fun project\" qui, pour moi, a sûrement été le plus intéressant et enrichissant depuis longtemps si ce n'est depuis toujours.",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["u6xKtXK4v9U3m4Qei9Oloyn0hm62"],
        "comments": "Tout est dans l'abstract, j'adore ce projet, j'espère avoir l'occasion d'en parler !"
    }, {
        "id": "SztHauNgxYuLzqtH2Gvm",
        "title": "Venez coder votre 1ère application Flutter !",
        "level": "beginner",
        "abstract": "Flutter est un SDK open-source pour créer des application iOS et Android performantes et adaptées à l’OS. ‘Un peu comme React Native ou Xamarin ?’ vous pourriez vous demander ? Oui, un peu… mais avec une intégration avec les widgets natifs et des niveaux de performance qui vont au delà de ce que Xamarin ou React Native peuvent proposer, le tout avec très peu de lignes de code.\n\nDans ce bootcamp nous allons faire une introduction pratique à Flutter. Et lorsque je dis pratique, c’est du pratique, vous allez coder… Vous arrivez à la séance équipés d’un ordinateur portable, avec Android Studio ou VS Code et vous partez à la fin en ayant développé une petite application Flutter tournant sur Android et iOS, et plus important encore, en ayant intégré les principes basiques du développement sur cette plate-forme.\n\nLe Bootcamp Flutter est donc une introduction accélérée et pratique au développement d’applications mobiles avec Flutter. Vous allez apprendre, mettre les mains dans le cambouis, coder et vous allez enfin cocher la case \"Apprendre à coder des applications mobiles\" dans votre ToDo-list.",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["9LHSTmgvjXcyMPyfifAgXjtP6Z02", "pYuiGicpt0MenD8NEMhZXtk6VSr1"],
        "comments": "Je travaille avec Flutter presque depuis le jour où il a été annoncé, j'aime beaucoup cette techno et j'essaie d'y évangéliser autour, au point que depuis Noël je suis Google Developer Expert en Flutter.plusieurs fois ce Codelab avec des bons retours dans des meetups, j'ai envie d ele proposer à une grande conf, car je pense que c'est le bon moment pour se lancer sur Flutter, la v1 et bientôt prête et la techno est mure et simplement superbe.\n\nJ'ai pris Pierre comme co-speaker, il a une belle expérience avec Flutter et autant d'envie que moi d’évangéliser la technologie."
    }, {
        "id": "TL9yhHRTqjHNoJq450qi",
        "title": "Remuneration Poker",
        "level": "beginner",
        "abstract": "Le retour d'expérience d'une pratique collaborative destinée à répartir les augmentations de salaires au sein d'une entreprise.\nComment faisions-nous auparavant ? Quelles problématiques cela me/nous posaient ?\nComment cette pratique est venue à nous ? Et le déroulé de notre première session \"rémunération poker\" !",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["mGoCYS40PXcDZbELsSJjt0m7uCp1"],
        "comments": "J'ai pensé au DevFest car c'est le seul événement où toute mon équipe va chaque année et c'est dans cet univers que j'ai eu les meilleurs retours quant à notre démarche interne.\nJe serais ravi d'accueillir vos retours et vos idées si le sujet vous inspire quant à l'intervention que j'ai pu réaliser précédemment.\n\nAu plaisir de vous rencontrer et d'échanger.\nDavid"
    }, {
        "id": "VDL3Gyhrsaimw2X8AYp4",
        "title": "The next big thing in (client side) templating",
        "level": "intermediate",
        "abstract": "In this talk we will talk about the evolution of client-side templating, and where the platform is taking us next. \nMaybe you thought ES6 template literals were just multi-line strings - but they are so much more. Your browser now has a native way of handling templating, that is both scalable and extensible - and really performant. \nWe will take the time to dive into the individual parts and understand how combining the template element with template literals might be the next big thing in templating. \nFinally I will share my thoughts on how and why, combining this with webcomponents, could be the future of frameworks. ",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["WP4HfOBAdCP90Wu77H251D5VUd73"]
    }, {
        "id": "VOUgStLp1ZtR7urmXClj",
        "title": "Mise en place d'une plateforme centralisée de gestion des logs avec la suite elastic",
        "level": "intermediate",
        "abstract": "La suite elastic (Elasticsearch, Logstash, Kibana, Beats, ...) est connue et reconnue lorsque nous désirons mettre en place soit une solution de recherche sur notre site d'e-commerce ou encore une plateforme centralisée de gestion des logs.\n\nSi vous n'avez jamais eu l'occasion de jouer avec ou de la mettre en place dans votre entreprise, ce codelab est pour vous. Nous allons mettre place, en partant from scratch, une plateforme complète de gestion des logs de vos applications et de vos serveurs : de la récupération des logs, à sa visualisation en passant par sa transformation et son indexation...\n\nNous en profiterons également pour aborder des produits moins connus comme X-PACK, Elastic APM ou encore Elastic Cloud.",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["H3QHP1wvJDUG0sW402gh9ktbNx03", "eMFPF8fp2UTnePLtRCc0XgQddy12"]
    }, {
        "id": "VlYW4zcZTNuxPtng8wiE",
        "title": "Testing Out Kotlin",
        "level": "beginner",
        "abstract": "Learn how to use Kotlin through a deep dive into writing tests. Kotlin is a high-level language that is fully integrated with both the Java programming language and Android Studio. It is used for Android development in many popular apps. Testing is a great way to learn Kotlin, write readable tests, and introduce your development team to the power of Kotlin.",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["FFR0y1rZA9TrfRqiJ3CRSX5tMAB3"],
        "comments": "Ahoy!\n\nI'm submitting several talks to allow you flexibility in selection. Please pick the talk that fits your track the best!\n\nCheers,\nSean"
    }, {
        "id": "X65XrTrsACrMV6Cwk6v9",
        "title": "It’s just like JavaScript… except where it isn’t",
        "level": "intermediate",
        "abstract": "re-discover an old language through a new syntax, re-discover an old paradigm through a new lens, discover ReasonML !\n\nReasonML is a dialect of OCaml. Created at Facebook by Jordan Walke, the creator of React, it aims at bringing OCamls type system and expressiveness to the JavaScript community. Compile to JS or native, interop easily with JS libs, be guided by great tooling. \n\nIf you like TypeScript or Flow and constantly hit their respective limits, this workshop is for you !",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["mFpJDbJtdIULJQtKkiNFaOHsQbK2", "u3ZxAhtpI8X21IW8GInJ4PxQx1J2"],
        "comments": "see references for motivation and background information.\n\nnous pouvons tenir ce CodeLab en français ou en anglais, selon les participants ou vos besoins."
    }, {
        "id": "XFS6cmeYsFmE67Lc6Zzb",
        "title": "Game of code challenge",
        "level": "intermediate",
        "abstract": "Venez participer à ce challenge de conception d’intelligence artificielle.\n\nLes règles sont simples :\n\nune bataille de personnages médiévaux en un contre un\n\nune API REST d’attaque à disposition\n\nune application web de visualisation du combat en live\n\nVous n’avez plus qu’à coder votre IA avec votre langage préféré, réagir en conséquence et affronter l’IA du serveur ou d’autres participants de ce lab.\n\nDes starter kits seront à disposition (Node.js, php, Java), la plateforme sera ouverte 2 semaines avant la conférence.\n\nTournoi avec des lots à gagner à la fin de la session.\n\n",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["hDzLDt6oyyME7lk1JVYIjPbW3XG2", "jMUwWI44kuTXsgUt8vLFp3vAe1j1"]
    }, {
        "id": "XdmHx1LFiZpEuOo4iEIy",
        "title": "SSR, SPAs and PWAs",
        "level": "intermediate",
        "abstract": "This talk has all the acronyms! It offers a deep dive into Server Side Rendering (SSR) in times of SPAs and PWAs. We will look at how pre-rendering JS applications server-side does not only improve perceived startup times but enables advanced techniques like incremental startup on the client and even progressive enhancement (yes, really!).",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["uXKiRbH7FVfJdTRPkoHFKTpoKvv2"],
        "comments": "We built a demo app that leverages all of the techniques that I'll cover in the talk. I'll use that app in all examples. The app is fully open source and available on github so people can actually have a look at the code and follow-up after the talk.\n\nI think the potential that server side rendering can have for single page apps and progressive web apps and the fact that it can be used in combination with e.g. progressive web app patterns is not well understood by the community. I just personally spent the last 3 months on adopting server side rendering for a big (mobile) PWA and was astonished by the results and benefits both in terms of usability and perceived performance but also in terms or actual performance improvements."
    }, {
        "id": "YjTzbKsQhzmXImXaxLEj",
        "title": "Fast and Beautiful: Modern Image Delivery Techniques",
        "level": "intermediate",
        "abstract": "The average website page weight is 50% images and 25% video. As the images and videos delivered to mobile devices get larger and larger, the load time of websites gets slower and slower. Further complicating matters, there are thousands of screens and devices with varying resolutions and CPU power that receive this content. In this talk, we’ll examine strategies to send the perfect image or video to every device, ensuring a fast, beautiful rendering of your content. We’ll look at how to test our content, and describe responsive images, delivering progressive images, and finally optimizing all of this content for fast delivery to each screen. Attendees will walk away with a better understanding of how to efficiently deliver beautiful images to every device that accesses their content.",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["3NlJfJABBASjyIZg5v4L665AdXR2"],
        "comments": "Thank you for your consideration!"
    }, {
        "id": "aoH98TmWRX9dw4jILMoX",
        "title": "Détectez et trackez les aliens qui se cachent dans vos dépendances ",
        "level": "beginner",
        "abstract": "[44% des applications contiennent des vulnérabilités critiques dans les librairies open-source qu'elles utilisent](https://www.veracode.com/products/software-composition-analysis) et cela bien que des bonnes pratiques comme OWASP Top 10 se soient généralisées. \n\nNe laissez plus ces aliens incuber bien au chaud dans le ventre de votre appli! \nGrâce à ce talk, vous apprendrez comment sont répertoriées ces vilaines bestioles (NVD, CVE) et comment est évaluée leur dangerosité (CVSS).\n\nPuis vous verrez comment créer votre première pipeline de Continuous Security dans Jenkins au moyen de [OWASP DependencyCheck](https://www.owasp.org/index.php/OWASP_Dependency_Check)  qui détecte les vulnérabilités et trackez les grâce à [OWASP DependencyTrack](https://www.owasp.org/index.php/OWASP_Dependency_Track_Project) (logiciels open-source) \n \nFaites le premier pas vers le DevSecOps !!!\n\nNote:  OWASP DependencyCheck est capable d'analyser des logiciels Java, .Net et de manière plus expérimentale, Ruby, Node.js et Python.",
        "categories": "1e18bcfa-f91a-5ac0-b2f1-ee586837c398",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["ZdNase96oBSI6QdrWySX9eCtJgs1"],
        "comments": "Mon talk sera composé:\n_de slides sur la partie background (qu'est ce qu'une vulnérabilité, comment sont-elles répertoriées (CVE) et évaluée (CVSS).\n_ d'une live démo de mise en place facile de OWASP DependencyCheck sur un projet existant dans Jenkins.\n_et d'une live démo d'analyse et de tracking de vulnerabilité sur le projet.\n\n\nLa problématique de sécurité s'est déplacée ces 10 dernières années des couches d'infrastructure aux couches applicatives. Le but de cette présentation est à la fois de sensibiliser les développeurs - car la sécurité est une affaire de tous - ainsi que d'apporter des outils intégrés aux gens qui aimeraient commencer une bribe de SDLC et passer le pas du DevSecOps.\n\nOWASP DependencyCheck est une alternative open-source et très facile à mettre en place vis-à-vis des majors de l'industrie. Elle permet notamment la compliance avec le point A9 d'OWASP TOP10."
    }, {
        "id": "b3DoqfVBSdTE9Yw7VPeS",
        "title": "Typographie et accessibilité",
        "level": "beginner",
        "abstract": "**Comment la typographie web peut-elle améliorer l’accessibilité d’une interface ?** Puisque le contenu est roi, penchons-nous sur le design du texte à l’écran, et sur sa capacité à améliorer l’expérience utilisateur des personnes en situation de handicap visuel et/ou cognitif.\n\nTaille, couleur, espacement et alignement des caractères ; longueurs des lignes ; polices de caractères adaptées ; personnalisation de l’interface par les utilisateurs ; aides à la lecture… Cette conférence vous permettra de **faire des choix typographiques éclairés en matière d’accessibilité**, et de créer ainsi des interfaces plus accessibles et plus inclusives.\n\nLa typographie étant une composante majeure du design graphique, cette présentation s’adresse en premier lieu aux designers UI. Mais la problématique de la typographie accessible concerne également les designers UX, les intégratrices et intégrateurs web, ainsi que toute personne amenée à contribuer à un projet web et s’intéressant au sujet.",
        "categories": "b8f42b3e-d1d0-5212-bb39-9dfad1b01661",
        "speakers": ["WcLIdgBZKjafCClB2t7uSDh3udj1"],
        "comments": "Bonjour !\n\nJ’ai rencontré Jean-Francois à MiXiT fin avril, et il m’a invitée à vous proposer la conférence que j’ai ai donnée, intitulée « Typographie et accessibilité ».\n\nSi ma conférence est retenue, j’aurais besoin que vous puissiez défrayer mon aller-retour en train depuis Rennes, ainsi qu’un hébergement à Nantes s’il vous plaît.\n\nVoilà, si vous avez besoin d’autres infos, faites-moi signe !\n\nBelle journée à tou·tes, et à bientôt j’espère ! :)\n\nMarie"
    }, {
        "id": "c8fPvdfYUIO3fjRPkPyu",
        "title": "🔍Fulltext search: Elasticsearch ou PostgreSQL ?",
        "level": "intermediate",
        "abstract": "Si vous avez un jour développé un moteur de recherche, alors vous avez certainement utilisé SolR, Lucene ou le plus récent: Elasticsearch. Mais saviez-vous que PostgreSQL offrait une fonctionnalité de recherche Fulltext ? 😮\n\nPourquoi s'engager vers une base de donnée NoSQL, alors que le SQL est si beau et si performant ? 😍\n\nCe talk est un retour d'expérience sur l'utilisation de PostgreSQL FTS sur un dump de Stack-Overflow (~150Go, 150m docs).\n\nQuels sont les avantages et inconvénients d'une monture SQL pour le développeur ? Et le sys-admin ?\n\nObtient-on les mêmes performances ? 📊",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["L3kZjY5dZ2UfPAj5GwBWDFQ8YV92"],
        "comments": "![](https://media.giphy.com/media/MDJ9IbxxvDUQM/giphy.gif)"
    }, {
        "id": "cdLnlIcpWc3YX4RPCxX5",
        "title": "Android all the things!",
        "level": "beginner",
        "abstract": "Want to build your own DIY smart house stuff but cannot handle a soldering iron without turning everything into a smoldering pile of ash?\n\nI've got you covered! All you need is a Raspberry Pi, a bunch of off-the-shelf sensors and some Kotlin code (and a bit of Javascript). I'll show you how I made my smart house system using Android Things, Firebase, an Android App and Actions for Google without setting anything on fire unintentionally. I'll show you how I used Android Things to collect data and use it with a TensorFlow model to try to predict trends in my house\nStarting from a blank Pi you'll end up with a fully functional app ready to be deployed on your own!",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["jOwPOYosNlUjLVFK7M8COZwgPsp2"],
        "comments": "Hello,\n\nJe peux faire mon talk en français ou en anglais, comme ça vous arrange pour le ratio FR/EN. Côté format c'est un format conf mais ça peut tout à fait être simplifié en Quickie.\n\nMarc"
    }, {
        "id": "cjHoCIWmK9FvqMrqHUbH",
        "title": "TOP Speaker : Android Component par Florina",
        "level": "intermediate",
        "abstract": "Florina à posté son codelab mais elle a oublié de soumettre le sujet en talk,",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["bAkrQrssjgU1zb5V2y2QpVnuCmf1"]
    }, {
        "id": "cpg7nxue0FXjTBTavcfg",
        "title": "Compassion-First Design pour l'intelligence artificielle",
        "level": "beginner",
        "abstract": "La croissance fulgurante de l’Intelligence artificielle nous offre un monde d’opportunités excitantes mais aussi effrayantes. Bientôt, nous interagirons avec la technologie au-delà de nos écrans. Tout objet deviendra espace de conversations. Ces nouveaux environnements permettront de nous immerger dans une réalité intuitive, momentanée et plus interconnectée que jamais. Cette réalité va transformer le métier de designers et soulèvent des défis importants: Comment allons-nous créer une expérience autour d’un moment de vie précis? Est-ce que le mot expérience sera toujours pertinent? Voici le secret: la compassion. Ne mettons pas l’Ai au centre du processus, voyons avec notre coeur. La compassion est le fondement essentiel du développement de l’interaction Humain-Intelligence artificielle. À travers la personnalisation contextuelle, la compassion permettra de passer d’expériences segmentées à la réalité hyperconnectée. \nDe nos défis, nous soulevons des questions de civilisation: si la compassion est apprise à des machines, cette vertu peut-elle être éveiller chez l’être humain? Si nous créons des machines émotionnellement intelligentes, pouvons-nous sauver l’humanité?",
        "categories": "b8f42b3e-d1d0-5212-bb39-9dfad1b01661",
        "speakers": ["4QuljP1RZPU3ZyR3gjhoGyxAxoS2"],
        "comments": "Bonjour les SUpers Orgas!\n\nJe voulais vous remercier une fois de plus pour l'année dernière, c'est vraiment agréable de se sentir accueillie et choyée, comme vous le faites avec vos speakers!\n\nBref, donc me revoila!\nMa co-speaker est actuellement a l'hopital donc elle a pas pu s'inscrire comme co-speaker mais je voulais pas rater le coche de l'envoi!\n\nBelle journée à vous tous!\n\nManon"
    }, {
        "id": "d4IYIupfb3L1al7KoZh5",
        "title": "Au pays des Gophers (à partir de 3 ans)",
        "level": "beginner",
        "abstract": "Au pays des Gophers, les Goroutines gambadent librement, et s’échangent des bisous et des bonbons grâce aux channels.\n\nLes méchants Locks sont tous deads (ou presque), et le Scheduler règne sur ce monde paisible qui ne connaît pas le nom des Processeurs.\n\nLa concurrence en Go expliquée à ma fille de 3 ans !",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["977YQDolbxde0ito7I2dUiee2ap1"],
        "comments": "Bonjour,\n\nJ'ai écris et dessiné ce quickie pour un event interne dans mon entreprise Zenika, avec pour but d'expliquer le fonctionnement de la concurrence en Go de manière ludique et compréhensible sans aucun pré-requis technique.\n\nLe sujet n'est pas nouveau, mais le Go est un langage que j'aime beaucoup et que j'aime encore plus faire découvrir.\n\nVoici les liens vers [les slides](https://docs.google.com/presentation/d/1z3FGOykVAqwXmb0VfMS096TtMOsv9rhPtFWSK5-5I7w/edit?usp=sharing) utilisés pour la 1ère version, ainsi que la [capture vidéo du talk](https://drive.google.com/file/d/1nd33CKZwXZF9i2Z3oM5ewC0_SVPC9kaJ/view?usp=sharing) (de qualité moyenne).\n\nLa version que je vous propose sera retravaillée (éventuellement de nouveaux slides et des dessins refaits) et d'environ 15 minutes.\n\nJe vous remercie de l'attention que vous porterez à ma proposition."
    }, {
        "id": "dQrZ0MHDeDBzcmlr92Cj",
        "title": "[Alex Ellis] Open FAAS",
        "abstract": "[Alex Ellis] Open FAAS",
        "speakers": ["CiJ9ahTlUSX1J6wj8C4PHpgEiHE2"]
    }, {
        "id": "debYXQwntQYpW2GvBtZj",
        "title": "Android Architecture & Architecture Components",
        "level": "intermediate",
        "abstract": "Android developers, we propose you to come experiment the MVP & MVVM Android architectures! From a simple Android app, we will work on why and how to implement architectures principles. We will see how to go from MVP to MVVM with Android Architecture Components.\n\nAt the agenda: Kotlin, RxJava, Refactoring, Unit Tests, Android architecture components and Koin.\n\nWarm up your AndroidStudio!!!\n\nRequirements: AndroidStudio 3.0+ with Kotlin plugin\n\nKnowledge: RxJava, Kotlin",
        "categories": "dfa320e4-1f9b-53ee-8c98-3ef48ba81013",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["YDApK7gdSfN86lA8nblfEtMHR7e2", "3gLXb3d2GuNS10ArYwo4bda3p7F3", "SOxFDVFePQVBor9U92lSoAohcJB2"],
        "comments": "This workshop has been made for a 2h30 format for AndroidMakers (room for ~100 people).\n\nWe can easily size it for 2h, the 2nd part was on persistence with Room and about 35 min. We can then propose the following schedule:\n\nTheory part (~20 min)\n- intro to Android architecture\n- Architecture Components\n- Kotlin\n- Koin\n\nProject setup (~20 min)\n- Project setup\n- MVVM Workshop overview\n\nMVVM Workshop part (~80 min)"
    }, {
        "id": "ehPR0YUz49eC57qgZXjA",
        "title": "Secret Management with Hashicorp's Vault",
        "level": "intermediate",
        "abstract": "HashiCorp's Vault secures, stores, and  controls access to tokens, passwords, certificates, API keys, and other secrets . It handles leasing, key revocation, key rolling, and auditing.\n\nIn this talk I will give an overview of secret management in general, Vault's concepts, explain how to make use of Vault's extensive feature set, and demo which features we successfully use in a current projects.",
        "categories": "1e18bcfa-f91a-5ac0-b2f1-ee586837c398",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["YrPGDzcnbLRyw7lwWsW2tVxWCvI2"],
        "comments": "Despite the same title, this will be a refactored and improved talk I held before -- so: same title but different talk.\nCheers"
    }, {
        "id": "fGcbv94Y2M9quyfKte9a",
        "title": "Penser son infrastructure comme du code",
        "level": "beginner",
        "abstract": "Recette pour configurer **1** infrastructure : suivre **2** pages wiki, exécuter **3** scripts, lancer **4** commandes, corriger manuellement **5** paramètres, passer **6**h à débugger un élément non prévu, et jouer au jeu des **7** différences avec ce qui était attendu.\n\nLorsque nous exécutons plusieurs fois un programme nous nous attendons à ce que son comportement soit toujours le même. Pourquoi en serait il autrement pour nos infrastructures ?  \nIl est possible d’appliquer à l’infrastructure, les méthodes et outils qui nous aident à fiabiliser nos développements. Après tout l’infrastructure peut aussi être un code comme les autres.\n\nVenez découvrir ou redécouvrir l’**Infrastructure as Code** !",
        "categories": "4fee2bdd-0cf4-5429-945c-42a422577ff5",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["hKc1vk2qrncKXF6VIYdzAXi0fGF2"],
        "comments": "L'objectif du talk est de présenter les principes de l’infrastructure as code et de convaincre les participants des bénéfices à y recourir. Des exemples de code et une démo sont prévus pour montrer comment il est possible d’intégrer l’IaC dans les même pipelines CICD que n’importe quelle application (que ce soit pour le déploiement, les tests, etc…). Des focus spécifiques seront fait sur les différents outils à disposition (spécifiques à chaque cloud provider, ou agnostiques).  \nLe trame n’est pas encore terminée, celle-ci peut encore évoluer.\n"
    }, {
        "id": "gLhhcBDx2BprIExEawsa",
        "title": "Créer un datapipeline en 20 minutes avec Kafka Connect",
        "level": "beginner",
        "abstract": "Chez iAdvize, nous utilisons en production Apache Kafka et le framework Kafka Connect pour créer facilement des data pipelines temps réels, scalables et résilients. Nous verrons comment Kafka Connect peut devenir une solution efficace pour vos flux de données entrants ou sortants de Kafka. En 20 minutes, nous créerons ensemble un pipeline d'A-Z, basé sur un cas concret .",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["KzcYefI9b9TVAxioQv9FL6Fyxmp1"],
        "comments": "J'ai l'expérience de faire des présentations en interne chez iAdvize et dans mes anciens jobs. Je souhaite étendre cette expérience en faisant des présentations à des audiences plus larges lors de conférences tel que le DevFest. Mon talk se veut retour d'expérience (usage en production) et réalisation d'un cas concret (à la limite du tuto)."
    }, {
        "id": "gXCviX7IKoBJx5CQCUnh",
        "title": "How do we use Vue.js in GitLab?",
        "level": "intermediate",
        "abstract": "At GitLab, we use Vue.js more than 2 years and we are really happy with it.  In this talk, we will talk about the followings,\n\n- Why did we choose Vue.js?\n  - How did we decide to use Vue.js?\n  - Why not the others?\n- How did we add Vue.js to our stack?\n  - How was GitLab's Frontend stack before adding Vue?\n  - What were the problems we tackled?\n- How do we use Vue.js right now?\n  - Tips to use Vue with jQuery.\n  - Tips to use Vue in a legacy Rails app without refactoring everything\n\n",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "speakers": ["SxMr445PTeY5HfqlJT53OhEaZrp1"],
        "comments": "I see your event in GDE Slack via a message posted by Jean-François Garreau. I am really excited about the event.\n\nHope to see you in the Nantes. Bonne journée."
    }, {
        "id": "jRHOnRBn9WOAtSO4Zg2S",
        "title": "Top Speaker : Gerard Sans : Diversity Talk",
        "level": "beginner",
        "abstract": "L'idée de ce talk est de revenir sur les intiatives en cours dans le monde des confs pour faire la promotion des femmes speakers entre autre. Il y serait question de tips & tricks. Et ça pourrait tourner en mode table ronde ou tout du moins interraction avec le public sur le sujet.",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "speakers": ["bAkrQrssjgU1zb5V2y2QpVnuCmf1"]
    }, {
        "id": "jb81XYfkSO7pNZjMgnL2",
        "title": "Git Dammit!",
        "level": "intermediate",
        "abstract": "\"T'as deux minutes ? J'ai un problème avec Git\". Telle est la phrase que l'on entend très régulièrement, murmurée dans les open-spaces. Le but de ce talk est de reprendre les problèmes les plus souvent rencontrés sur Git au travers un ensemble de cas d'usages, illustrés par des démos.",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["Ofaq0zwxHDeCz5jSfL20x5zKY2O2"],
        "comments": "Je ne sais pas trop quelle catégorie utiliser pour ce talk \"transverse\" niveau langage, qui n'est pas devOps non plus :-("
    }, {
        "id": "oeFJ3t02UBPF3dskvsfQ",
        "title": "Look mum, no hands! - Mind control in JavaScript",
        "level": "intermediate",
        "abstract": "A typical interaction with a device or interface involves touching it. Either you're pressing buttons on a controller, swiping on a touchscreen or clicking on your laptop's trackpad. But what if you could control things without the use of your hands? What if you could use... your thoughts?\n\nI have been tinkering with a brain sensor and developed an open source JavaScript framework for it to allow me (or anyone else) to control interfaces or robots using facial expressions and mental commands.",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["UtPdTAr3rUM9soHbtMG887fi4hH2"]
    }, {
        "id": "pNTrO3goIEdTgESu6SSJ",
        "title": "Crafting a Character: Create a Persona for your Google Assistant App",
        "level": "beginner",
        "abstract": "Do you want to build an awesome Google Assistant app that people will not only use rather out of necessity but actually love to talk to? It all starts with creating a persona; think of it as the front end of your Action on Google, the conversational partner you design to interact directly with users. Defining a clear system persona is vital to ensuring a consistent user experience that builds user trust. In this talk, you’ll learn about useful tools, get tips, and see a few examples of how well-designed personas can completely transform voice-enabled interfaces and boost user engagement.",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "speakers": ["OJtvRwGUS1VUlC7ArcjbicCUKj03"]
    }, {
        "id": "q6YYSgWyH0bIszwq53eU",
        "title": "Hands on Jigsaw",
        "level": "beginner",
        "abstract": "Jigsaw a été  enfin(?) lancé en orbite, il faut donc préparer nos applications à la modularisation selon java 9.\n\nQuoi de mieux qu’un peu de pratique pour tester et découvrir cela ?\n\nDans cet atelier, nous allons donc convertir une application multi-modules au sens Gradle en une application modulaire au sens Jigsaw (et Gradle).\n\nCela nous permettra d’aborder notamment les notions de module path, de gestion des dépendances ainsi que les impacts sur les tests unitaires.\n\nVous aurez besoin des outils suivants (pour gagner du temps vous pouvez les installer par avance) :\n\n* [GIT](https://git-scm.com/).\n* La dernière version du [JDK 9](http://www.oracle.com/technetwork/java/javase/downloads/jdk9-downloads-3848520.html) (ou du [JDK10](http://www.oracle.com/technetwork/java/javase/downloads/jdk10-downloads-4416644.html)) avec la variable d'environnement JAVA_HOME correctement configurée. [SdkMan](http://sdkman.io/) est un excellent outil pour installer et gérer vos versions de java (et gradle, maven, kotlin, ...).\n* Votre/notre IDE préféré [IntelliJ](https://www.jetbrains.com/idea/download/).\n",
        "categories": "3e79596d-6302-5601-a027-901bff9e2692",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["golnkyMWh5W7HjoAfmYcCvXh9Yg2", "wWYKM4fzp9SqMgB6euFohSb8ud33"],
        "comments": "L'atelier est accessible à tout développeur Java. Nous l'avons joué sous différentes formes (JUG, Devoxx) et nous ferons une autre version dédiée au DevFest si nous avons la joie d'être retenus.\n\nPour cet atelier il y avait et il y aura :\n * la documentation sous forme d'un [git-book](https://hands-on-jigsaw.gitbook.io/devoxx/)\n * le [TD avec les solutions](https://github.com/louiznk/hands-on-jigsaw-devoxx) ainsi que des étapes complémentaires pour ceux qui seraient plus rapides.\n\nA titre d'information il y a une image docker louiznk/marvel:10-debian qui correspond au résultat final (devoxx), pour le devfest nous espérons faire plus haut et voir plus loin (peut-être avec l'API de la NASA)\n\nMerci à vous"
    }, {
        "id": "qoqeisDRdyjNNJrOAH3k",
        "title": "B2B: Leveraging Bot-To-Bot communications ",
        "level": "intermediate",
        "abstract": "The Talk:\nChatbot are offering new ways to interact and communicate with IT systems. Humans are now able to use natural language to order food, ask for music or check news. Chatbots are however designed to interact or discuss on a dedicated topic. Bot-To-Bot communications can be leveraged to expand initial chatbot capabilities. Let's have a 30 minutes talk to understand the potential of this communication model.\n\nThe Workshop: 60-90 minutes workshop to build Bot-To-Bot experience with DialogFlow and Google Cloud Platform. This workshop would complete the 30 minutes talk.",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["ybQIhe8vG6R8JwNj9LlVDCZNZW73"],
        "comments": "This a talk and a codelab."
    }, {
        "id": "twygzwiPpRPqYvA9EbG1",
        "title": "A la découverte des algorithmes génétiques",
        "level": "intermediate",
        "abstract": "On entend souvent parler des algorithmes génétiques. Ils sont utilisés dans de nombreux domaines et par de nombreux logiciels qu'on utilise couramment.\nA travers ce hands-on, je vous propose de vous présenter le fonctionnement d'un algorithme génétique ainsi que quelques stratégies d'optimisation 🤓.\n\nEnsuite, c'est à vous de jouer ! Par équipe, vous développerez un algorithme génétique. L'objectif sera d'optimiser le parcours d'un véhicule 🚗 afin qu'il puisse s'adapter au mieux à un terrain plus ou moins chaotique.\n\n\nHappy coding 😜",
        "categories": "febe50ff-d2d9-5400-97de-839c80abc636",
        "formats": "bc4d1840-d260-5fb6-9e83-f1b0da239793",
        "speakers": ["OCdwPv6F8fdShLbwSDtFlvE0aZn1", "6HmFtonMn8SZ9nTAS6l1WYWEP9o2"],
        "comments": "Est-ce que le réseau est bon ? \nNous avons besoin d'accéder à une application sur Heroku. \nNous prévoirons aussi un fallback sur mon poste. \n\nNous restons disponibles si vous avez des questions."
    }, {
        "id": "vIlp0dAakE7aVCtmBXuv",
        "title": "Lisibilité & Design : Construisons ensemble des expériences numériques inclusives",
        "level": "beginner",
        "abstract": "Dyslexie, dyscalculie, troubles de l'attention, autisme, troubles liés à l'âge etc. Il existe un nombre incalculable de réalités très différentes derrière les troubles de la lecture et de l'apprentissage.\nDonc quand lire est un challenge, naviguer sur un médium basé principalement sur le texte peut être douloureux et fatiguant.\n\nHeureusement pour nos audiences, il existe un grand nombre de petites améliorations et idées que chaque designer, rédacteur et/ou développeur peut mettre en place dans les projets pour améliorer la vie de toutes et tous.\nAlors partons à la découverte des problématiques de lisibilité sur notre médium composé à plus de 95% de texte!",
        "categories": "b8f42b3e-d1d0-5212-bb39-9dfad1b01661",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["pDhSfa4fDfQxQdqx0iKxqAaKayB3"],
        "comments": "Comme pour ma précédente submission, il est possible pour moi de faire ce talk en anglais comme en français.\n\nL'idée est de parler accessibilité en montrant les bénéfices pour toutes et tous de ce sujet quand il est inclu dans les démarches de design."
    }, {
        "id": "wdLOkwKAOZPUhuCTfEk1",
        "title": "Ready for Angular version 8?",
        "level": "intermediate",
        "abstract": "2018 is an exciting year for the Angular platform. Join me in this session where we will cover this year's roadmap for the upcoming features. We will discuss about the new build system, the Material CDK, the new DOM Observables proposal, the new rendering engine and many other great features. Get ready!",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "speakers": ["ozjQPDh3uRRNeeYqDZ99WmWOceS2"],
        "comments": "Coucou, c'est encore moi. Pas trop fatigué(e) ? ^_^ \n\nJ'esperes que l'abstract en Angulais ne posera pas de souci. Le talk lui par contre sera en Français.\n\nBisous."
    }, {
        "id": "xcjnXkakovZki87SSCLj",
        "title": "Shaving my head made me a better programmer",
        "level": "beginner",
        "abstract": "How do perceptions and stereotypes affect those in software and on engineering teams? \n\nThis talk tells the true story of how I hacked my appearance, by shaving my head, to change the way I was perceived as a programmer.\n\nThis talk also serves as a primer on unconscious bias and stereotype threat, and their effects on individuals and teams. I will provide actionable advice on how to make engineering teams more inclusive, more diverse, and thusly more productive, successful, and attractive to potential hires.",
        "speakers": ["ZxTW9RCzizbsEPMWVUEEHx8ECPn2"]
    }, {
        "id": "xlO9L52cWOLq8mdyXqpI",
        "title": "Deliver search-friendly JavaScript-powered websites   --   Un site JavaScript search-friendly !",
        "level": "intermediate",
        "abstract": "Créer un site web qui soit à la fois engageant et moderne pour l'utilisateur ET qui dispose d'un bon positionnement naturel dans le moteur de recherche de Google nécessite de combiner des technologies client-side et server-side. Nous proposons de couvrir dans ce talk les best practices pour mettre en ligne des sites et applis-web utilisant des frameworks JavaScript tout en restant indexables par les moteurs de recherche. Les enseignements de cette sessions sont applicables pour la majorité des frameworks modernes, qu'il s'agisse de Angular, Polymer, React, ou autres. Ils s'appliquent aux sites qui utilisent ces frameworks pour une sous-section du site web aussi bien qu'aux sites full-Progressive Web App (PWA).\n\n\nMaking a site that is engaging for users but performs well in Google Search requires combining specific server and client side technologies. Learn about the best practices to build and deploy indexable sites and web-applications with JavaScript frameworks. Lessons from this session can be implemented with most modern setups, whether you use Angular, Polymer, React, or other frameworks to build a full-fledged PWA or just use them for parts of a site. The session will also discuss search-friendly design patterns and SEO best practices.\n\n",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["SoYVyrxI1fVvqYNBN826NUNBvBk2"],
        "comments": "Hi everyone,\n\nI'd been in talks with Jean-François Garreau a while back about coming over to the GDG Nantes, and I thought this year's DevFest would be the perfect opportunity for that: I'm thinking of organizing a \"Tour de France of SEO\" in the fall, with hopefully 10 events in 2 weeks, and the date of the Nantes DevFest would fit perfectly into that.\n\nI'm also quite curious to see the scale of the event in Nantes (looks massive!).\nHope to hear from the committee very soon,\nCheers,\n\nVincent\n"
    }, {
        "id": "xm0a1rqcHBrjrUq2kwML",
        "title": "AI Takeover",
        "level": "intermediate",
        "abstract": "Portés par des avancées récentes comme alpha go ou les voitures autonomes, de plus en plus de médias prônent l'arrivée imminente du remplacement des développeurs par \"l'Intelligence artificielle\". \nDans cette présentation, Tanguy et Nicolas tous deux chez #Valeuriad vont s'attaquer à cette question en implémentant un jeu (type pacman) from scratch en remplaçant le plus de composants possibles par des algorithmes de machine learning. \nL'objectif est double : vous présenter des algorithmes et technos récentes du monde de la data science (Genetic Algorithms, Deep Q Learning, Generative Adversarial Networks, etc...) tout en essayant de démêler le vrai du faux de ce pronostic de remplacement.",
        "categories": "c97cf20f-aba8-5bcd-9251-72f8c3c536c6",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["eBX1yLqFltf5oN6955kXst2nWvu2", "lscICB9JSkccxvod4QaEX9quauB3"],
        "comments": "Bonjour à vous,\n\nJ'espère que le sujet de ce talk vous intéressera,  je crois qu'il y a beaucoup d’appétence autour de l'intelligence artificielle et du machine learning,  mais ces sujets sont -je trouve- trop souvent abordés par le biais de plateformes SaaS blackbox  qui participent au flou qui les entoure. \n\nPour cette présentation on va essayer de remettre la technique au centre. Grosso modo après une vulgarisation des différents algos (garantie avec le moins de maths possible) on va montrer comment on a réussi à implémenter un jeu en remplaçant le plus de composants possibles par des \"AIs\". Il n'y aura pas de live coding mais a priori des notebooks (le code du jeu sera mis à disposition sur github) histoire de montrer que le développement d'AIs / algos de machine learning reste avant tout un problème d’ingénierie logicielle. \nOn en profitera pour expliciter les limites de ces algos et les biais/surprises/bugs qui peuvent en résulter pour montrer qu'on est encore bien loin du remplacement des développeurs par de l'AI. \n\nSi vous avez des questions/remarques, n'hésitez pas !"
    }, {
        "id": "xx8PtEHssJVvIdt5QUN1",
        "title": "Partir à la découverte du serverless avec OpenFaas",
        "level": "intermediate",
        "abstract": "OpenFaaS est un projet d'Alexis Ellis, Docker Captain, basé sur Docker et sur les orchestrateurs Swarm ou Kubernetes. Cette solution facilite la mise en œuvre d'une architecture Serverless à base de fonctions.\n\nA la différence de AWS Lambda ou d'autres services FaaS (Function as a Service) comme Google Cloud Functions, OpenFaas est une solution qui peut être déployée en On Premise, et ce très rapidement et simplement. L'autre différence est que tout peut devenir une fonction, y compris un binaire. On comprend mieux pourquoi depuis sa présentation à la DockerCon 2017, ce projet fait fureur dans la communauté Docker.",
        "categories": "4fee2bdd-0cf4-5429-945c-42a422577ff5",
        "formats": "fc2e9afb-3cba-5428-9214-c146862f2a52",
        "speakers": ["VF0bVRiF63dPEcscbKmnxXTqOm83"]
    }, {
        "id": "ztWPwraSmx1DbG5Anpaz",
        "title": "Fostering a Web Performance Culture",
        "level": "intermediate",
        "abstract": "As users of web applications we like fast, light and delightful web experiences. As web developers we struggle trying to reach awareness about the importance of web performance in our teams and companies.\n\nIn this talk I will give practical tips to foster a web performance culture and make it a priority when building our projects. Some initiatives that companies have taken on and tools that we can use to make performance part of our workflow.",
        "categories": "cf75cee3-5ee8-58de-ac77-6bb665a3463d",
        "formats": "e56e30ab-be22-5055-9138-a86a3249c766",
        "speakers": ["HhLonNfpANgPo08aRwD8cnnK8383"]
    }],
    "speakers": [{
        "uid": "85YULs8Zz2fCrYdFMO1cPz2RBif1",
        "displayName": "Gaëtan CIEPLICKI",
        "bio": "Multi­instrumentiste et compositeur de musiques instrumentales depuis plus de 15 ans, Gaëtan Cieplicki s’est investi dans divers projets, aussi bien musicaux que pédagogiques, dans le but de partager et d’échanger les pratiques de création musicale.\n\nCes 10 dernières années, il s’est principalement consacré à son projet solo Divag, réalisant des compositions de musique 8­bit, sur la console de jeux Nintendo Gameboy et sur Atari ST. \nOutre son activisme dans l’organisation de soirées “micromusic” en région Parisienne, il s’est donné en concert dans toute l’Europe, et a animé différents ateliers initiant le public à la création de musique 8­bit, et plus largement à la création musicale.\n\nConcepteur-­développeur informatique de métier, et friand de bricolages électroniques, il a créé de nombreux projets tels que :\n - le manège à rythme : installation mêlant technologie et mécanique, pour apprendre à créer de la musique en s’amusant\n - les robots danseurs : marionnettes géantes à faire danser, à l'aide de commandes rudimentaires et intuitives, adaptés aux petits et grands\n - projets divers autour de la musique, la programmation, l'électronique, la mécanique...\n\nProjets principaux / expériences pédagogiques :\nhttps://drive.google.com/file/d/0B-_0VGM-u3w6TlZtTFk4VEV3ZGV0UlNEc0tKYkEtVGFHTlNN/view?usp=sharing\n",
        "photoURL": "https://lh6.googleusercontent.com/-_ZSaNjlvMWc/AAAAAAAAAAI/AAAAAAAAAIs/f32q5JbqGcI/photo.jpg",
        "twitter": "@GatanDivag",
        "github": "divag",
        "email": "cieplicki@gmail.com",
        "phone": "0608560089"
    }, {
        "uid": "sNc6usDmBJMSPh0Z66CwVaE9xkv2",
        "displayName": "Rodolphe BUNG",
        "bio": "Développeur fullstack expérimenté, j'ai travaillé sur plusieurs sites internet « grand public » et suis sensible aux problématiques de performance relatives à ce type de site.\n\nAdepte des méthodes agiles et certifié ScrumMaster, j'aime le partage de connaissances et suis partisan de l'amélioration continue.\n\nInitialement très orienté Java/Spring, je me passionne actuellement sur l'écosystème JavaScript (en particulier NodeJS, React) qui offre de nombreuses possibilités (développement front et back, application mobile native ou desktop, etc.)",
        "company": "Egencia",
        "photoURL": "https://lh3.googleusercontent.com/-ZvfH3jechuk/AAAAAAAAAAI/AAAAAAAAAgs/_1wfzQmwb8o/photo.jpg",
        "twitter": "@rodbung",
        "github": "rbung",
        "email": "rkbung@gmail.com",
        "phone": "0663569675"
    }, {
        "uid": "fcH2tfSj1Adpr41mgn2sStSaC8f1",
        "displayName": "Matthieu GIOANI",
        "bio": "Matthieu Gioani, designer, coach & facilitateur, souhaite rendre le monde plus simple et réjouissant  par l’accompagnement des équipes projet et des managers sur les problématiques d’émergence, de design et d’innovation depuis bientôt 10 ans.",
        "company": "Fenikso",
        "photoURL": "https://lh4.googleusercontent.com/-BEWZ9kq0Ux4/AAAAAAAAAAI/AAAAAAAACOI/Gk4aeWDToX4/photo.jpg",
        "twitter": "@Matt_Gio",
        "email": "matthieu.gioani@fenikso.fr",
        "phone": "0645134927"
    }, {
        "uid": "TPRAC3yFCUfEH9or8gzs7IDoyqc2",
        "displayName": "Marc Lebrun",
        "photoURL": "https://lh4.googleusercontent.com/-OcXraRl6-kc/AAAAAAAAAAI/AAAAAAAAAAA/AB6qoq07q6EqCoRcx3hiyy9S522ZO3yKnw/mo/photo.jpg",
        "email": "marc.lebrun.mailbox@gmail.com"
    }, {
        "uid": "zZwPoNW47CT8ftvBt6xBPboACAj1",
        "displayName": "G LF",
        "bio": "Goulwen a récemment intégré la R&D Digitemis en tant que Responsable Produit.\n\nAuparavant développeur/consultant pendant 8ans puis expert avant-vente dans l'édition logicielle open source, il est désormais à la tête de la R&D Digitemis où pilote le développement des deux solutions SaaS de la société.\n\nPassionné de développement, de belles interfaces et d'outils faciles à prendre en main pour les utilisateurs, il profite de son immersion dans le monde de la cybersécurité pour intégré ces aspects bien particuliers dans ses solutions.\n\n\n\n",
        "company": "Digitemis",
        "photoURL": "https://lh5.googleusercontent.com/-wG_PU4GqWtE/AAAAAAAAAAI/AAAAAAAAAAA/AB6qoq1gGMUY76FrUsZwAKb8-zFjChjaog/mo/photo.jpg",
        "email": "glf.digit@gmail.com",
        "phone": "0640174112"
    }, {
        "uid": "CiJ9ahTlUSX1J6wj8C4PHpgEiHE2",
        "displayName": "Benjamin Petetot",
        "photoURL": "https://lh6.googleusercontent.com/-eLNPp-cIkYU/AAAAAAAAAAI/AAAAAAAAK0g/GSqGVZIugwk/photo.jpg",
        "email": "bpetetot@gmail.com"
    }, {
        "uid": "55naoSebhCMEl2HYrQPyD4ec8Xf2",
        "displayName": "Juarez Filho",
        "bio": "First Firebase GDE in South America. Front-end Engineer. Always traveling around.\nPassionate about traveling and also to share his adventures with Web Technologies and Firebase. As a Google Developer Expert, he’s helping communities all over the world to learn, discover and have fun.",
        "company": "ERS",
        "photoURL": "https://lh5.googleusercontent.com/-jv_FNldylnI/AAAAAAAAAAI/AAAAAAABXsI/RFGLlaeSQ14/photo.jpg",
        "twitter": "juarezpaf",
        "github": "juarezpaf",
        "email": "juarezpaf@gmail.com",
        "phone": "+353897081895"
    }, {
        "uid": "if5EFXF7TEgPy45VFB8ToIPmFJ63",
        "displayName": "Geoffrey Crofte 🐲",
        "bio": "UX/UI Developer travaillant à Luxembourg, j’ai travaillé pendant 8 ans sur des projets et à des postes très variés.\nMes différentes casquettes m’ont permis de découvrir mon métier de points de vue très différents.\n\nJe suis également développeur de plugins pour le CMS WordPress, Ninja (pour de vrai) et danseur de licorne (pour de vrai aussi) à mes heures perdues.\n\nJe partage également plein de choses sur mon blog, en compagnie d’autres auteurs invités.\n",
        "company": "Maltem",
        "photoURL": "https://pbs.twimg.com/profile_images/958490540651270146/9XzRYrg6_normal.jpg",
        "twitter": "@geoffrey_crofte",
        "github": "https://github.com/geoffreycrofte",
        "email": "geoffrey.crofte@hotmail.fr",
        "phone": "+33637267838"
    }, {
        "uid": "FyAyhxJKVSfr68mZTAKQZLV2nGQ2",
        "displayName": "Etienne Caron",
        "bio": "Etienne Caron is a developer lead at Shopify, a popular Canadian e-commerce company. He is also part of Google's Developer Expert program, and an instructor for Caster.io\n\nEtienne has been an active member of the Android developer community in Montreal since 2010, and regularly devotes his time to mentoring startups, developers and students in the mobile space.\n\n3D animation, procedural content generation and VR are some of his hobbies, and he loves introducing other developers to this fascinating field. ",
        "company": "Shopify",
        "photoURL": "https://lh4.googleusercontent.com/-5cTMOWbjZcI/AAAAAAAAAAI/AAAAAAAAYt8/AnGapn8N1Tc/photo.jpg",
        "twitter": "@kanawish",
        "github": "https://github.com/kanawish",
        "email": "etienne.caron@gmail.com",
        "phone": "1 514 662 7942"
    }, {
        "uid": "xRNeGxIeNcdAegOPlnYeBKFVX2o1",
        "displayName": "Jordane Grenat",
        "company": "Viseo",
        "photoURL": "https://pbs.twimg.com/profile_images/796371051433328640/iabFv3ff_normal.jpg",
        "twitter": "JoGrenat",
        "github": "jgrenat",
        "email": "jordan.grenat@gmail.com"
    }, {
        "uid": "bAkrQrssjgU1zb5V2y2QpVnuCmf1",
        "displayName": "jean-francois garreau",
        "photoURL": "https://lh6.googleusercontent.com/-jDbKZi8b1pE/AAAAAAAAAAI/AAAAAAAASRc/rrjQ9nn1LgQ/photo.jpg",
        "email": "jean.francois.garreau@gmail.com"
    }, {
        "uid": "uxepB1vrpvUnujmGe6AwG9jWXy52",
        "displayName": "Sébastien Ravoux",
        "bio": "Leader Expertises & Innovations @ Onepoint Atlantique \n\nJ'anime des équipes d'experts transverses pour développer l'innovation, l'industrialisation, la capitalisation sur des projets de toutes tailles.\nMon cœur technologique penche historiquement vers les solutions Microsoft (.Net, Azure, SharePoint, C#), mais aussi (ce n'est plus incompatible !) vers des solutions Open Source, l'IoT, les Réalités Virtuelles/Mixtes.\n",
        "company": "Onepoint",
        "photoURL": "https://lh3.googleusercontent.com/-alqQ2CiwECQ/AAAAAAAAAAI/AAAAAAAAAAA/ewnh0xdsr6U/photo.jpg",
        "twitter": "@stounba",
        "email": "ravoux@gmail.com",
        "phone": "0666707434"
    }, {
        "uid": "8UQcYy7KXNWw379dG3b04DtwwWu1",
        "displayName": "Miguel Mathé",
        "photoURL": "https://lh5.googleusercontent.com/-xRx7l3V2P60/AAAAAAAAAAI/AAAAAAAADKg/XStFs9Zo2OU/photo.jpg",
        "email": "miguel.mathe@gmail.com"
    }, {
        "uid": "ka9PvCQiKfRIrxlIQxqIz4LPf092",
        "displayName": "Adarsh Fernando",
        "bio": "Adarsh works at Google for Developer Relations. He's responsible for writing official documentation for the Android build system using Gradle, Android Studio, Android app Bundles, and Dynamic Delivery.",
        "company": "Mr",
        "photoURL": "https://lh6.googleusercontent.com/-c3Zs8Aigr5A/AAAAAAAAAAI/AAAAAAAAAI8/M2Y8UxZcp1w/photo.jpg",
        "email": "adarshf@google.com",
        "phone": "14255021948"
    }, {
        "uid": "E9KBYRpQ2udwy6wkEldMgQdZypw2",
        "displayName": "David Gageot",
        "bio": "David is a Developer Advocate at Google Cloud. He's working on Containers Tools. Previously, he helped open the R&D office of Docker in Paris",
        "company": "Google",
        "photoURL": "https://lh5.googleusercontent.com/-FttPax5gagU/AAAAAAAAAAI/AAAAAAAAABM/f-R1BtH3hlk/photo.jpg",
        "twitter": "dgageot",
        "github": "dgageot",
        "email": "dgageot@google.com",
        "phone": "+33626131337"
    }, {
        "uid": "DQHwfFU9oBZMzOpKLxOWdymoK053",
        "displayName": "Logan MAUZAIZE",
        "bio": "Amateur de Java avant le diplôme, j'ai distribué mes conseils lors de mes missions (expert technique, dev leader) et sur les forums. Notamment sur Developpez.com, sur lequel je fais partie de l'équipe Java à la fois en tant que modérateur mais aussi rédacteur.",
        "company": "MonkeyPatch",
        "photoURL": "https://lh3.googleusercontent.com/-M6QGwL0IXnY/AAAAAAAAAAI/AAAAAAAAH0Y/j2P_eT5QF7Q/photo.jpg",
        "twitter": "@LoganMzz",
        "github": "loganmzz",
        "email": "logan.mauzaize@gmail.com",
        "phone": "0665542809"
    }, {
        "uid": "gc7UU76X8rPr0TlUxisWFi8deWD2",
        "displayName": "Sébastien Charrier",
        "bio": "Alternant entre des jobs de développeur ou de product owner depuis des années, Sébastien est un amoureux des produits simples et efficaces.\n\nIl a travaillé deux ans en tant que développeur sur l’API de Trainline (ex Capitaine Train), avant de se lancer dans une nouvelle aventure avec bump.sh.",
        "company": "bump.sh",
        "photoURL": "https://avatars1.githubusercontent.com/u/30788?v=4",
        "twitter": "scharrier",
        "github": "scharrier",
        "email": "scharrier@gmail.com",
        "phone": "+33676042176"
    }, {
        "uid": "H9ABELSm38U2QOiMM5hA3XRlqh13",
        "displayName": "Sylvain Nieuwlandt (an0rak)",
        "bio": "Passionné d'informatique, de jeux vidéos et d'autres mondes depuis tout petit, je passe mon temps à bidouiller des petits univers en VR et à tester tous les nouveaux frameworks VR/AR disponibles, dans le seul but de pouvoir un jour voir passer le Tardis depuis la plateforme d'observation de mon StarDestroyer.",
        "company": "SFEIR",
        "photoURL": "https://avatars2.githubusercontent.com/u/11467261?v=4",
        "twitter": "an0rak_dev",
        "github": "an0rak-dev",
        "email": "s.nieuwlandt.dev@gmail.com"
    }, {
        "uid": "VeBTP8lqOYaXBCpwTlGjBW2n1yH2",
        "displayName": "Laurent Grangeau",
        "bio": "Laurent Grangeau is a Cloud Solution Architect with more than 10+ years of experience. Former Java developer, he has since developed in .NET, with Agile and DevOps mindsets. He has been experimenting with cloud providers for more than 5+ years. Docker enthusiast from the beginning, he has experienced with building microservices and distributed systems. He loves to automate things and run distributed applications at scale.",
        "company": "Sogeti",
        "photoURL": "https://avatars3.githubusercontent.com/u/4910715?v=4",
        "twitter": "@laurentgrangeau",
        "github": "laurentgrangeau",
        "email": "laurent.grangeau@gmail.com"
    }, {
        "uid": "JkWN4X6967cvBrV2x8vKf1QrHS93",
        "displayName": "Estelle Landry ☀️",
        "bio": "Passionée par mon métier de Product Owner, par l'UX (User eXpérience) et le GameStorming, j'aime participer à l'élaboration d'un produit en étant le lien entre les utilisateurs et les développeurs.\n\nSpeakeuse en conférence tech, membre des Duchess France, de SunnyTech et du MeetUp UX Flupa Montpellier, je continue à me perfectionner et à discuter de nouvelles méthodes ou technologies de l'IT.\n",
        "company": "Elium",
        "photoURL": "https://pbs.twimg.com/profile_images/890275035251978240/1POuDNwX_normal.jpg",
        "twitter": "@estelandry",
        "email": "estelle.landry@live.fr",
        "phone": "+33642028725"
    }, {
        "uid": "mgaHfTteB0VlvHg0kEK8J4XUm5G2",
        "displayName": "Stéphanie w",
        "bio": "UX et UI Designer, spécialisée en design d'interface et optimisation mobile, actuellement située à Luxembourg. Je place l'utilisateur au coeur de mon processus pour créer des produits faciles et agréables à utiliser. Mes compétences en HTML CSS me permettent de faire le lien entre design et développement. Passionnée par mon travail, je partage mon savoir sur mon blog, en conférence dans le monde entier et dans mes cours. ",
        "company": "arhs group",
        "photoURL": "https://lh5.googleusercontent.com/-JNaq_Vb_eZ8/AAAAAAAAAAI/AAAAAAAA174/12IWIS1DUu8/photo.jpg",
        "twitter": "@walterstephanie",
        "email": "walterstephanie68@gmail.com",
        "phone": "+336831535 12"
    }, {
        "uid": "nBxUaLBVQxU9dbiIfiUpR9T5Tsx2",
        "displayName": "Pierre Zemb",
        "bio": "Pierre Zemb is a software engineer at OVH. He’s working with the Metrics Data Platform team to build reliable distributed systems and analytics solution. He's also giving a hand to differents local events, such as the local Startup Weekend, Devoxx4Kids and FinistDevs.",
        "company": "OVH",
        "photoURL": "https://avatars2.githubusercontent.com/u/2698318?v=4",
        "twitter": "@PierreZ",
        "github": "PierreZ",
        "email": "contact@pierrezemb.fr",
        "phone": "0033786956165"
    }, {
        "uid": "uGGZuv5ZwmbTOZhWhBujIEIhQ7W2",
        "displayName": "A. Hébert",
        "bio": "Aurélien Hébert started as a software engineer in the Alten R&D team on a Big data project. This project was about discovering pattern in mobility data. After this first experience he wanted to work on a technical project including more sensors data. He joined a Startup (Cityzen Data) building an open source Geo-Time-Series database (Warp 10) and its associated language to manipulate it. Here he got data, a lot of them. He joinded recently the OVH metrics team. He also like to share his experience in local conference such as FinistDev or meetups.",
        "company": "OVH",
        "photoURL": "https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg",
        "twitter": "@AurrelH95",
        "github": "aurrelhebert",
        "email": "aurrelhebert@gmail.com",
        "phone": "0666769732"
    }, {
        "uid": "pYuiGicpt0MenD8NEMhZXtk6VSr1",
        "displayName": "Horacio Gonzalez (LostInBrittany)",
        "bio": "Malgré ce que son accent espagnol bien prononcé peut suggérer, Horacio est arrivé en France il y a plus d'une quinzaine d'années. Passionné d'informatique, dans laquelle il est tombé depuis tout petit, il a découvert le développement web en 1997 et depuis il n'a pas arrêté de bosser autour.\n\nAprès quelques années comme tech leader de la partie frontend de [@warp10io](https://twitter.com/warp10io/) chez [Cityzen Data](https://twitter.com/cityendata/), Horacio a rejoint [OVH](](https://twitter.com/ovh/) en janvier 2018 en tant que Developer Advocate. Il est cofondateur du [FinistDevs](https://twitter.com/finistdevs/), le JUG/GDG français le plus proche de la Silicon Valley.\n\nPassionné par le développement web et tout ce qui gravite autour des composants web, Horacio est [Google Developer Expert (GDE)](https://developers.google.com/experts/people/horacio-gonzalez) en Web Technologies et Flutter.\n\nVous pouvez voir mes dernières talks sur [mon profil Notist](https://noti.st/lostinbrittany)",
        "company": "OVH",
        "photoURL": "https://lh4.googleusercontent.com/-6krIgoWnkGk/AAAAAAAAAAI/AAAAAAABR4o/EJH0Fh-m16k/photo.jpg",
        "twitter": "@LostInBrittany",
        "github": "https://github.com/LostInBrittany",
        "email": "horacio.gonzalez@gmail.com",
        "phone": "+33 610 50 18 34"
    }, {
        "uid": "QNcsmbf38GaAYxMzfIiyT9bOZDE3",
        "displayName": "Gautier de Saint Martin Lacaze",
        "bio": "Développeur freelance passionné, Gautier travaille principalement sur les technologies Java et JavaScript. Afin de rester au fait des nouveautés, il participe régulièrement à des conférences nantaises ou nationales. Il coorganise également le Nantes JUG depuis juin 2014.\n\nAyant appris à dompter l'IDE Eclipse lors de ses premières années de travail, il contribue aujourd'hui à l'amélioration de son outil de travail via des patchs et la formation de ses clients.",
        "company": "Freelance",
        "photoURL": "https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg",
        "twitter": "@darkjabberwock",
        "github": "jabby",
        "email": "gautier.desaintmartinlacaze@gmail.com"
    }, {
        "uid": "GaTXktSpMGXO1RIGafgjJ9m87oB3",
        "displayName": "Adrien PESSU",
        "bio": "Adrien est passionné de développement, en particulier Java et Web. Il a évolué pendant plusieurs années en société de services chez un éditeur logiciel, il s’est lancé dans l’aventure freelance. Vous pourrez aussi le croiser dans certains meetups tech",
        "company": "Adrien Pessu Consulting",
        "photoURL": "https://lh4.googleusercontent.com/-1wzRZnWEiLs/AAAAAAAAAAI/AAAAAAAAAgY/MXjzTjS-Qu4/photo.jpg",
        "twitter": "@adrien_pe",
        "github": "adrienpessu",
        "email": "apessu@gmail.com",
        "phone": "0645870828"
    }, {
        "uid": "GmJvMDty6FcEme9n8SOEhA8bylm2",
        "displayName": "Lucas Fernandes da Costa",
        "bio": "I am a Brazilian software engineer living in London. I breathe JavaScript and I am passionate about open source. I'm also a core team member of [Chai.js](https://github.com/chaijs/chai) and [Sinon.js](https://github.com/sinonjs/sinon), two of the most popular libraries in the JS ecosystem, and I'm always trying to find better and more efficient ways to solve problems. \n\nAs I can't stay away from writing the best code I'm able to, you can find me almost every day on [GitHub](https://github.com/lucasfcosta), contributing to open-source projects and also helping to translate and produce content for other developers.\n\nI also write some blog posts about software engineering in general, JavaScript and open-source at [lucasfcosta.com](http://lucasfcosta.com).\n\nSince I love exchanging experiences and knowledge with other engineers I've spoken at some major conferences around the world such as FluentConf in San Jose - CA, The Conf São Paulo, NebraskaJS, FrontEnd United Utrecht and many more.\n\nWhenever I'm not busy with work, talks or open-source you will probably find me reading a book in a random park in East London.\n\n“Strive to be lazy” this is my motto.",
        "company": "Converge.io",
        "photoURL": "https://avatars1.githubusercontent.com/u/6868147?v=4",
        "twitter": "lfernandescosta",
        "github": "lucasfcosta",
        "email": "lucas@lucasfcosta.com",
        "phone": "+4407928505626"
    }, {
        "uid": "HRuxHSCcItYjNHFdRGCXK31LwHI2",
        "displayName": "anta aidara",
        "photoURL": "https://lh6.googleusercontent.com/-D2MnSz_x0Zw/AAAAAAAAAAI/AAAAAAAAF8Q/MYeapDkeeK0/photo.jpg",
        "twitter": "@AidaraAnta",
        "github": "https://github.com/antamb",
        "email": "anta.aidara@gmail.com"
    }, {
        "uid": "T0c4tdkG6PTJTDajvQVpJRzFsU63",
        "displayName": "Guillaume Laforge",
        "bio": "During the day, **Guillaume Laforge** is **Developer Advocate** for **Google Cloud Platform**, covering a wide range of topics from serverless approaches, to chatbots or machine learning. At night, Guillaume wears his **Apache Groovy** hat, or you can hear him make jokes on the French podcast **Les Cast Codeurs** !",
        "company": "Google",
        "photoURL": "https://pbs.twimg.com/profile_images/515401943384989697/ajOdQVI9_normal.jpeg",
        "twitter": "@glaforge",
        "github": "glaforge",
        "email": "glaforge@gmail.com",
        "phone": "0633428009"
    }, {
        "uid": "PRuMzxC7NVbsVnJP07AbHR2cNFx2",
        "displayName": "Benjamin Cavy",
        "photoURL": "https://lh3.googleusercontent.com/-qridgWF20Vk/AAAAAAAAAAI/AAAAAAAAAtQ/K8bT4K-PTmU/photo.jpg",
        "email": "benjamin.cavy@gmail.com"
    }, {
        "uid": "aJ1AY0He6aQsACtISRIGq5mIcsA3",
        "displayName": "Fanny Demey Pluvinage",
        "bio": "Je suis développeuse mobile chez 7digital depuis 1 an où je crée des applications de streaming de musique pour des clients comme Deedo, Warner, Universal. Avant ça j'ai fait un peu de tout : chef de projet, coach agile, developpeuse backend.\nJe suis également présidente du GDG Lille et j'organise activement le Devfest Lille.",
        "company": "7Digital",
        "photoURL": "https://lh6.googleusercontent.com/-wScR9-Ut2gk/AAAAAAAAAAI/AAAAAAAAejo/tmttmUVooIQ/photo.jpg",
        "twitter": "@FannyDemey",
        "github": "FannyDemey",
        "email": "fanny.pluvinage@gmail.com",
        "phone": "+33668845209"
    }, {
        "uid": "TlarIquBIndJVIf5bcVSfo2f9Ze2",
        "displayName": "Alexandre Lafosse",
        "photoURL": "https://lh5.googleusercontent.com/-REDfteo9e6w/AAAAAAAAAAI/AAAAAAAAAAA/AB6qoq3g5mlVcwczXV4KvidpaQHKTzzFdA/mo/photo.jpg",
        "email": "alexandre.lafosse@speach.me"
    }, {
        "uid": "TPWhOWHNJAchLUJWXi1RORH4xF32",
        "displayName": "Joe Birch",
        "bio": "Hi, my names Joe. I’m an Android Engineer and Google Developer Expert for Android & Flutter based in Brighton, UK working on the Android team at Buffer. I’m passionate about coding and love creating robust, polished and exciting projects for mobile, the web, TV, wearables and I’ll probably be toying with whatever the new thing is at the time you’re reading this – I love to be constantly learning. I’m also a keen writer as I love to share my learnings and experiences with others.",
        "company": "Buffer",
        "photoURL": "https://pbs.twimg.com/profile_images/994775275153092608/-rGSy4tT_normal.jpg",
        "twitter": "@hitherejoe",
        "email": "joebirch@hotmail.com",
        "phone": "07715292934"
    }, {
        "uid": "1azTdqRhX2ceYqyoELvdgtjWChl2",
        "displayName": "AliSoftware",
        "bio": "Olivier is an iOS Architect & Evangelist who loves sharing his passion for iOS and Swift.\n\nHe is the author of multiple iOS libraries like OHHTTPStubs and Reusable and creator of the SwiftGen tool.\nHe is also a Core Contributor alumni at [CocoaPods](https://cocoapods.org) and a current Core Contributor on [fastlane](https://github.com/fastlane/fastlane).\n\nWhen he has some time left, he likes to share technical ideas on [his blog](http://alisoftware.github.io).",
        "company": "Niji",
        "photoURL": "https://avatars2.githubusercontent.com/u/216089?v=4",
        "twitter": "@aligatr",
        "github": "AliSoftware",
        "email": "olivier@halligon.net",
        "phone": "+336.65.20.92.67"
    }, {
        "uid": "TFTWgPHaF4U3BGSHGFEfjXCUZ5i2",
        "displayName": "moud",
        "company": "Vente-Privée",
        "photoURL": "https://pbs.twimg.com/profile_images/772447433305497600/3lPGnjgA_normal.jpg",
        "twitter": "@bym0ud",
        "email": "mahmoud@tutamail.com"
    }, {
        "uid": "DNlgKL7C5DNK0y48Lf7ylPB4bmk2",
        "displayName": "Olivier Leplus",
        "bio": "I am a Developer Advocate at Botfuel and a Google Developer Expert in Web Technologies. I love to share knowledge (and love) among developers and people in general.\n",
        "company": "Olivier Leplus",
        "photoURL": "https://lh4.googleusercontent.com/-lZ1NmzauJJc/AAAAAAAAAAI/AAAAAAAAgeg/Jaiqf1L_EPM/photo.jpg",
        "twitter": "@olivierleplus",
        "github": "tagazok",
        "email": "leplus.olivier@gmail.com",
        "phone": "+33682448412"
    }, {
        "uid": "CN3O5R3XQ7SUdiSFVUO1zmtRkPk1",
        "displayName": "Benoit Jacquemont",
        "bio": "Benoit Jacquemont est tombé dans le web en 2000 après avoir une première expérience sur des logiciels d'encaissements. De Java à PHP, de Oracle à MySQL et des applications de gestions aux sites de eCommerce, il roule sa bosse sur les projets, toujours à forte composante OpenSource, au sein du groupe Smile. Il en devient le CTO en 2009 alors que l'entreprise compte près de 450 salariés. En janvier 2013, il co-fonde Akeneo avec Frédéric de Gombert, Nicolas Dupont et Yoav Kutner. L'aventure startup commence alors pour lui, en tant que CTO d'Akeneo. ",
        "company": "Akeneo",
        "photoURL": "https://avatars3.githubusercontent.com/u/2151567?v=4",
        "twitter": "@bjacquemont",
        "github": "Bitone",
        "email": "benoit@akeneo.com",
        "phone": "0649621214"
    }, {
        "uid": "u6xKtXK4v9U3m4Qei9Oloyn0hm62",
        "displayName": "Matthieu Lux",
        "bio": "- Directeur d'AYA la digital agency de Zenika\n- Développeur & Formateur Web / JavaScript (React, Vue, Redux, Node, Angular)\n\n- Organisateur du LyonJS\n- Open Source : générateur Yeoman FountainJS, generator-gulp-angular & Citation\n",
        "company": "Zenika",
        "photoURL": "https://pbs.twimg.com/profile_images/565813885815369729/WwYOmeaE_normal.jpeg",
        "twitter": "@Swiip",
        "github": "Swiip",
        "email": null,
        "phone": "06 25 29 16 09"
    }, {
        "uid": "9LHSTmgvjXcyMPyfifAgXjtP6Z02",
        "displayName": "Pierre Tibulle",
        "bio": "Job Crafter en ESN, je m'épanouis dans le domaine mobile et je participe également à l'organisation du meetup Android Nantes !",
        "company": "ASI",
        "photoURL": "https://lh6.googleusercontent.com/-EPCphRSOO1Y/AAAAAAAAAAI/AAAAAAAAARo/JCN5RTGQPos/photo.jpg",
        "twitter": "@ptibulle",
        "email": "ptibulle@gmail.com",
        "phone": "06 71 21 97 43"
    }, {
        "uid": "mGoCYS40PXcDZbELsSJjt0m7uCp1",
        "displayName": "David BOUCHÉ",
        "bio": "Coté pro, \n\nOn dit souvent qu'une image vaut milles mots, un lien LinkedIn permet également de gagner du temps : https://www.linkedin.com/in/davidbouche/\n\nJ'ai créé une petite entreprise nantaise il y a 4 an. Historiquement appelée Clicproxy, cette aventure se nomme aujourd'hui Oniti. \nNotre équipe est composée de 4 développeurs, d'un community manager & d'une comptable.\nL'activité se répartie sur le l'édition logicielle -principalement- et de la création de site internet avec leur animation.\n\nCoté perso, \n\nJeune papa depuis quelques mois, parachutiste à mes heures disponibles (il n'en reste plus beaucoup) et danseur de salsa aussi souvent que faire se peut.\n\nPour le reste ... Le mieux c'est de se croiser autour d'un verre ou d'une bonne assiette. \n",
        "company": "Oniti",
        "photoURL": "https://lh6.googleusercontent.com/-smImVw-2TJQ/AAAAAAAAAAI/AAAAAAAACT8/OAeJnf9w5aw/photo.jpg",
        "twitter": "@davidwillou",
        "github": "davidbouche",
        "email": "david@clicproxy.com",
        "phone": "0285523342"
    }, {
        "uid": "WP4HfOBAdCP90Wu77H251D5VUd73",
        "displayName": "Filip Bruun Bech-Larsen",
        "bio": "Filip is a frontend developer from Denmark, focusing on delivering great user-experiences to the end-user. He is a Google Developer Expert and a Manager at IMPACT, delivering large-scale commerce-products to well-known business and consumer brands.\nFilip is passionate about the web, and cares not only about clean and efficient code, but also about accessibility and performance, in order for the web to be available and accessible for everybody - without sacrificing great design/UX.\nIn his city of Aarhus, he initiated an angular usergroup that is now the biggest in the country. Filip is an active community member, and an experienced public speaker.",
        "company": "IMPACT",
        "photoURL": "https://lh6.googleusercontent.com/-uxQQ9UPHYgo/AAAAAAAAAAI/AAAAAAAAAXU/GDUSW3IeGnc/photo.jpg",
        "twitter": "filipbech",
        "github": "filipbech",
        "email": "filipbech@filipbech.dk"
    }, {
        "uid": "H3QHP1wvJDUG0sW402gh9ktbNx03",
        "displayName": "Emmanuel Demey",
        "bio": "Directeur technique chez Zenika Lille et Google Developer Expert, je suis spécialisé dans AngularJS / Angular / TypeScript et l'Accessibilité Web. Speaker à ses heures perdues. Aime également les bières (et oui quand on vient de Lille c'est normal...), le Jazz et la Domotique. Plusieurs expériences en tant que conférencier, notamment depuis septembre 2015 autour du sujet Angular2. - ESLint au Jug Summer Camp et ChtiJS - Angular 2 : ChtiJUG, LyonJS, GDG Paris, GDG Nantes, Meetup AngularJS Grenoble, Devoxx, RivieraDev, Bdx.io, DevFest Nantes, Codeurs en Seine",
        "company": "Zenika",
        "photoURL": "https://lh5.googleusercontent.com/-Ah5tywPfFgc/AAAAAAAAAAI/AAAAAAAADOg/s43SdoYxQwQ/photo.jpg",
        "twitter": "EmmanuelDemey",
        "github": "Gillespie59",
        "email": "emmanuel.demey@zenika.com",
        "phone": "0647474202"
    }, {
        "uid": "eMFPF8fp2UTnePLtRCc0XgQddy12",
        "displayName": "David Pilato",
        "bio": "Depuis 2013, David Pilato est développeur et évangéliste chez elastic.co, après avoir passé les deux années précédentes à promouvoir le projet open-source Elasticsearch. Il en anime la communauté française et organise des [BBLs](http://brownbaglunch.fr) au sein des entreprises.",
        "company": "elastic",
        "photoURL": "https://avatars3.githubusercontent.com/u/274222?v=4",
        "twitter": "@dadoonet",
        "github": "dadoonet",
        "email": "david@pilato.fr",
        "phone": "+33613030841"
    }, {
        "uid": "FFR0y1rZA9TrfRqiJ3CRSX5tMAB3",
        "displayName": "Sean McQuillan",
        "bio": "Sean McQuillan is a Developer Advocate at Google. With a decade of experience at Twilio and other San Francisco startups he is an expert at building apps that scale. Sean is passionate about using great tooling to build high quality apps - quickly. When he is not working on Android you can find him fiddling on the piano or crocheting hats.\n",
        "company": "Google",
        "photoURL": "https://lh6.googleusercontent.com/-qlYNKuj5UPw/AAAAAAAAAAI/AAAAAAAAAPQ/ckAvMoh3dbI/photo.jpg",
        "twitter": "@objcode",
        "github": "objcode",
        "email": "seanmcq@google.com",
        "phone": "+1-415-990-0854"
    }, {
        "uid": "mFpJDbJtdIULJQtKkiNFaOHsQbK2",
        "displayName": "Rudy Weber",
        "company": "SFEIR",
        "photoURL": "https://lh6.googleusercontent.com/-13orUfXLVHI/AAAAAAAAAAI/AAAAAAAABM8/j_4yjNw6Ap4/photo.jpg",
        "twitter": "rudy_weber",
        "github": "RudyWeber",
        "email": "webrudy@gmail.com",
        "phone": "0623798724"
    }, {
        "uid": "u3ZxAhtpI8X21IW8GInJ4PxQx1J2",
        "displayName": "Wolfgang Goedel",
        "bio": "Artisan développeur, spécialiste front, passionné de langages, amateur de programmation fonctionnelle.\nDeveloper Advocate @sfeir\n",
        "company": "SFEIR",
        "photoURL": "https://avatars3.githubusercontent.com/u/3933928?v=4",
        "twitter": "@wgoedel",
        "github": "wolfgangGoedel",
        "email": "wgoedel@gmail.com",
        "phone": "0786201692"
    }, {
        "uid": "hDzLDt6oyyME7lk1JVYIjPbW3XG2",
        "displayName": "Matthieu Bréchet",
        "bio": "TDB",
        "company": "SII",
        "photoURL": "https://avatars3.githubusercontent.com/u/1721270?v=4",
        "twitter": "@mbrechet",
        "github": "mbrechet",
        "email": "m.brechet@gmail.com"
    }, {
        "uid": "jMUwWI44kuTXsgUt8vLFp3vAe1j1",
        "displayName": "Vincent Ogloblinsky",
        "bio": "Architecte logiciel dans une ESN française, je suis passionné par les technologies du web, et la plupart du temps je les utilise en codant en (Type||Java)script.\nLe partage de la connaissance est pour moi une chose importante : au sein de ma société au travers de déjeuners techniques ou de sessions de mobprogramming; durant des formations HTML5, Angular 1 & 2 ou autres; en présentant des sujets lors de conférences; et enfin en contribuant et en maintenant des projets open-source.\n\"Let's browsers rock\"",
        "company": "SII Ouest",
        "photoURL": "https://lh3.googleusercontent.com/-ckhK85zrlYM/AAAAAAAAAAI/AAAAAAAAC4g/G5DIeeyNEAM/photo.jpg",
        "twitter": "vogloblinsky",
        "github": "vogloblinsky",
        "email": "vincent.ogloblinsky@gmail.com",
        "phone": "0682636701"
    }, {
        "uid": "uXKiRbH7FVfJdTRPkoHFKTpoKvv2",
        "displayName": "Marco Otte-Witte",
        "bio": "Marco is the founder of simplabs, an engieering consultancy based in Munich, Germany specializing in Web Engineering. He has been working in IT since the late 90s and used many different languages and frameworks in project of all kinds of scale for enterprise clients and startups. Marco is passionate about conventions-based tools that liberate through imposing constraints.",
        "company": "simplabs GmbH",
        "photoURL": "https://avatars1.githubusercontent.com/u/1510?v=4",
        "twitter": "marcoow",
        "github": "marcoow",
        "email": "marco.otte-witte@simplabs.com"
    }, {
        "uid": "3NlJfJABBASjyIZg5v4L665AdXR2",
        "displayName": "Doug Sillars",
        "bio": "Doug is is a freelance mobile performance expert, having helped thousands of developers speed up their mobile apps and websites.  A Google Developer Expert and the author of O’Reilly’s “High Performance Android Apps,” Doug has spoken at developer conferences in the US and Europe, and blogs regularly at dougsillars.com. He is currently working as a freelance digital nomad, traveling with his family in Europe.",
        "company": "Freelance",
        "photoURL": "https://lh3.googleusercontent.com/-MomudqbPDfk/AAAAAAAAAAI/AAAAAAAAVN4/GbO32IzMdF4/photo.jpg",
        "twitter": "@dougsillars",
        "github": "dougsillars",
        "email": "doug.sillars@gmail.com",
        "phone": "1-608-616-9572"
    }, {
        "uid": "ZdNase96oBSI6QdrWySX9eCtJgs1",
        "displayName": "Julien Topçu",
        "bio": "Senior Lead Developer chez Egencia, je suis un fervent défenseur du Software Craftsmanship. \n\nJ'évangélise activement autour de DDD/Hexagonal Architecture, l'XP et le Kanban #NoEstimates au sein de cours et de [meetups](https://www.meetup.com/fr-FR/Expedia-Inc-Paris/) que que je fais pour le compte d'Expedia, ainsi qu'à travers d'articles de blog.\n\nMembre de la fondation OWASP, je m'efforce de transmettre à la communauté une philosophie DevSecOps que je pense être l'avenir du métier de développeur. J'ai participé à la mise en place de pipeline de Continuous Security à l'échelles d'entreprises.",
        "company": "Egencia & OWASP fundation",
        "photoURL": "https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg",
        "twitter": "@JulienTopcu",
        "email": "julien.topcu@gmail.com"
    }, {
        "uid": "WcLIdgBZKjafCClB2t7uSDh3udj1",
        "displayName": "Marie Guillaumet",
        "bio": "Web designer et intégratrice web senior, Marie Guillaumet est consultante en accessibilité numérique chez [Access42](https://access42.net/). Elle vit et travaille à Rennes, et collabore avec ses collègues en full remote. Elle a écrit de nombreux articles sur le web design et l’intégration, et partage régulièrement ses découvertes sur [Twitter](https://twitter.com/kReEsTaL) ou lors de conférences. Diplômée de Sciences Po Grenoble et du CELSA, Marie s’intéresse tout particulièrement à la dimension anthropologique et symbolique du web. Sa spécialisation en accessibilité numérique lui permet de concilier design, technique et implication sociale.",
        "company": "Access42",
        "photoURL": "https://lh3.googleusercontent.com/-QOui2dBSFZc/AAAAAAAAAAI/AAAAAAAAAAc/ZGf2GDfZrbc/photo.jpg",
        "twitter": "@kReEsTaL",
        "github": "kreestal",
        "email": "mguillaumet.access42@gmail.com",
        "phone": "0678617947"
    }, {
        "uid": "L3kZjY5dZ2UfPAj5GwBWDFQ8YV92",
        "displayName": "Samuel BERTHE ツ",
        "company": "Grep.to",
        "photoURL": "https://avatars1.githubusercontent.com/u/2951285?v=4",
        "twitter": "@samuelberthe",
        "github": "samber",
        "email": "contact@samuel-berthe.fr",
        "phone": "0633863663"
    }, {
        "uid": "jOwPOYosNlUjLVFK7M8COZwgPsp2",
        "displayName": "Marc Poppleton",
        "bio": "I'm a Software Engineer at Orange Labs and tinker with code for Android since version 1.0 Apple Pie. I'm also the leader of the GDG Code d'Armor. The rest of the time, I'm Robopop, cyber-father and husband, half flesh and bones, half carbonfiber and steel.",
        "company": "Orange Labs",
        "photoURL": "https://lh3.googleusercontent.com/-ZVxno3j8ero/AAAAAAAAAAI/AAAAAAAAbAU/kBzByPyhrNw/photo.jpg",
        "twitter": "@marcpoppleton",
        "github": "marcpoppleton",
        "email": "marc.poppleton@gmail.com",
        "phone": "0678597741"
    }, {
        "uid": "4QuljP1RZPU3ZyR3gjhoGyxAxoS2",
        "displayName": "Manon Gruaz",
        "photoURL": "https://lh6.googleusercontent.com/-t6rofqeqoV4/AAAAAAAAAAI/AAAAAAAAHps/7okZxLJblBc/photo.jpg",
        "email": "discografik@gmail.com"
    }, {
        "uid": "977YQDolbxde0ito7I2dUiee2ap1",
        "displayName": "Nicolas Lepage",
        "bio": "Développeur depuis plus de 10 ans, Nicolas est actuellement consultant et formateur chez Zenika Nantes.\n\nAprès de trop longues années de développement Java, il prend le contrepied et s'intéresse maintenant à tout ! Sa quête de nouveauté l'amène à explorer les mondes du front avec ReactJS, du NoSQL avec MongoDB, et des langages modernes tels que Go(lang) ou encore Kotlin.\n\nSon goût du partage le pousse à devenir formateur, notamment sur Go(lang), et à se lancer dans l'open source en créant [immutad●t](https://github.com/Zenika/immutadot), une bibliothèque JavaScript pour manipuler les structures immuables imbriquées.",
        "company": "Zenika",
        "photoURL": "https://lh6.googleusercontent.com/-96ltg2kr4oc/AAAAAAAAAAI/AAAAAAAAAG4/bk0-E9b9kuU/photo.jpg",
        "twitter": "@njblepage",
        "github": "nlepage",
        "email": "nicolas.lepage@zenika.com",
        "phone": "0623941955"
    }, {
        "uid": "YDApK7gdSfN86lA8nblfEtMHR7e2",
        "displayName": "Florina Muntenescu",
        "company": "Google",
        "photoURL": "https://lh5.googleusercontent.com/-Wf0yCP8sZh4/AAAAAAAAAAI/AAAAAAAAPbs/TxGh5rbKawY/photo.jpg",
        "twitter": "@FMuntenescu",
        "email": "florina.muntenescu@gmail.com"
    }, {
        "uid": "3gLXb3d2GuNS10ArYwo4bda3p7F3",
        "displayName": "Laurent Baresse",
        "bio": "Geek, Senior Java/Kotlin architect, Android developer, Modern Web App enthusiast, work @ekito\n\n[Koin framework](https://insert-koin.io/) core team member.",
        "company": "ekito",
        "photoURL": "https://lh5.googleusercontent.com/-QaMvBs8U3W4/AAAAAAAAAAI/AAAAAAAAAAo/XlIPb7_VbpU/photo.jpg",
        "twitter": "@Baresse",
        "github": "Baresse",
        "email": "lbaresse@ekito.fr"
    }, {
        "uid": "SOxFDVFePQVBor9U92lSoAohcJB2",
        "displayName": "Arnaud Giuliani",
        "bio": "Mobile & backend developer for more than 11 years. I work at ekito (French tech studio) since 2012, and I have one hand in Android development and the other in Kotlin/Java backend stuff. My current hot topics are Kotlin and the reactive programming.\n\nI'm a speaker since 2016. I talk mostly about Kotlin: https://medium.com/@giuliani.arnaud/presentations-6b91f53899ac\n\nI've launched the Koin project, a lightweight dependency injection framework for Kotlin - https://insert-koin.io\n\nI regularly write articles on medium https://medium.com/@giuliani.arnaud/ or on ekito's blog https://www.ekito.fr/people/arnaud-giuliani/",
        "company": "ekito",
        "photoURL": "https://lh5.googleusercontent.com/-eQ0KKUvy0no/AAAAAAAAAAI/AAAAAAAAAfo/EJcJA5QpIIw/photo.jpg",
        "twitter": "@arnogiu",
        "github": "https://github.com/arnaudgiuliani",
        "email": "agiuliani@ekito.fr",
        "phone": "+33678817212"
    }, {
        "uid": "YrPGDzcnbLRyw7lwWsW2tVxWCvI2",
        "displayName": "Daniel Bornkessel",
        "bio": "Daniel Bornkessel is a Senior Consultant at innoQ Deutschland GmbH with a focus on DevOps and Continuous Delivery topics. Before INNOQ he gained experience with scaling infrastructure fast at SoundCloud. He has a strong Linux background from working more than 4 years at SUSE Linux GmbH. Besides infrastructure and Linux topics he feels at home when doing some Golang or Ruby on Rails.",
        "company": "innoQ Deutschland GmbH",
        "photoURL": "https://avatars0.githubusercontent.com/u/12173?v=4",
        "twitter": "@kesselborn",
        "github": "kesselborn",
        "email": "github@bornkessel.com",
        "phone": "+49 179 1091502"
    }, {
        "uid": "hKc1vk2qrncKXF6VIYdzAXi0fGF2",
        "displayName": "Bastien Cadiot",
        "bio": "Bastien est Cloud Builder chez WeScale, et Google Developer Expert (GDE) Cloud pour Google",
        "company": "WeScale",
        "photoURL": "https://lh4.googleusercontent.com/-05Eibg0J0VA/AAAAAAAAAAI/AAAAAAAAAKU/N45Mc5Hhdhw/photo.jpg",
        "twitter": "@bcadiot",
        "github": "bcadiot",
        "email": "bastien.cadiot@gmail.com",
        "phone": "0033608691651"
    }, {
        "uid": "KzcYefI9b9TVAxioQv9FL6Fyxmp1",
        "displayName": "Jocelyn DREAN",
        "bio": "Data Engineer at iAdvize.",
        "company": "iAdvize",
        "photoURL": "https://lh4.googleusercontent.com/--IyokrAcfTA/AAAAAAAAAAI/AAAAAAAAAAs/ZoZLs4Nbpxc/photo.jpg",
        "twitter": "@jocelyndrean",
        "github": "jocelyndrean",
        "email": "jocelyn.drean@iadvize.com",
        "phone": "0646820808"
    }, {
        "uid": "SxMr445PTeY5HfqlJT53OhEaZrp1",
        "displayName": "Fatih Acet",
        "bio": "Sr. Frontend Engineer at GitLab and GDE on Web Technologies.",
        "company": "GitLab",
        "photoURL": "https://lh5.googleusercontent.com/-8HgVLnY-FNU/AAAAAAAAAAI/AAAAAAAAA_E/Q9lgbyflYWA/photo.jpg",
        "twitter": "@fatihacet",
        "github": "fatihacet",
        "email": "acetfatih@gmail.com",
        "phone": "+310643885581"
    }, {
        "uid": "Ofaq0zwxHDeCz5jSfL20x5zKY2O2",
        "displayName": "Maxime Ghignet",
        "bio": "Développeur passionné, j'ai démarré tout jeune en intégrant des templates graphiques réalisés sur Photoshop, ce qui m'a progressivement amené au développement web. Constamment à la recherche de moyens de gagner du temps et d'améliorer la qualité de mon code, j'aime partager mes trouvailles.",
        "company": "Freelance",
        "photoURL": "https://lh4.googleusercontent.com/-Ii2eaXwSDSo/AAAAAAAAAAI/AAAAAAAAAkg/Tim7dFt1L8A/photo.jpg",
        "twitter": "@mghignet",
        "github": "mghignet",
        "email": "maxime.ghignet@gmail.com",
        "phone": "+33613961029"
    }, {
        "uid": "UtPdTAr3rUM9soHbtMG887fi4hH2",
        "displayName": "Charlie",
        "photoURL": "https://avatars0.githubusercontent.com/u/5985247?v=4",
        "email": "charlie.a.gerard@gmail.com"
    }, {
        "uid": "OJtvRwGUS1VUlC7ArcjbicCUKj03",
        "displayName": "Aygul Zagidullina",
        "bio": "Dr. Aygul Zagidullina is a passionate Actions on Google developer. She is a Director of Social Media at MotaWord. Previously, Aygul worked at Todoist and Google. She holds a PhD in quantum chemistry and prior to Google dedicated 6 years to scientific research at the University of Stuttgart. Aygul is a very active member of the London digital ecosystem and has been involved in many innovative projects. She is a Google Developer Group (GDG)/ Women Techmakers (WTM) London lead, Google Top Contributor (TC)/ Trusted Tester (TT), and UK STEM Ambassador. Aygul has been a distinguished speaker at numerous international industry events in the US (at Google HQ), UK, Germany, Ireland, UAE, Greece, Turkey, Poland, Georgia, and Russia. She was named as one of The NEXT 100 Top Influencers of the European Digital Industry in 2013.",
        "company": "GDG/WTM London",
        "photoURL": "https://lh3.googleusercontent.com/-wmWxIHbCRGI/AAAAAAAAAAI/AAAAAAABUsA/6H6pBVYF6tQ/photo.jpg",
        "twitter": "@aygul",
        "email": "aygul.zagidullina@gmail.com"
    }, {
        "uid": "golnkyMWh5W7HjoAfmYcCvXh9Yg2",
        "displayName": "Louis Tournayre",
        "bio": "Développeur éclectique à temps plein, DT @ Zenika Lyon en journée et speaker occasionnel ",
        "company": "Zenika",
        "photoURL": "https://lh4.googleusercontent.com/-cVRndUQ_8GQ/AAAAAAAAAAI/AAAAAAAAAB8/HnFHwMBucLc/photo.jpg",
        "twitter": "@_louidji",
        "github": "louiznk",
        "email": "louis.tournayre@zenika.com",
        "phone": "+33670648146"
    }, {
        "uid": "wWYKM4fzp9SqMgB6euFohSb8ud33",
        "displayName": "Mathieu Mure",
        "photoURL": "https://lh3.googleusercontent.com/-zW9q6DSj72k/AAAAAAAAAAI/AAAAAAAAABs/_pqpmU87wFk/photo.jpg",
        "email": "mathieu.mure@zenika.com"
    }, {
        "uid": "ybQIhe8vG6R8JwNj9LlVDCZNZW73",
        "displayName": "Jean-Baptiste Clion",
        "photoURL": "https://lh6.googleusercontent.com/-2aZMmMUJ_jE/AAAAAAAAAAI/AAAAAAAARFU/yd_UvCyLb_4/photo.jpg",
        "email": "jbclion@gmail.com"
    }, {
        "uid": "OCdwPv6F8fdShLbwSDtFlvE0aZn1",
        "displayName": "Yoann Bourdex",
        "company": "Zenika",
        "photoURL": "https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg",
        "github": "@Yopadd",
        "email": "yoann.bourdex@zenika.com"
    }, {
        "uid": "6HmFtonMn8SZ9nTAS6l1WYWEP9o2",
        "displayName": "sebastien descamps",
        "bio": "Développeur et directeur technique de Zenika Bordeaux, j'interviens pour des missions de conseils et d'expertises. Passionné par tout ce qui touche à la sécurité et à l'intelligence artificielle, j'aime discuter de ces sujets dans des meetups ou des conférences.",
        "company": "Zenika",
        "photoURL": "https://lh6.googleusercontent.com/-HtyPKmBlQgY/AAAAAAAAAAI/AAAAAAAAAAA/dlp29c9zgIU/photo.jpg",
        "twitter": "@seb_express",
        "github": "sebastienD",
        "email": "sebastien.descamps@gmail.com"
    }, {
        "uid": "pDhSfa4fDfQxQdqx0iKxqAaKayB3",
        "displayName": "hiwelo.",
        "bio": "Damien est designer d’expériences centrées utilisateur à Amsterdam, Pays-Bas.\nMilitant queer et autiste, iel s’est spécialisé au cours des dernières années dans dans la création de services inclusifs et accessibles et l’analyse des besoins utilisateurs.\n\nIel coorganise des meetups à Amsterdam comme le NLHTML5. Et au milieu de ses passions pour la typographie et l'accessibilité, on retrouve également l'urbanisme, les transports ferroviaire et aérien et les ratons-laveur ! ",
        "company": "Raccoon Studio",
        "photoURL": "https://avatars0.githubusercontent.com/u/4989733?v=4",
        "twitter": "@iamhiwelo",
        "github": "hiwelo",
        "email": "damien@raccoon.studio",
        "phone": "+31682444466"
    }, {
        "uid": "ozjQPDh3uRRNeeYqDZ99WmWOceS2",
        "displayName": "Wassim Chegham",
        "bio": "Wassim is a Senior Developer Advocate and the Head of the Open Source Program Office at SFEIR. He is a GDE for the Angular team, as well as the  Actions On Google and the GCP teams at Google. He is a member of the ESM Modules Working Group and a mentor at the Node.js Foundation.",
        "company": "SFEIR",
        "photoURL": "https://avatars2.githubusercontent.com/u/1699357?v=4",
        "twitter": "@manekinekko",
        "github": "manekinekko",
        "email": "github@wassimchegham.com",
        "phone": "0686466378"
    }, {
        "uid": "ZxTW9RCzizbsEPMWVUEEHx8ECPn2",
        "displayName": "Alex Qin",
        "bio": "Alex Qin is a Brooklyn based programmer, educator, and public speaker. She believes in universal access to computer science education and in the importance of building technology for good. She is the founder of the Code Cooperative, an organization that teaches formerly incarcerated individuals tech literacy and coding as a means of liberation. She is on the Board of the Computer Science Teachers Association of NYC and on the Associate Board of Mouse. She recently left Gakko where she was the Director of Technology to work on the Code Cooperative full time. Prior to that, she was the Web Engineering Team Lead at Skillshare, and the Curriculum Director at Coalition for Queens. She holds a B.A. in Computer Science from New York University.\n",
        "company": "The Code Cooperative",
        "photoURL": "https://avatars1.githubusercontent.com/u/1229810?v=4",
        "twitter": "@alexqin",
        "github": "noidontdig",
        "email": "a@alexq.in",
        "phone": "+16466787625"
    }, {
        "uid": "SoYVyrxI1fVvqYNBN826NUNBvBk2",
        "displayName": "Vincent Courson",
        "bio": "Vincen Courson has been working at Google Dublin for the past 6 years, and is currently Senior Search Outreach Specialist. \nHis end-goal is to facilitate and encourage high-quality content creation on the French-language web, by communicating best practices for SEO and general modern website-creation.\n\nWith more than 4 years of public speaking experience and north of 30 public talks (SMX Paris, SEO Campus, GDG events, LeWeb, etc...), Vincent's topics range from explaining the basics of a Search-Engine (crawling-indexing-ranking algorithms) to technical  deep-dives into website security or implementation of Search-friendly JavaScript frameworks.\n\nVincent has also been helping out the Dublin GDG for the past 3 years, organizing events, and helping manage the developer community in Ireland.\n\nMore at - https://ie.linkedin.com/in/coursonv",
        "company": "Google",
        "photoURL": "https://lh3.googleusercontent.com/-qx7ER89N3c0/AAAAAAAAAAI/AAAAAAAAAOE/2CJ0cSQXiwM/photo.jpg",
        "twitter": "@VincentCourson",
        "email": "vcourson@google.com"
    }, {
        "uid": "eBX1yLqFltf5oN6955kXst2nWvu2",
        "displayName": "Nicolas Greffard",
        "bio": "Natif de Nantes où il obtient un DUT informatique, Nicolas Greffard part en Ecosse pour suivre un Master “Learning From Data” à l’université d’Edimbourg. Il reviendra finalement à Nantes pour y effectuer un doctorat dans le domaine de la visualisation d’information au sein de l’équipe Data User Knowledge du Laboratoire Informatique de Nantes Atlantique. Après deux ans passés en tant qu’ingénieur de recherche dans cette même équipe, il rejoint la société Expandium en 2015 comme data scientist puis, en 2018 la société Valeuriad avec la double casquette data scientist / responsable innovation. ",
        "company": "Valeuriad",
        "photoURL": "https://lh5.googleusercontent.com/-f0Q2OD1Ql1o/AAAAAAAAAAI/AAAAAAAAABM/w7DRPUk5iGc/photo.jpg",
        "email": "greffard.nicolas@valeuriad.fr",
        "phone": "0633596737"
    }, {
        "uid": "lscICB9JSkccxvod4QaEX9quauB3",
        "displayName": "Tanguy Gasselin",
        "photoURL": "https://lh4.googleusercontent.com/-nNXCJLR-pfQ/AAAAAAAAAAI/AAAAAAAAAAA/Y-_NAJ0pSAY/photo.jpg",
        "email": "gasselin.tanguy@valeuriad.fr"
    }, {
        "uid": "VF0bVRiF63dPEcscbKmnxXTqOm83",
        "displayName": "Emmanuel Lebeaupin",
        "bio": "Développeur passionné depuis plus de 15 ans et plus particulièrement dans le monde du Java et du Web, Emmanuel travaille actuellement au sein de la société CREATIVE sur des missions diverses et variées. Depuis quelques années, il s'intéresse aussi à Docker et son écosystème et il accompagne des clients autour des sujets liés à Docker.",
        "company": "Groupe Creative",
        "photoURL": "https://lh3.googleusercontent.com/-9t6J2_OmxXs/AAAAAAAAAAI/AAAAAAAAAAA/AB6qoq3PvVSmT1DlB7PK2ZYaLS4GmZVOVA/mo/photo.jpg",
        "twitter": "@elebeaup",
        "github": "elebeaup",
        "email": "emmanuel.lebeaupin@gmail.com"
    }, {
        "uid": "HhLonNfpANgPo08aRwD8cnnK8383",
        "displayName": "José M. Pérez",
        "bio": "I am a Software Engineer who likes web development and performance optimization.\n\nI like working with companies to improve their sites, ensuring they load quickly regardless of device and network conditions. From the initial developing process to auditing and analysis.\n\nCurrently I am working as a Technical Owner at Spotify in Stockholm, Sweden. Occasionally I speak at web conferences and meetups and work on side projects. I’m also a Google Developer Expert in Web Technologies.",
        "company": "Spotify",
        "photoURL": "https://avatars1.githubusercontent.com/u/416456?v=4",
        "twitter": "@jmperezperez",
        "github": "JMPerez",
        "email": "jmperez1985@gmail.com",
        "phone": "+46737848249"
    }],
    "surveys": [{
        "tshirt": "M",
        "gender": "male",
        "uid": "0EEYvwFpWsXeDaYwp8yIYoOUigh2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-15T13:01:07.295Z"
    }, {
        "updateTimestamp": "2018-06-30T12:42:11.328Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "0Y5yddqDl4dfJPu0PVoQpVIFclI2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-27T11:37:13.562Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "0alFaI2imGdQVSjuaMLFFfwqoL62",
        "accomodation": "no"
    }, {
        "tshirt": "XL",
        "info": "Yes",
        "transports": {
            "taxi": true
        },
        "diet": {
            "vegan": true
        },
        "uid": "0rNZujyWZhWZkxHWh7NZdnLv2873",
        "accomodation": "no",
        "updateTimestamp": "2018-04-30T17:30:49.709Z",
        "gender": "female"
    }, {
        "tshirt": "L",
        "gender": "male",
        "uid": "11mlK9RAq6f3pU5MCJ95B13oMmr1",
        "accomodation": "no",
        "updateTimestamp": "2018-05-21T20:33:26.677Z"
    }, {
        "updateTimestamp": "2018-06-02T14:59:05.419Z",
        "gender": "male",
        "tshirt": "L",
        "info": "En général, ma compagnie me paie les frais de déplacement. Possibilité d'avoir un partenariat bronze dans ce cas?",
        "uid": "11tCmLG2TKX86yFdmE9t5mf4aPq2",
        "accomodation": "no"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": true
        },
        "uid": "1azTdqRhX2ceYqyoELvdgtjWChl2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T15:46:28.693Z"
    }, {
        "uid": "1tn2ztJNRDS5ldN1F74cBAFvAJt2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-01T14:23:20.567Z",
        "tshirt": "XL",
        "gender": "male"
    }, {
        "gender": "female",
        "tshirt": "S",
        "transports": {
            "taxi": false
        },
        "diet": {
            "gluten-free": true
        },
        "uid": "2z3kPCVD9UfsVLk0xWt3lY3Wqnd2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T18:19:19.919Z"
    }, {
        "updateTimestamp": "2018-06-29T15:50:15.759Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "3JMFgzkpkpRnsm1229axRmxcCgY2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-30T15:50:26.394Z",
        "tshirt": "S",
        "gender": "male",
        "uid": "3P13YtdIG2O6YbxafdafbXF1eWI2",
        "accomodation": "no"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": false
        },
        "uid": "3cAi3SpZg6Y3rx5Gs7BYh9jCZOw1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-27T12:20:12.940Z"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "plane": true
        },
        "uid": "3gLXb3d2GuNS10ArYwo4bda3p7F3",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-03T17:24:18.930Z"
    }, {
        "tshirt": "L",
        "gender": "male",
        "uid": "3yO4kDkO2Gdct6eV9k2Af2K1bKO2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-16T12:26:07.567Z"
    }, {
        "updateTimestamp": "2018-06-30T18:47:29.880Z",
        "gender": "male",
        "tshirt": "L",
        "info": "I can check with the GDE program if they'll be able to cover my travel expenses.",
        "transports": {
            "plane": true
        },
        "uid": "55naoSebhCMEl2HYrQPyD4ec8Xf2",
        "accomodation": "yes"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "5EmB59zMagN1zd6bZkfkJz938Zw2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-21T07:04:48.712Z"
    }, {
        "tshirt": "M",
        "transports": {
            "train": true
        },
        "uid": "69Mj6uhnlwTGQPKhadRc2ZwTa6Y2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-15T08:49:55.554Z",
        "gender": "female"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "6HmFtonMn8SZ9nTAS6l1WYWEP9o2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-16T15:05:29.647Z"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "plane": true
        },
        "uid": "6Rm7D9oy3gXozQ1ha0YbBf3NSmj2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-02T10:40:31.430Z"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "7Pkhm7JrZKZ4cNRrs23cqIcJNvg2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-21T08:29:36.295Z"
    }, {
        "tshirt": "M",
        "transports": {
            "train": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "7Z5qYW6re9V3AeUxDq4UDdxQrI83",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-01T07:06:43.144Z",
        "gender": "female"
    }, {
        "tshirt": "L",
        "transports": {
            "train": true
        },
        "uid": "7ersUjPOVgN8xvIyV4qNfx4qFvJ2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-25T10:20:33.784Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-05-08T14:40:56.321Z",
        "gender": "male",
        "tshirt": "L",
        "info": "My employer might cover some of the travel costs, still tbd.",
        "transports": {
            "plane": true
        },
        "uid": "81dq3650yCQgJC0msNePh3alIDs2",
        "accomodation": "yes"
    }, {
        "tshirt": "XL",
        "info": "Localisé à Nantes, pas de besoin en transport/hébergement.",
        "uid": "85YULs8Zz2fCrYdFMO1cPz2RBif1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-08T16:06:03.580Z",
        "gender": "male"
    }, {
        "tshirt": "L",
        "gender": "male",
        "uid": "8PVK8GpEC2cNWn7GG6USVB4SpQ62",
        "accomodation": "no",
        "updateTimestamp": "2018-06-20T09:01:21.943Z"
    }, {
        "tshirt": "L",
        "gender": "male",
        "uid": "8Ygt6cyVRTNWeL7gvAauvHNf5V52",
        "accomodation": "no",
        "updateTimestamp": "2018-06-28T17:07:46.169Z"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "8k6bXCfq7Fe28oxshJLor4RhrqE3",
        "accomodation": "no",
        "updateTimestamp": "2018-06-25T15:25:43.465Z"
    }, {
        "uid": "8mAcBfxXFYNri2XLII7fzk610RB2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-21T14:34:40.725Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "uid": "977YQDolbxde0ito7I2dUiee2ap1",
        "accomodation": "no",
        "updateTimestamp": "2018-05-25T09:55:17.130Z",
        "tshirt": "M",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-26T17:44:01.687Z",
        "gender": "male",
        "tshirt": "M",
        "info": "http://www.leguedois.fr/logistique/",
        "transports": {
            "train": true
        },
        "diet": {
            "nut allergy": true
        },
        "uid": "9ATnRnH9QUMI95RIINHXqObX7Jv2",
        "accomodation": "no"
    }, {
        "tshirt": "L",
        "diet": {
            "gluten-free": true
        },
        "uid": "9LHSTmgvjXcyMPyfifAgXjtP6Z02",
        "accomodation": "no",
        "updateTimestamp": "2018-06-28T09:19:41.767Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-16T13:03:04.057Z",
        "gender": "male",
        "tshirt": "M",
        "diet": {
            "vegetarian": true
        },
        "uid": "9Rl67oEDSgdKcKJFzgYpgFzvnFD3",
        "accomodation": "no"
    }, {
        "uid": "9UrttgIJiCUggFUzHVNoa9LMldP2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-22T09:44:35.448Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "uid": "9gElbcbH86Q8VUKzNThIWkQ0Wih2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-07T14:20:06.694Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T12:13:03.800Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "A05hoXsBIKZH3fXi31lFbuyMXJ62",
        "accomodation": "no"
    }, {
        "tshirt": "XXL",
        "info": "Looking forward to this new edition :)",
        "uid": "BAbr81fegJfRqhz4Yj9Y9VW3jsg1",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-28T19:54:32.180Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-05-16T06:23:42.646Z",
        "tshirt": "S",
        "gender": "male",
        "uid": "BHW8h7LzhBSqs80aZEVwrDiAUDj2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-18T12:51:49.984Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "CQO7iVm9GWb4jFPi3xmIUnsyY5r2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-20T11:25:10.943Z",
        "gender": "male",
        "tshirt": "M",
        "info": "I'm bald 👴",
        "diet": {
            "halal": false
        },
        "uid": "DCR6gPzIJjMPThacIvxjHRBZG612",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "info": "Des bisous !",
        "diet": {
            "vegetarian": true
        },
        "uid": "DNlgKL7C5DNK0y48Lf7ylPB4bmk2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-30T09:46:46.132Z",
        "gender": "male"
    }, {
        "uid": "DQHwfFU9oBZMzOpKLxOWdymoK053",
        "accomodation": "no",
        "updateTimestamp": "2018-05-21T19:30:33.658Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-19T20:19:41.656Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "Dxijj1qSe8eKhVr4GHG91eqXb0v2",
        "accomodation": "no"
    }, {
        "uid": "E7CkfLqySdM9UPa0MLAqo1ggV9F3",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-04T07:52:14.490Z",
        "gender": "male",
        "tshirt": "L",
        "info": "J'ai mis oui pour la prise en charge des frais, si c'est problématique je discuterai avec Sfeir. Merci !",
        "transports": {
            "train": true
        }
    }, {
        "updateTimestamp": "2018-05-28T09:59:04.654Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "E9KBYRpQ2udwy6wkEldMgQdZypw2",
        "accomodation": "no"
    }, {
        "tshirt": "XL",
        "gender": "male",
        "uid": "ELSNzsaCSePC0ZbXCPoaMUcxhAV2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T17:34:55.810Z"
    }, {
        "tshirt": "XL",
        "transports": {
            "train": true
        },
        "uid": "EaXNtkNUW4ZPzitfME4SUceu2dR2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-15T18:07:20.223Z",
        "gender": "male"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "Ee0093o3NybEOfzWKfRDy2rpKsG2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T11:56:49.555Z"
    }, {
        "tshirt": "M",
        "info": "I submitted several talks so you have flexibility filling in your tracks. Please reach out if you'd like to change any of them to fit better! ",
        "uid": "FFR0y1rZA9TrfRqiJ3CRSX5tMAB3",
        "accomodation": "no",
        "updateTimestamp": "2018-05-14T18:36:35.035Z",
        "gender": "male"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "FdH8RDo6FERL1mCOAZLfjPMQ7Co1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-30T14:22:00.094Z"
    }, {
        "tshirt": "S",
        "gender": "male",
        "uid": "FsBynEY2KgZxBkUFpJP8zMMufKm1",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-17T11:54:58.536Z"
    }, {
        "uid": "G4qsxz7qcUhzNmcWpgbtgVr9x8R2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T15:20:23.859Z",
        "tshirt": "S",
        "gender": "male"
    }, {
        "tshirt": "L",
        "diet": {
            "vegetarian": true
        },
        "uid": "GaTXktSpMGXO1RIGafgjJ9m87oB3",
        "accomodation": "no",
        "updateTimestamp": "2018-06-02T12:51:48.218Z",
        "gender": "male"
    }, {
        "uid": "H3QHP1wvJDUG0sW402gh9ktbNx03",
        "accomodation": "no",
        "updateTimestamp": "2018-06-03T11:48:59.076Z",
        "tshirt": "M",
        "gender": "male"
    }, {
        "tshirt": "M",
        "transports": {
            "train": true
        },
        "uid": "H9ABELSm38U2QOiMM5hA3XRlqh13",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-20T16:59:29.149Z",
        "gender": "male"
    }, {
        "uid": "Hb9ldUrxrpTo1qDE7y803PFJARD2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-09T16:59:27.455Z",
        "tshirt": "XXL",
        "gender": "male"
    }, {
        "uid": "IPck78ZRNPaINM4qaagRuJnDZvR2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T13:23:21.549Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T07:52:55.125Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "JCmc2pjoaMQnAqWLkoA52FtzHrZ2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-05T14:38:30.367Z",
        "gender": "female",
        "tshirt": "M",
        "transports": {
            "train": false
        },
        "uid": "JUCefgjEzah1N328BjCrB5mMtI52",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-29T13:28:31.812Z",
        "tshirt": "XXL",
        "gender": "male",
        "uid": "JYWzV4WaUEX9gttxADEGQa6mL8x1",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "transports": {
            "train": true,
            "plane": false
        },
        "uid": "JkWN4X6967cvBrV2x8vKf1QrHS93",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-15T15:30:45.879Z",
        "gender": "female"
    }, {
        "tshirt": "M",
        "info": ":)",
        "transports": {
            "train": true
        },
        "uid": "KCsdhhNpQGU1LMUizfvs9IizQ9W2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T14:02:31.651Z",
        "gender": "female"
    }, {
        "updateTimestamp": "2018-05-28T15:59:25.969Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "KMT0bBBLqUXt35hiOhXqlzctFlv2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-01T06:21:14.703Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "KfbSn0JjVGTXusd2dIC1Bo8qpGd2",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "gender": "male",
        "uid": "L3kZjY5dZ2UfPAj5GwBWDFQ8YV92",
        "accomodation": "no",
        "updateTimestamp": "2018-06-28T18:54:51.484Z"
    }, {
        "updateTimestamp": "2018-06-29T19:25:50.668Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "LGE1O5iBpFbNejZqofUgLQCgi862",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "Lf8iKZWeX6dQAcEMwSsHj0k6lTr1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-20T13:48:32.115Z"
    }, {
        "updateTimestamp": "2018-06-22T13:10:17.689Z",
        "tshirt": "L",
        "gender": "female",
        "uid": "MFT4lwPv0Ifp7qEXiyFbWNeO4Np2",
        "accomodation": "no"
    }, {
        "tshirt": "L",
        "transports": {
            "plane": true
        },
        "uid": "Mm6r20ZesnSXk6qzoAHWznEZG8D2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-30T07:51:41.085Z",
        "gender": "male"
    }, {
        "uid": "MrPk699zxcaGHCUV0JOBCHHPnz52",
        "accomodation": "no",
        "updateTimestamp": "2018-05-14T07:57:48.615Z",
        "tshirt": "XL",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-05-31T08:33:37.241Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "NEuHFOJuVlNis4dFxumpF3XaVYj2",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "transports": {
            "train": true
        },
        "uid": "NONyUVsEwmfW9DclQV5Px2K5qvk2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-26T21:09:54.378Z",
        "gender": "female"
    }, {
        "updateTimestamp": "2018-06-25T16:06:48.218Z",
        "gender": "male",
        "tshirt": "M",
        "transports": {
            "plane": true
        },
        "uid": "NPpqiJmB6TNPh4BjTOLkONjiVLH2",
        "accomodation": "yes"
    }, {
        "tshirt": "M",
        "diet": {
            "vegetarian": true
        },
        "uid": "OCdwPv6F8fdShLbwSDtFlvE0aZn1",
        "accomodation": "no",
        "updateTimestamp": "2018-05-22T11:55:48.249Z",
        "gender": "male"
    }, {
        "gender": "female",
        "tshirt": "S",
        "transports": {
            "train": false,
            "plane": true
        },
        "uid": "OJtvRwGUS1VUlC7ArcjbicCUKj03",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-30T11:53:11.764Z"
    }, {
        "diet": {
            "nut allergy": false
        },
        "uid": "P7GodQ7zT7ga11CdW9L1OkMbwfv2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-27T17:44:35.664Z",
        "gender": "male",
        "tshirt": "M"
    }, {
        "tshirt": "L",
        "diet": {
            "vegetarian": true
        },
        "uid": "PRuMzxC7NVbsVnJP07AbHR2cNFx2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-30T15:49:46.992Z",
        "gender": "male"
    }, {
        "tshirt": "M",
        "diet": {
            "halal": true
        },
        "uid": "Pvih39e87daOxQFKieoIUzu6p343",
        "accomodation": "no",
        "updateTimestamp": "2018-06-27T13:01:40.981Z",
        "gender": "male"
    }, {
        "uid": "PznkdQ6EJbSQ1XHdOJ25aWpFUN53",
        "accomodation": "no",
        "updateTimestamp": "2018-05-02T09:42:37.178Z",
        "gender": "male",
        "tshirt": "S",
        "info": "Xavier et Jeff sont très gentils :)"
    }, {
        "uid": "Q6cDQtmIpNTZV4wmDE4iIWg8thg1",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-27T13:31:28.796Z",
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": false,
            "taxi": true
        }
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "QFkdKJO9idO0ex8fJJOsNtsCJD32",
        "accomodation": "no",
        "updateTimestamp": "2018-06-27T19:08:35.637Z"
    }, {
        "diet": {
            "vegetarian": true
        },
        "uid": "QMVpajaP9WYoLg8vpzmjYXGoSeu1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-14T13:10:38.463Z",
        "gender": "male",
        "tshirt": "M"
    }, {
        "tshirt": "XL",
        "info": "Thanks for your work on this beautiful event. :D",
        "diet": {
            "vegetarian": true
        },
        "uid": "QNcsmbf38GaAYxMzfIiyT9bOZDE3",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T13:23:45.173Z",
        "gender": "genderless"
    }, {
        "tshirt": "M",
        "gender": "female",
        "uid": "QuCFwwCRLKQkT4tsxPMRfIu9IdP2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-25T11:58:09.175Z"
    }, {
        "tshirt": "XXL",
        "transports": {
            "taxi": false
        },
        "uid": "RPVWW7QKriOpm06JMJsjGBbiKxt2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-31T12:21:03.153Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-24T22:21:38.688Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "RPtZ2x23okgpLtrQQxTRnUDr2q23",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-27T09:46:21.390Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "RS8jUpXjLzM1NMcL7r8AStWmgG33",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "transports": {
            "train": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "RYE52LYDeJMIEj31tke05ujzkWS2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-29T15:56:32.618Z",
        "gender": "male"
    }, {
        "tshirt": "L",
        "transports": {
            "plane": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "RYuF82wSxHfx361P0xXiwAkbG462",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-19T05:22:28.787Z",
        "gender": "male"
    }, {
        "tshirt": "L",
        "transports": {
            "plane": true
        },
        "uid": "SOxFDVFePQVBor9U92lSoAohcJB2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-04T09:25:10.007Z",
        "gender": "male"
    }, {
        "gender": "male",
        "tshirt": "XXL",
        "info": "I believe my company can be interested in sponsoring the conference providing transport costs",
        "transports": {
            "train": false,
            "plane": true
        },
        "uid": "SSEElnanjyelocOJiEslj2b871g2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-08T09:08:51.474Z"
    }, {
        "tshirt": "M",
        "info": "My company might be able to sponsor part of the expenses since the flights may be a little expensive",
        "transports": {
            "plane": true
        },
        "uid": "SXPazTMQpSRumaKq6tyZgfcQgO73",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-18T16:49:54.215Z",
        "gender": "male"
    }, {
        "uid": "Se0tC9TyyZZcUtRZjLM3fIxw54i1",
        "accomodation": "no",
        "updateTimestamp": "2018-05-30T15:54:58.672Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-11T14:23:50.956Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "SoYVyrxI1fVvqYNBN826NUNBvBk2",
        "accomodation": "no"
    }, {
        "gender": "male",
        "tshirt": "M",
        "transports": {
            "train": true,
            "plane": true,
            "taxi": false
        },
        "diet": {
            "vegetarian": true,
            "halal": false
        },
        "uid": "SxMr445PTeY5HfqlJT53OhEaZrp1",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-03T12:52:14.910Z"
    }, {
        "updateTimestamp": "2018-06-26T11:19:32.133Z",
        "gender": "male",
        "tshirt": "M",
        "info": "DevFest Nantes is awesome :-)",
        "uid": "T0c4tdkG6PTJTDajvQVpJRzFsU63",
        "accomodation": "no"
    }, {
        "uid": "TGG1617K2yb9yIS2BwwFVfpSKr72",
        "updateTimestamp": "2018-06-10T06:06:32.951Z",
        "tshirt": "XL",
        "gender": "male"
    }, {
        "tshirt": "XXL",
        "gender": "male",
        "uid": "TNiBjaQyEdZIfC8UOpX8giIezZ12",
        "accomodation": "no",
        "updateTimestamp": "2018-07-05T12:08:54.989Z"
    }, {
        "diet": {
            "vegan": true
        },
        "uid": "TPWhOWHNJAchLUJWXi1RORH4xF32",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T08:37:35.971Z",
        "gender": "male",
        "tshirt": "M",
        "transports": {
            "plane": true
        }
    }, {
        "updateTimestamp": "2018-07-04T09:36:47.855Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "Tb6JYkRmCnQdSQmEjnpuUFsQ5XM2",
        "accomodation": "no"
    }, {
        "uid": "UMM1rlXTnCZ7syxQKViCvbbtbW63",
        "accomodation": "no",
        "updateTimestamp": "2018-05-22T11:45:29.919Z",
        "tshirt": "XXXL",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T19:01:58.551Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "UcOkqPf8e7by8kcWRUl4pRdQt0l1",
        "accomodation": "no"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": true
        },
        "uid": "Usrb6yEQlzcVeMP7ualw3a9KT7z2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-04T14:19:02.637Z"
    }, {
        "uid": "VF0bVRiF63dPEcscbKmnxXTqOm83",
        "accomodation": "no",
        "updateTimestamp": "2018-06-30T14:59:16.685Z",
        "tshirt": "M",
        "gender": "male"
    }, {
        "uid": "VRRDuEGOErfizKEb74ikxCX0Ogk1",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T13:21:49.859Z",
        "gender": "female",
        "tshirt": "M",
        "transports": {
            "train": true
        }
    }, {
        "updateTimestamp": "2018-06-29T07:58:58.368Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "VYJoV1XWNChyBZGp81ogjv9xHSp2",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "transports": {
            "taxi": true,
            "train": true
        },
        "diet": {
            "nut allergy": true
        },
        "uid": "VeBTP8lqOYaXBCpwTlGjBW2n1yH2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-31T02:47:13.236Z",
        "gender": "male"
    }, {
        "gender": "male",
        "tshirt": "M",
        "info": "<3",
        "uid": "VopbKY4QXwallUqHYGJjK6bjap22",
        "accomodation": "no",
        "updateTimestamp": "2018-05-31T13:34:48.063Z"
    }, {
        "uid": "WP4HfOBAdCP90Wu77H251D5VUd73",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-19T13:42:16.678Z",
        "gender": "male",
        "tshirt": "M",
        "info": "I'm a google developer expert, so maybe Google can cover my travel expenses.",
        "transports": {
            "plane": true
        }
    }, {
        "diet": {
            "vegetarian": false
        },
        "uid": "WcLIdgBZKjafCClB2t7uSDh3udj1",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-28T08:39:00.886Z",
        "gender": "female",
        "tshirt": "XXL",
        "transports": {
            "train": true
        }
    }, {
        "updateTimestamp": "2018-06-29T09:19:01.370Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "Wf9MjOBmIyeuE8JYx9660n1ahf52",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-27T16:44:07.989Z",
        "tshirt": "S",
        "gender": "male",
        "uid": "Wmkg6XwTV8atry6w7cf6pSKc9Q73",
        "accomodation": "no"
    }, {
        "tshirt": "L",
        "gender": "female",
        "uid": "X2rcvFSHBTQJTxL5IHsgRWrtPUK2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-17T19:33:44.806Z"
    }, {
        "updateTimestamp": "2018-06-27T16:25:45.472Z",
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": true
        },
        "uid": "X8iAvDR6oSW7rhzRxyC7fETErLq1",
        "accomodation": "yes"
    }, {
        "updateTimestamp": "2018-05-07T12:00:36.793Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "XDlInAFrlXVJBlvX8wZP43akg1g1",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "gender": "female",
        "uid": "YcQXO0D4TSOzohi0mmTcSRlsgUU2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-28T19:29:15.842Z"
    }, {
        "gender": "male",
        "tshirt": "XL",
        "diet": {
            "vegan": true
        },
        "uid": "YekYpIjaNaNPwjH7EwZKYgsOPjz2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-01T15:40:10.675Z"
    }, {
        "tshirt": "S",
        "gender": "male",
        "uid": "YfpkQpBnMBYsO2xbYPZSN6a2Scg2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-26T12:14:52.884Z"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "YrPGDzcnbLRyw7lwWsW2tVxWCvI2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-28T20:12:26.900Z"
    }, {
        "tshirt": "M",
        "transports": {
            "taxi": false,
            "train": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "Z6KnfuiEY5aAwPhmOebXc1DMKkk1",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T09:30:30.181Z",
        "gender": "male"
    }, {
        "tshirt": "XL",
        "info": "cannot eat sea food",
        "transports": {
            "taxi": false,
            "plane": false
        },
        "uid": "ZdNase96oBSI6QdrWySX9eCtJgs1",
        "accomodation": "no",
        "updateTimestamp": "2018-05-03T17:56:36.368Z",
        "gender": "male"
    }, {
        "tshirt": "M",
        "gender": "female",
        "uid": "Zh0jSqb4vNNfmUejwkPwoOozifJ2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-26T13:17:04.576Z"
    }, {
        "uid": "ZkWFBC7R4ZgiPCzCXXsTExeA0JA2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T09:54:38.738Z",
        "tshirt": "XXL",
        "gender": "male"
    }, {
        "tshirt": "L",
        "info": "<3",
        "uid": "ZvFfwrhzwlf1P3NR6VJTrbFVMDv1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-26T13:55:01.427Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-07-04T15:31:38.879Z",
        "gender": "female",
        "tshirt": "M",
        "transports": {
            "taxi": true,
            "train": false,
            "plane": true
        },
        "uid": "ZxTW9RCzizbsEPMWVUEEHx8ECPn2",
        "accomodation": "yes"
    }, {
        "updateTimestamp": "2018-06-29T16:27:40.000Z",
        "tshirt": "M",
        "gender": "female",
        "uid": "aJ1AY0He6aQsACtISRIGq5mIcsA3",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-28T14:39:16.683Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "aS3Fy9cw8egr4ESfiSlgFSMTVkz2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-30T05:01:57.840Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "aZhOFQLdUPas825PKghQ6upaJm53",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "transports": {
            "train": true
        },
        "uid": "anMP5ie0tceaj82UtIo9xKuf7fG2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T14:50:38.013Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T08:39:49.333Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "bcnPd1ytzyQdNs1thfTuWnMr7DF3",
        "accomodation": "no"
    }, {
        "gender": "male",
        "tshirt": "S",
        "transports": {
            "plane": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "dLNYOOwcWTQr14BB4L82QDoxCXv2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-18T14:29:11.101Z"
    }, {
        "tshirt": "M",
        "info": "I can also come with my car!",
        "transports": {
            "train": true
        },
        "uid": "dWlj2ryoeVfnUVBmYG1MqLPd5CC2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-30T19:50:36.068Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-25T13:18:55.102Z",
        "gender": "male",
        "tshirt": "XL",
        "diet": {
            "nut allergy": true
        },
        "uid": "do9mx5snJIfsAzQi0810OHepaXS2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-04T16:44:59.945Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "duQQfqi4AQT7oCLPdsk7HDY6nkI2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-11T09:44:57.383Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "e48Hzn03cyQ94rsRUi3LmEjU3XV2",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "transports": {
            "taxi": false
        },
        "uid": "e7kZ7AtaNjOfLWVisyhLWZNKbcF2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-26T09:45:24.235Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-05-14T12:06:15.107Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "eBX1yLqFltf5oN6955kXst2nWvu2",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "transports": {
            "train": true
        },
        "uid": "eBooUZ7QZPeiZc86JEWqM49zg5d2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-26T15:30:44.434Z",
        "gender": "male"
    }, {
        "tshirt": "L",
        "info": "Le funding hotel+train est un plus, mais non bloquant.",
        "transports": {
            "taxi": false,
            "train": true
        },
        "uid": "eMFPF8fp2UTnePLtRCc0XgQddy12",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-30T13:36:22.159Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-25T12:31:16.889Z",
        "gender": "male",
        "tshirt": "L",
        "info": "I'm colorblind :)",
        "uid": "fEH1SbhBOuM5ekRldhoiMOKu2Rt1",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-29T15:30:18.735Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "fcH2tfSj1Adpr41mgn2sStSaC8f1",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-07-04T07:10:18.096Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "fefPEDpeH7QP9YaZNdoJggl2paR2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-30T11:41:34.190Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "gc7UU76X8rPr0TlUxisWFi8deWD2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-25T10:46:45.489Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "gi9o97OypXeceauEUFtlUnKFLq72",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-25T11:51:28.130Z",
        "tshirt": "S",
        "gender": "male",
        "uid": "gk7IxYci75Rwi9GHoEf9q7tapG13",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-03T09:55:51.107Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "golnkyMWh5W7HjoAfmYcCvXh9Yg2",
        "accomodation": "no"
    }, {
        "tshirt": "XXXL",
        "gender": "male",
        "uid": "hCf56apqdGUhVJaktqEDh8ZjhCA2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-18T13:17:40.009Z"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "hDzLDt6oyyME7lk1JVYIjPbW3XG2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T13:04:29.080Z"
    }, {
        "updateTimestamp": "2018-06-30T13:43:44.958Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "hKc1vk2qrncKXF6VIYdzAXi0fGF2",
        "accomodation": "no"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": true,
            "plane": false
        },
        "uid": "hNJQAcILoPXC0yHkgxYsfYGhkFx2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-21T16:08:11.528Z"
    }, {
        "tshirt": "L",
        "transports": {
            "plane": true
        },
        "uid": "hVAvuY1wYQbg8I5ZsFNAbPU7r132",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-01T15:27:15.575Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-30T22:03:34.464Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "iOhLyaicopfLG1jOFMv627jHQVg1",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "info": "About accommodation funding, I can share a room with Stephanie Walter if we are both selected as speakers (we are a couple, I'm not sneakily inviting her in my room)",
        "transports": {
            "train": true
        },
        "uid": "if5EFXF7TEgPy45VFB8ToIPmFJ63",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-17T17:04:00.225Z",
        "gender": "male"
    }, {
        "tshirt": "M",
        "transports": {
            "plane": false
        },
        "diet": {
            "nut allergy": true
        },
        "uid": "ipuyc9wFgwhpIUkEgRleRUBi2OA2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-29T13:37:22.461Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T15:55:01.725Z",
        "gender": "male",
        "tshirt": "M",
        "transports": {
            "train": true
        },
        "uid": "jCqk2hSu1scpgtgwwMiRwULkEeE3",
        "accomodation": "yes"
    }, {
        "updateTimestamp": "2018-06-15T14:53:54.040Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "jMUwWI44kuTXsgUt8vLFp3vAe1j1",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "info": "I love craft beers.",
        "uid": "jOwPOYosNlUjLVFK7M8COZwgPsp2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-28T09:09:07.215Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T13:58:42.325Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "jYQ2K3bqt8RPSeBVE6Zdd7OkGet1",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "transports": {
            "plane": true
        },
        "uid": "jgArCOIWWDOjhQQZcfNRLMkrEG12",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-30T18:02:26.566Z",
        "gender": "male"
    }, {
        "uid": "jpPyKTXulPdY90WMoWHOSzzL1aA2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-22T09:38:16.914Z",
        "tshirt": "M",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-07T08:38:53.419Z",
        "gender": "male",
        "tshirt": "M",
        "info": "👏",
        "diet": {
            "vegetarian": true
        },
        "uid": "k9if2nUPTaSMqcC8t29XiYovPwh1",
        "accomodation": "no"
    }, {
        "uid": "lT6Ss2eySneWriuGW3kHLTre0Sx1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T15:07:16.626Z",
        "tshirt": "M",
        "gender": "female"
    }, {
        "updateTimestamp": "2018-06-27T10:17:23.000Z",
        "gender": "male",
        "tshirt": "S",
        "transports": {
            "train": true
        },
        "uid": "mFpJDbJtdIULJQtKkiNFaOHsQbK2",
        "accomodation": "yes"
    }, {
        "updateTimestamp": "2018-06-22T14:27:13.068Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "mGoCYS40PXcDZbELsSJjt0m7uCp1",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-01T09:23:38.170Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "mODnTNL9onNOU1odUO9jb2tbpQj2",
        "accomodation": "no"
    }, {
        "tshirt": "XXL",
        "info": "Je sais pas si le plus simple est le train ou l'avion depuis Luxembourg, mais je pense que ça risque d'etre en avion. Au pire est-ce possible de passer vendredi et  faire le trajet jeudi dans la journée si c'est trop compliqué niveau transport ?",
        "transports": {
            "train": true,
            "plane": true
        },
        "uid": "mgaHfTteB0VlvHg0kEK8J4XUm5G2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-17T16:37:06.564Z",
        "gender": "female"
    }, {
        "updateTimestamp": "2018-05-14T12:20:04.811Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "nIDmdNfDnXPBn8dL5owlTKdSy1J2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-27T13:54:21.854Z",
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": false,
            "plane": false
        },
        "uid": "nK2RbdiC6LhdW5zSheDDBDp0gbL2",
        "accomodation": "no"
    }, {
        "tshirt": "XL",
        "transports": {
            "train": true
        },
        "uid": "nwjwdYQ8SnhnXv1v7IOhcVwC2k23",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-01T09:20:23.542Z",
        "gender": "male"
    }, {
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "taxi": false,
            "train": false
        },
        "uid": "oQLYB9xjsNf63qsB5tKV80hYKPF3",
        "accomodation": "no",
        "updateTimestamp": "2018-06-28T14:10:07.011Z"
    }, {
        "uid": "ozjQPDh3uRRNeeYqDZ99WmWOceS2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-26T23:44:16.407Z",
        "gender": "male",
        "tshirt": "M",
        "transports": {
            "train": false
        }
    }, {
        "updateTimestamp": "2018-06-21T21:29:31.330Z",
        "gender": "genderless",
        "tshirt": "M",
        "info": "I'm an autistic agender person, but it is not this annoying :D ",
        "transports": {
            "plane": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "pDhSfa4fDfQxQdqx0iKxqAaKayB3",
        "accomodation": "yes"
    }, {
        "updateTimestamp": "2018-06-27T18:52:09.134Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "pIBFdAqx3JbwPTd26OpvEvy4EJC2",
        "accomodation": "no"
    }, {
        "tshirt": "L",
        "info": "Thanks for organizing this, people!",
        "uid": "pYuiGicpt0MenD8NEMhZXtk6VSr1",
        "accomodation": "no",
        "updateTimestamp": "2018-05-28T13:25:37.842Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-27T07:41:22.526Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "phnaJGo2c9c6XXJ4rz57Pg8742t2",
        "accomodation": "no"
    }, {
        "tshirt": "M",
        "transports": {
            "train": false
        },
        "uid": "q0loEfu1p9W9koVGoXzD73iZszJ3",
        "accomodation": "no",
        "updateTimestamp": "2018-06-21T14:41:51.843Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-06T13:31:54.491Z",
        "tshirt": "XXXL",
        "gender": "male",
        "uid": "qY0biGTf3gZcEaJtetsWlnkARMW2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-29T08:35:17.309Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "qZJ0DAHMa5Rf3t62A3feuyEYktT2",
        "accomodation": "no"
    }, {
        "uid": "rDKV0gUOk0O4WU9tpknPAngMF9A3",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-01T16:20:21.339Z",
        "gender": "male",
        "tshirt": "L",
        "transports": {
            "train": true,
            "taxi": true
        }
    }, {
        "updateTimestamp": "2018-06-26T09:40:08.049Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "rhUAu7jJyHb81o2qMgbwwlhIDQ82",
        "accomodation": "no"
    }, {
        "uid": "sNc6usDmBJMSPh0Z66CwVaE9xkv2",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-01T22:12:14.864Z",
        "gender": "male",
        "tshirt": "M",
        "transports": {
            "train": true,
            "taxi": true
        }
    }, {
        "tshirt": "S",
        "transports": {
            "train": true
        },
        "uid": "sjuhPIWFEBf75pDWj1XDDnG0zqM2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-30T21:10:05.950Z",
        "gender": "female"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "soOwnXpasuP4EBll18nX8DCgXuD2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-26T08:46:29.933Z"
    }, {
        "updateTimestamp": "2018-06-29T16:43:16.535Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "t38CFKzxQbcFE0LW1560zO7k82o1",
        "accomodation": "no"
    }, {
        "uid": "tZrCA8r815cJeBIHb4bgbSgvkZz1",
        "accomodation": "no",
        "updateTimestamp": "2018-07-02T09:05:50.664Z",
        "tshirt": "M",
        "gender": "male"
    }, {
        "tshirt": "M",
        "diet": {
            "vegetarian": true
        },
        "uid": "thaZ3448ukeDRFYa4LeuBHt7zg43",
        "accomodation": "no",
        "updateTimestamp": "2018-05-31T15:23:34.955Z",
        "gender": "male"
    }, {
        "tshirt": "S",
        "transports": {
            "train": true
        },
        "uid": "u2RW4JoW8WQTb0XrjW0alGjIWAW2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-26T15:03:54.436Z",
        "gender": "male"
    }, {
        "tshirt": "S",
        "transports": {
            "train": true,
            "plane": true,
            "taxi": true
        },
        "diet": {
            "vegetarian": true
        },
        "uid": "u5Kpub4UsGbZNFPhuC4FcPtHieo2",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-27T09:40:16.705Z",
        "gender": "female"
    }, {
        "updateTimestamp": "2018-05-15T13:25:00.527Z",
        "tshirt": "M",
        "gender": "male",
        "uid": "u6xKtXK4v9U3m4Qei9Oloyn0hm62",
        "accomodation": "no"
    }, {
        "diet": {
            "nut allergy": false
        },
        "uid": "uGGZuv5ZwmbTOZhWhBujIEIhQ7W2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-28T13:36:50.518Z",
        "gender": "male",
        "tshirt": "S",
        "info": "Nope thanks"
    }, {
        "tshirt": "M",
        "info": "BEEEEERS !!!",
        "uid": "uVmwwKmTAvcwlcKVpcQb4517eJX2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-25T11:17:51.406Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-29T10:03:15.132Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "uxepB1vrpvUnujmGe6AwG9jWXy52",
        "accomodation": "no"
    }, {
        "uid": "vGIzXx8gyUgf6JzokRYQ2pjoICo1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T09:35:14.705Z",
        "tshirt": "M",
        "gender": "male"
    }, {
        "tshirt": "L",
        "transports": {
            "train": true,
            "plane": true,
            "taxi": true
        },
        "uid": "w2ectyVKGdVCqAGsAD6d7KDmhgu1",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-28T19:16:43.545Z",
        "gender": "male"
    }, {
        "tshirt": "L",
        "gender": "male",
        "uid": "wKSgBnBjceaQ6QoEvM9Q9fw2iG22",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T13:32:50.314Z"
    }, {
        "uid": "wpyUKOZWGMP9G5RegIwFB2YWCDA2",
        "accomodation": "no",
        "updateTimestamp": "2018-05-18T06:37:15.527Z",
        "tshirt": "XL",
        "gender": "male"
    }, {
        "uid": "wtahV9tMbmRlirSUq5azGlUvWpc2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-04T09:09:27.447Z",
        "tshirt": "XXL",
        "gender": "male"
    }, {
        "tshirt": "M",
        "gender": "male",
        "uid": "xRVGK3tbTUN4jfWPUWjw7Uv7dAz2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-29T22:08:20.315Z"
    }, {
        "tshirt": "S",
        "transports": {
            "taxi": true,
            "train": true
        },
        "uid": "xljN1NDsmqcL2zhmVTrBMgVdPVh1",
        "accomodation": "yes",
        "updateTimestamp": "2018-05-03T11:21:06.435Z",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-06-30T05:04:38.999Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "xuQVNf3l6lhwv1ebf1E61qHroJ52",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-01T12:46:18.133Z",
        "gender": "male",
        "tshirt": "XXL",
        "transports": {
            "train": true,
            "taxi": true
        },
        "uid": "xxE9cAbMadTiqMG3UQwEt0CQbkD2",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-06-26T14:05:26.427Z",
        "tshirt": "L",
        "gender": "male",
        "uid": "yP7zqky96YP1zvK98ny0zR4fNGk1",
        "accomodation": "no"
    }, {
        "updateTimestamp": "2018-05-29T11:25:12.356Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "yVh0TaIWmiRohty6BeheTneHxLI2",
        "accomodation": "no"
    }, {
        "tshirt": "S",
        "gender": "male",
        "uid": "yZVvKIOx5kSa2xyjRakstUisl4A2",
        "accomodation": "no",
        "updateTimestamp": "2018-06-30T22:25:56.544Z"
    }, {
        "uid": "yiwHdWVwKrZmm3U63qlooaVzmO43",
        "accomodation": "yes",
        "updateTimestamp": "2018-06-17T16:58:15.617Z",
        "gender": "male",
        "tshirt": "M",
        "info": "About accommodation funding, I can share the room with Stephanie Walter if we are both selected as speakers. (yes we are in couple, I'm not inviting her in my room)",
        "transports": {
            "train": true
        }
    }, {
        "updateTimestamp": "2018-06-25T15:22:01.639Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "zCSr1FlJ0Ofh70o47Ad9wrT1lx02",
        "accomodation": "no"
    }, {
        "uid": "zZwPoNW47CT8ftvBt6xBPboACAj1",
        "accomodation": "no",
        "updateTimestamp": "2018-06-26T15:48:25.428Z",
        "tshirt": "L",
        "gender": "male"
    }, {
        "updateTimestamp": "2018-05-04T08:55:07.307Z",
        "tshirt": "XL",
        "gender": "male",
        "uid": "zbsvtrRztGN9moHOPdYkla9PAEB3",
        "accomodation": "no"
    }]
}