{
  "101": {
    "id": 101,
    "title": "Gates open / Ouverture des portes",
    "titleMobile": "Gates open",
    "image": "/images/backgrounds/opening.jpg",
    "type": "break"
  },
  "102": {
    "id": 102,
    "title": "Opening keynote / Keynote d'ouverture",
    "titleMobile": "Opening keynote",
    "image": "/images/backgrounds/keynote.jpg",
    "description": "",
    "type": "📣 Keynote",
    "track": {
        "title": "Titan"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        181
    ]
  },
  "103": {
    "id": 103,
    "title": "Lunch / Déjeuner",
    "titleMobile": "Lunch",
    "description": "Foooooood !!!",
    "image": "/images/backgrounds/lunch.jpg",
    "type": "break"
  },
  "104": {
    "id": 104,
    "title": "After Party",
    "description": "",
    "image": "/images/backgrounds/party.jpg",
    "type": "break"
  },
  "105": {
    "id": 105,
    "title": "Gates open / Ouverture des portes",
    "titleMobile": "Gates open",
    "image": "/images/backgrounds/opening.jpg",
    "type": "break"
  },
  "106": {
    "id": 106,
    "title": "Lunch / Déjeuner",
    "titleMobile": "Lunch",
    "description": "Foooooood !!!",
    "image": "/images/backgrounds/lunch.jpg",
    "type": "break"
  },
  "107": {
    "id": 107,
    "title": "Séquenceur MIDI en NodeJS sur Raspberry PI",
    "description": "Je souhaite proposer de partager mon expérience sur la création d'un projet libre : \n\nUn séquenceur MIDI, développé en NodeJS sur Raspberry PI.\n\nIl s'agit donc d'un outil permettant de créer de la musique en live, très souple, et développé par mes soins afin de pouvoir customiser toutes les fonctionnalités en fonction de mes envies de création en live.\n\nTravaillant principalement sur Atari ST et Gameboy, il s'agit principalement de musique \"programmée\" à l'avance, avec peu de jeu \"live\".\nJ'ai créé cet outil pour travailler différemment, en créant mes morceaux en live avec une souplesse illimitée et personnalisée.\n\nCe séquenceur sert donc de moteur de création musicale en direct, et pilote différents synthétiseurs via le protocole MIDI, le tout contrôlé... en MIDI !\nAyant de fortes affinités avec le matériel vintage, je pilote un Atari ST, une nintendo NES, entre autres vieilles machines aux sons rappelant nos premiers jeux vidéos bien pixelisés.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Advanced",
    "speakers": [
        105
    ]
  },
  "108": {
    "id": 108,
    "title": "Passez vos tests end-to-end en vitesse lumière avec Cypress",
    "description": "Sorti en beta en octobre dernier, Cypress connait déjà un grand succès dans le domaine du test End-To-End (E2E) jusqu’alors dominé par Selenium. Développé depuis 2015, l’équipe en charge du développement de Cypress prend un soin particulier à l’expérience développeur (DX).\n\nDans cette conférence, nous verrons brièvement ce qui caractérise Cypress de Selenium et nous ferons un live-coding qui nous permettra de passer en revue les principales fonctionnalités ainsi que les compromis à prendre en compte.\n\nA l’issue de cette présentation, faire des tests E2E ne sera plus une souffrance !\n",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Beginner",
    "speakers": [
        106
    ]
  },
  "109": {
    "id": 109,
    "title": "Le storytelling et la fiction pour imaginer de nouveaux lendemains",
    "description": "En tant qu’équipe, start-up, organisation ou collectivité, nous cherchons à imaginer à quoi pourrait ressembler notre futur dans 6 mois, 1 an, 5 ans, etc.\nMais souvent, cet exercice est complexe et le résultat est difficile à communiquer… Grâce à des approches de storytelling (narration) et de fiction, nous verrons comment imaginer ces nouveaux lendemains, les communiquer à nos parties prenantes pour les embarquer et ensuite, on l'espère, faire que ces lendemains rêvés se réalisent.  \nEt bien sûr, on s'inspire de pleins de films de science fiction pour faire ça...",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Graslin"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        107
    ]
  },
  "110": {
    "id": 110,
    "title": "Il développe une solution SaaS sans se soucier de la sécurité … et ça tourne mal",
    "description": "Suite à une idée totalement disruptive de son boss, notre Product Owner a pour mission de mettre sur le marché LA nouvelle solution SaaS dans des délais inaccessibles au commun des mortels. Dans cet empressement, notre héros prendra-t-il en compte la dimension sécurité nécessaire pour ce genre d'application web ? \n\nSon voisin de gauche, spécialiste en cybersécurité et néanmoins collègue lui donnera-t-il les outils clés à la sécurisation de sa solution ?\n\nAdaptera-t-il au sein de ses cycles de développement les bonnes pratiques sécurité à suivre pour des applications aussi populaire ?\n\nSaura-t-il imposer à ses équipes une hygiène sécurité irréprochable ?\n\nSi vous pensez que notre Product Owner est foutu, venez assister à ses péripéties jusqu'à la mise en prod !!!\n\nPS : Et si vous n'avez pas de voisin de gauche, on vous donnera quand même quelques clés pour la sécurité de vos applis.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "other",
    "language": "fr",
    "tags": [
        "🐱‍💻 SECURITY"
    ],
    "complexity": "Intermediate",
    "speakers": [
        108,
        109
    ]
  },
  "111": {
    "id": 111,
    "title": "Kotlin Coroutines",
    "description": "The async/await feature allows you to write the asynchronous code in a straightforward way, without a long list of callbacks. Used in C# for quite a while already, it has proven to be extremely useful. In Kotlin you have async and await as library functions implemented using coroutines.\n\nA coroutine is a light-weight thread that can be suspended and resumed later. Very precise definition, but might be confusing at first. What 'light-weight thread' means? How does suspension work? This talk uncovers the magic. We'll discuss the concept of coroutines, the power of async/await, and how you can benefit from defining your asynchronous computations using suspend function\n",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "cloud",
    "language": "en",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        103
    ]
  },
  "112": {
    "id": 112,
    "title": "Creating a geolocation app powered by Firebase",
    "description": "Location-based services apps are everywhere and probably you have installed dozens of them on your phone. Have you ever thought about creating a geolocation app? Or even integrate geolocation features into your existing project?\nIn this talk, I will demonstrate how to combine Google Maps API, Angular, and Firebase to build a fast and scalable geolocation app.\n\nThese location-based related features can benefit you as an entrepreneur who wants to launch an application with such capabilities as well as help developers to improve the user experience bringing peculiar and innovative ways for the users to interact with the apps they are working on.\n\nIn a nutshell, it'll cover:\n🗺️ All you need to know about Map Integration\n🛣️ Calculate distance and duration between locations\n🎈 Obtaining current location of a user and offering nearby options\n📍 Displaying marks with custom information\n🔒 Authentication with different providers\n🔥 Firestore to keep the data in sync \n🖼️ Cloud Storage for the built-in gallery section\n🌈 Cloud Functions for advanced techniques including image thumbnails and sub-collections removal\n🌩️ Cloud Messaging to send push notifications\n🌟 And of course, Firebase Hosting which provides a fast and secure web hosting",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        110
    ]
  },
  "113": {
    "id": 113,
    "title": "La puissance des pseudo-éléments",
    "description": "Encore en 2018 il n'est pas rare de rencontrer des soupes de \"div\" et \"span\" pour la création d'**éléments visuels en CSS**, ou pour créer des séparateurs ou encore casser le rythme d'une grille, etc.\n\nL'utilisation des pseudo-éléments permet de faire **passer son code à un niveau supérieur** sans pour autant demander un effort surhumain d'appréhension.\n\nUn peu de théorique, beaucoup d'exemples et de la pratique permettront de rendre leur utilisation concrète et abordable. Vous verrez ensuite que vous ne pourrez plus vous en passer !\n",
    "type": "💻 Codelab",
    "track": {
        "title": "Hangar"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        111
    ]
  },
  "114": {
    "id": 114,
    "title": "Ghost in the Machine",
    "description": "In this session, we'll bridge the real and the virtual. We'll first explore how to build a simple Android Things powered robot. This simple robot car uses both off-the-shelf and 3d printed parts.\n\nThen we'll close by building a simple Augmented-Reality remote control app. We'll be using Google's ARCore and Sceneform libraries.\n\nSome familiarity with Kotlin and OpenGL is helpful, but not required.\n",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        112
    ]
  },
  "115": {
    "id": 115,
    "title": "Highway to Elm!",
    "description": "Entre les problèmes de `null` et d'`undefined`, les cas d'erreur non traités, les régressions dans les dépendances npm et les refactoring hasardeux, il est compliqué de livrer sereinement du JavaScript en production !\n\nC'est un mal nécessaire, puisqu'il s'agit du seul langage compatible avec tous les navigateurs, non ? **Non !**\n\nJe vous propose de découvrir une alternative, Elm, dont la première promesse est troublante mais limpide : **plus d'erreurs au runtime !**\n\nNous verrons comment ce langage spécialement pensé pour créer des applications web garantit des mises en production sereines, loin de tous ces soucis que posent les applications JavaScript.",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        113
    ]
  },
  "116": {
    "id": 116,
    "title": "Hackers against natural disasters",
    "description": "Talk sur les enjeux et les solutions des problèmes de communication en cas de catastrophes naturelles.",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        179
    ]
  },
  "117": {
    "id": 117,
    "title": "Neuro Game Experience : Votre pensée prend le contrôle !",
    "description": "Onepoint, le CHU de Nantes et l’école centrale vous invitent à une démonstration vidéo-ludique mêlant neurosciences, intelligence artificielle et réalité virtuelle : \n\n# Piloter son avatar 3D... par la pensée !\n\nCette présentation vous fera découvrir des cas d'application concrets des technologies BCI (Brain to Computer Interface), Machine Learning, développement 3D, IoT... et un peu de Matlab.\n\nTout cela est au service de la recherche médicale, mais vous pourrez aussi commencer à fantasmer sur les thèmes passionnants abordés par la science-fiction : \n- Avatar... le film, en vrai… c'est possible ? \n- Matrix… on y va tout droit ?\n- L'humain augmenté d'Elon Musk… c'est pour quand ?\n",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        114,
        115
    ]
  },
  "118": {
    "id": 118,
    "title": "Optimize App Downloads with Android App Bundle and Dynamic Delivery",
    "description": "An Android App Bundle is a new upload format that includes all your app’s compiled code and resources, but defers APK generation and signing to Google Play.\n\nGoogle Play’s new app serving model, called Dynamic Delivery, then uses your app bundle to generate and serve optimized APKs for each user’s device configuration, so they download only the code and resources they need to run your app. You no longer have to build, sign, and manage multiple APKs to support different devices, and users get smaller, more optimized downloads. Additionally, you can add dynamic feature modules to your app project and include them in your app bundle.\n\nIn this talk, we discuss how to configure your app to build app bundles and make the most out of Dynamic Delivery; use the Play Console to inspect and manage your app bundle; test your app bundle locally using bundletool and integrate these tests into you CI builds; and use the Play Core Library API to request, monitor, and manage on demand downloads.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        116
    ]
  },
  "119": {
    "id": 119,
    "title": "Istio, we have a problem! Understanding and fixing bugs with a service-mesh",
    "description": "Istio, we have a problem! We've just deployed a shinny new set of micro-services and it behaves in a strange manner. Hard to say why with so many moving parts...\n\nLet's leverage the newly installed service mesh to understand what we've deployed, find the root problem, fix it with a bandaid and then do a proper, non trivial, blue-green deployment of a v2.\n\nThat will involve the Service Graph, Prometheus monitoring, Grafana Dashboards, Traffic mirroring, all orchestrated in a simple manner by Istio.",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "cloud",
    "language": "en",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Intermediate",
    "speakers": [
        117
    ]
  },
  "120": {
    "id": 120,
    "title": "Concourse : CI/CD version 2020 !",
    "description": "Comme on dit souvent : il n'y a pas que ... Et cette fois-ci c'est Jenkins. De sérieuses alternatives existent avec des approches réellement innovantes.  D'abord pensé pour les **pipelines**, et nativement bâti sur **Docker**, Concourse fait parti des outils de **CI/CD** de nouvelle génération.\n\nVenez découvrir Concourse, développé par **Pivotal** et utilisé pour tous leurs pipelines. Après plusieurs mois d'utilisation, je souhaite vous faire partager les idées et concepts de Concourse, puis place à la pratique pour vous montrer quelques idiomes/patterns (et ainsi éviter les premiers pièges !).\n\n_Bonus : Découvrez comment installer un environnement de test en quelques secondes !_",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Intermediate",
    "speakers": [
        118
    ]
  },
  "121": {
    "id": 121,
    "title": "Enlarge your team !",
    "description": "Passer de 1 à 10. Ou de 10 à 30. C’est le rêve de beaucoup d’entrepreneurs, mais qui n’est pas sans difficultés. Les petits problèmes du départ peuvent rapidement devenir des monstres à gérer si on ne s’est pas préparés. Parce que la taille compte, voici un retour sur les erreurs que j’ai pu commettre, et des choses qui ont bien fonctionné.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Titan"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        119
    ]
  },
  "122": {
    "id": 122,
    "title": "La conquête de l'espace se déroule dans votre poche",
    "description": "Et si je vous disais que pour partir dans l'espace vous n'avez pas besoin de passer par la NASA ?\n\nVenez embarquer dans un talk qui vous fera traverser un champ d'astéroïdes, conquérir Mars, et même peut-être trouver des aliens...\n\nVotre navette ? Un smartphone.\nVotre fusée ? Un bout de carton et deux lentilles.\nVotre départ ? Immédiat !",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Beginner",
    "speakers": [
        120
    ]
  },
  "123": {
    "id": 123,
    "title": "Kubeflow : Tensorflow on Kubernetes",
    "description": "L’intelligence artificielle est en train de révolutionner tous les domaines : médecine, pharmacie, automobile, même l’informatique en lui-même. Mais la multitude d’outils mis à disposition des développeurs rend la portabilité et l’entrainement de modèle compliqué, non répétable et non scalable.\nDurant ce talk, nous verrons comment déployer Kubeflow, un projet tirant partie de la puissance de Kubernetes afin d’entrainer des modèles de Machine Learning basé sur Tensorflow. Nous verrons aussi comment grâce aux GPU et Kubernetes, nous pouvons accélérer la phase d’apprentissage de chaque modèle. Enfin, nous verrons comment entrainer un modèle de machine learning simplement grâce à JupyterHub.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Intermediate",
    "speakers": [
        121
    ]
  },
  "124": {
    "id": 124,
    "title": "Comment perdre sa surchage featurale ?",
    "description": "Le cycle de vie d'une application est un chemin nébuleux et plein de dangers. La complexité ne fait que croitre durant les mois et les années d'utilisation. L'un des plus gros challenges d'un développeur est de pouvoir la contrôler tout en ajoutant de nouvelles fonctionnalités (features).\n\nDes solutions existent : le ré-écriture de code ou encore la maitrise de la dette technique. En effet, ces deux actions permettent de lever \"la complexité accidentelle\". Mais que faisons nous de la \"complexité essentielle\" ? La complexité qui n'est pas liée au code.\n\nLa seule solution : Supprimer des fonctionnalités ! Ce talk vous expliquera comment perdre la surcharge featurale de vos applications en comprenant la différence entre la complexité essentielle et la complexité accidentelle, mais aussi en vous donnant des clés pour mener à bien ce changement dans vos équipes projet.",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💚 UX / UI"
    ],
    "complexity": "Beginner",
    "speakers": [
        122
    ]
  },
  "125": {
    "id": 125,
    "title": "Stargate : Téléportez vous sur Mars (avec votre smartphone) !",
    "description": "# Passez la porte des étoiles avec AR Core !\n\nLa réalité augmentée est arrivée depuis quelques temps sur nos smartphones… Le jeu \"Pokemon Go\" a connu un grand succès populaire, mais ce n'était que les prémices de cette révolution qui sera bientôt accessible au grand public. En effet, avec les nouveaux SDK \"AR Core\" et \"AR Kit\", les progrès sont fulgurants et commencent même à faire de l'ombre aux terminaux dédiés comme le célèbre Hololens (et bientôt le très attendu Magic Leap).\n\nVenez donc découvrir comment utiliser le SDK Google AR Core, Unity 3D  et une vidéo 360° pour vous téléporter vers la destination de votre choix (Mars, La lune, station spaciale, …) avec simplement votre smartphone (Android).\n\nVous repartirez ainsi avec votre \"porte spacio-temporelle\" et pourrez la partager à tou(te)s vos ami(e)s terriens !\n\nLes prérequis :\n* PC \n    * Windows 10\n    * Unity3D version récente (2017)\n* Smartphone :\n    * Terminal compatible avec ARCore : https://developers.google.com/ar/discover/supported-devices\n    * Android version 7+, en mode développeur, avec accès au Play Store\n    * Câble USB pour connexion PC - Smartphone\n\nNB: Avoir déjà déployé soi-même une App sur son smartphone Android est conseillé.\n\n",
    "type": "💻 Codelab",
    "track": {
        "title": "Hangar"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Beginner",
    "speakers": [
        114,
        115
    ]
  },
  "126": {
    "id": 126,
    "title": "Un joli template ne rendra pas votre produit utilisable",
    "description": "Vous avez trouvé un template Bootstrap Angular React Material Design 4.0 qui *“fait le job”*, et vous vous dites *“pas besoin d’un designer”*. Vous lancez votre produit, et là surprise : les utilisateurs n’y comprennent rien. Comment est-ce possible ? Vous avez pourtant de jolis boutons Material Design et les couleurs ne piquent pas les yeux, c’est à ne rien y comprendre ! \n\nMais le design, c’est plus que des jolis boutons. Travailler avec des templates est possible, mais **pas sans une réflexion en amont sur les besoins, les parcours et une solide architecture d’information**. Nous ne sommes pas des machines ! Au travers d’exemples de projets réussis et d’échecs, je souhaite montrer **comment remettre l’utilisateur au cœur de nos projet et produits tout en utilisant efficacement votre framework ou template préféré.**\n",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💚 UX / UI"
    ],
    "complexity": "Intermediate",
    "speakers": [
        123
    ]
  },
  "127": {
    "id": 127,
    "title": "Redécouvrir l’univers connu avec des dataset de la NASA",
    "description": "Cela fait des années que l’humanité explore le ciel, rêvant de voyages intersidérales et de nouvelles colonies planétaires. Et toi, as-tu envie de partir 3h avec nous à la découverte de l'univers ?\n\nIl se trouve que la NASA possède un formidable jeu de données publiques, notamment celui qui est utilisé pour la recherche d’exoplanètes, c’est-à-dire de planètes situées en dehors de notre système solaire.\n\nNous vous guiderons, au cours de ce Hands-on, dans les différentes étapes permettant de redécouvrir des exoplanètes en utilisant Warp10, une plateforme open-source de traitement de séries temporelles.\n",
    "type": "💻 Codelab",
    "track": {
        "title": "Hangar"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Beginner",
    "speakers": [
        124,
        125,
        126
    ]
  },
  "128": {
    "id": 128,
    "title": "Hello from the other side",
    "description": "Getting code into production can have consequences beyond just making your customers happy.  It can wake people up in the middle of the night, bring down the datastores, be a cost nightmare, and remind you ‘imposter syndrome’ is a real thing. \nMore importantly, it can break trust , create frustrations, and burn people out. \n\nSo what happens when a full-stack engineer joins an operational team and goes to war with operational risks? Are there more skills to be gained besides cool war stories and scars after each incident?\n\nIn this talk we will explore the benefits of spending time on a team with a completely different profile than your prior experience. And how front-end, back-end and operational teams have more in common than you might think\nWe’ll go through what an operational readiness checklist is, and why it’s important, and how to gain more visibility into the impact of the chance you’ve just deployed. ",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "discovery",
    "language": "en",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Beginner",
    "speakers": [
        180
    ]
  },
  "129": {
    "id": 129,
    "title": "Kotlin : Le back du futur, le codelab",
    "description": "Depuis l’annonce par Google du support de Kotlin sur Android, les développeurs d'applications mobiles se sont fortement intéressés à ce langage récent. Mais \"**Nom de Zeus !**\" est-ce réservé aux développeurs mobiles ? Non, Non et Non. Kotlin tourne sur la JVM alors autant en profiter dans tous nos projets.\n\nViens nous rejoindre pour découvrir toutes les facettes de ton futur prochain langage préféré. À travers plusieurs exercices, tu apprendras à transformer ton vieux Java en Kotlin puis à penser directement en Kotlin pour plus de \"**fun**\" et moins de \"**void**\".\n\nPas encore persuadé que ce codelab est fait pour toi ? Regarde ces avis de développeurs déjà convaincus :\n\n    \"Java ? Là où on va, on n’a pas besoin de Java !\"\n  Un développeur backend à propos de son prochain projet en Kotlin.\n\n    Faut voir grand dans la vie, quitte à coder sur la JVM, autant choisir un language qui ait d’la gueule !\"\nUn autre développeur backend après la conférence Kotlin : Le back du futur.\n\n\n**Doc Gautier et Adrien Mc Fly**",
    "type": "💻 Codelab",
    "track": {
        "title": "Les Machines"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        127,
        128
    ]
  },
  "130": {
    "id": 130,
    "title": "What Can We Learn With JavaScript Fatigue?",
    "description": "By the time I’m writing this abstract NPM has 568,191packages. Tomorrow an average of 447 new ones will be published. In this talk, I will not complain about it. Instead, we will study this phenomenon in depth and see what can we learn from JS Fatigue and how to deal with it without headaches.\n\nThe whole reason for JS Fatigue is not the huge amount of modules we’ve got available, the real issue is the mindset we have when writing code. With an average of 447 new packages a day and lots of new technologies appearing it seems impossible to keep up with the insane velocity things happen in the JavaScript ecosystem, but actually you don’t necessarily need to.\n\nIn this talk, I won’t talk about the language itself and I won’t talk about frameworks. I will talk about what how this ended up happening and why we should see it as a positive thing from a software engineering point of view. For a very long time we have been talking about componentization and reusability and now that we’ve got it we started complaining about it, how did that happen?\n\nWe will talk about Unix Philosophy, about the current state of open source software development and about our role as software engineers, after all, we’re not paid to write code, we are paid to solve problems.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Beginner",
    "speakers": [
        129
    ]
  },
  "131": {
    "id": 131,
    "title": "Machine Learning & JS : Take your PWA to the next level",
    "description": "Machine learning is no longer just for snake charmers (pythonista) or those with access to powerful computational resources. As part of the PAIR project, the Google Brain team released last year the deeplearn.js library which has since evolved into TensorFlow.js. Tensorflow.js takes advantage of WebGL to allow among other things to build and train neural networks in the browser from scratch or using techniques such as transfer learning.\n\nAlso a recent release of Tensorflow backend for Tensorflow.js now allows you to fully take advantage of the hardware (GPU, TPU, CPU ) directly on the server side via Node.js.\n\nI will explain you during this talk, based on my own experience, how I took my progressive web app to the next level using machine learning as well as the possibilities available to implement machine learning into your browser.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        130
    ]
  },
  "132": {
    "id": 132,
    "title": "Les nouveautés \"serverless\" de Google Cloud",
    "description": "Des millions de personnes échangent des selfies sur Snapchat ou jouent à Super Mario Run tous les jours. Savez-vous où ces applications tournent ? C'est le vénérable Google App Engine et l'infrastructure de Google Cloud qui permettent aux développeurs de se focaliser sur leur code et de laisser le soin de scaler l'application à Google. \n\nQue vous déployiez des applications avec App Engine, ou des fonctions avec Cloud Functions, vous ne vous souciez plus de serveurs ou de clusters à provisionner et vous payez proportionnellement à l'utilisation, sans coûts fixes. \n\nDans cette session, découvrons ensemble ce qu'il y a sous le capot, et surtout les nouveautés \"serverless\" de Google au delà d'App Engine et Cloud Functions.",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Beginner",
    "speakers": [
        131
    ]
  },
  "133": {
    "id": 133,
    "title": "Event loop et asynchronisme en JavaScript",
    "description": "Sans utilisation des web workers, JavaScript est un langage monothread, qui offre cependant la possibilité d'exécuter du code de manière asynchrone.\n\nA travers une exploration du fonctionnement de la stack, de la queue et de l'event loop, ce quickie sera l'occasion de comprendre les limitations de cette gestion l'asyncrhonisme en JS.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Intermediate",
    "speakers": [
        132
    ]
  },
  "134": {
    "id": 134,
    "title": "La \"process communication\" ou comment faire rentrer les gens dans des cases pour mieux communiquer avec eux",
    "description": "La Process communication propose des outils pour expliciter les problèmes de communication et pour les résoudre . Elle est utilisée par les psychologues de la NASA afin de s'assurer de la meilleure collaboration possible entre les astronautes pendant leurs missions. \n\nBon dans l'IT, d'accord, on ne risque pas de faire exploser une fusée lors de soucis de communication avec nos collègues. Pourtant la communication, tout le monde sait que c'est un facteur important à la réussite d'un projet, à la bonne ambiance dans une équipe, ou simplement dans nos échanges avec nos proches. Pour autant parfois malgré toute nos bonnes intentions, des situations conflictuelles naissent, et peuvent nous affecter. \n\nJe vous partagerai durant ce quickie les 6 types de personnalités décrites dans la Process Communication. A chaque type de personnalité correspondent : des caractéristiques comportementales, un mode de percevoir le monde, des besoins psychologiques, un « canal » de communication privilégié.\n\nA la fin de ce quicky, vous en saurez plus sur vous même mais aussi vous serez capable d'identifier et de mieux comprendre les profils de votre manager, vos collègues, vos proches. Et surtout vous verrez comment communiquer avec eux pour vivre dans un monde doux, paisible et merveilleux avec plein de bisounours ! _(j'ai bien dis bisounours, pas des toupoutous à la Alain Chabat  ;).)_\n",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Belem"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        133
    ]
  },
  "135": {
    "id": 135,
    "title": "Serveur d'intégration mobile gitlab ci avec Fastlane",
    "description": "Pour ce talk version courte, je présente notre serveur d'intégration d'application mobile.\n\nLa création et la diffusion d'une application mobile sont des tâches répétitives et fastidieuses, mais il est possible de les automatiser. Le but est de gagner en rapidité de livraison, et d'améliorer la qualité de l'application.\n\nNous utilisons gitlab-ci et Fastlane pour compiler l'application, déployer une version beta, lancer des tests unitaire et générer un rapport avec screenshots automatique de chaque écrans, sur plusieurs devices et dans  plusieurs langues. Cela permet rapidement de contrôler le rendu de l'application sur plusieurs tailles d'écrans.\n\n\n\n",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Belem"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Beginner",
    "speakers": [
        134
    ]
  },
  "136": {
    "id": 136,
    "title": "Machine Learning made simple with MLKit",
    "description": "Machine learning is becoming an important part of mobile development to help us provide a frictionless experience for our apps users. However at the same time it can be a pretty complex subject to tackle. Luckily for us though, Firebase MlKit is now available for us to ease this implementation into our apps.\n\nIn this talk I want to introduce you to Firebase MlKit and how you can integrate it into your production apps. We'll look at how we can perform face recognition, image labelling, text recognition and several more commonly used mobile use cases. Firebase makes it so easy that you'll walk away with the confidence in being able to provide these experiences to your users in no time! \n",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "cloud",
    "language": "en",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Beginner",
    "speakers": [
        135
    ]
  },
  "137": {
    "id": 137,
    "title": "Automate your whole iOS Projects (& share resources with Android)",
    "description": "During the life of a project, there are a LOT of tasks quite repetitive and time-consuming. But not all people know how much those steps can all be automated!\n\nWith this session you'll have an overview of which tools and techniques can be useful to automate various steps of the lifetime of your project, including :\n - the creation and configuration of your Xcode project, its build settings and build phases\n - its initial structure to be ready for the architecture of your choice\n - the configuration of Fabric & Crashlytics & 3rd party libraries\n - internationalising & localising your strings and sharing them with the counterpart Android project\n - maintaining constants for all your resources\n - generating your database model, and sharing with the counterpart Android project\n - generating repetitive code\n - doing Code Reviews & commenting on common mistakes on Pull Requests\n - running your tests\n - automating AppStore submission (binary & metadata automation)\n",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        136
    ]
  },
  "138": {
    "id": 138,
    "title": "The postmodern API: gRPC on Android.",
    "description": "\nMost of mobile apps today need communicating with a server. And most of them rely on REST APIs to do so, putting aside how it’s implemented or whether it respects the REST Architecture or not. In a context of distributed and autonomous back end teams, adopting micro-services as an architectural approach, many developers have been arguing about the efficiency of loosely typed interfaces of REST. \n\nSince 2015 when Google open sourced gRPC many of them have been using it alongside Protocol Buffers as message format instead of REST and JSON. \nBut not all of the front end developers followed through, which made backend developers duplicate efforts to add specific endpoints in REST.\n\nIn this talk we will see how Android Developers can make faster server calls, while saving battery life and data usage, by creating a gRPC client for Android.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        137
    ]
  },
  "139": {
    "id": 139,
    "title": "What's up TC39 ?",
    "description": "Il y a aujourd'hui plus de 30 propositions dans le backlog du TC39. Que nous réserve le futur ? Si vous n'avez pas envie d'aller vous perdre dans les compte-rendus de réunion du comité, je vous raconterai où nous en sommes aujourd'hui et à quoi ressemblera le Javascript de demain.",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        138
    ]
  },
  "140": {
    "id": 140,
    "title": "L'infrastructure as code avec Terraform",
    "description": "Terraform est devenu un outil incontournable pour gérer son infrastructure cloud avec sa capacité à gérer différents fournisseurs (AWS, GCP, Azure, …) à travers un langage unique : Hashicop Configuration Language. Celui-ci permet la création d’abstractions qui permettent une gestion scalable de son code d’infrastructure. Nous commencerons par présenter le fonctionnement de Terraform (le langage, les commandes de déploiement, les modules …) puis nous enchaînerons sur une session de live coding.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Intermediate",
    "speakers": [
        139
    ]
  },
  "141": {
    "id": 141,
    "title": "Vanilla JS 2018",
    "description": "Imaginez une application Web qui utiliserait toutes les nouvelles APIs des navigateurs en même temps. Ce n'est peut être pas le projet le plus raisonnable pour un besoin client mais pour de la veille, c'est passionnant ! Je vous propose un retour sur cette expérience un peu hors du commun.\n\nOn a tous vu une conf ou lu un article sur une nouvelle fonctionnalité des navigateurs mais ce n'est pas toujours évident de se faire une idée quant à la question : \"ok mais globalement, vers où on va ?\"\n\nJ'ai donc lancé un projet bac à sable nommé Vanilla JS 2018. Il a des règles strictes (sinon on s'ennuie !) :\n- Interdiction totale de l'utilisation de code source externe au projet\n- ‎Volonté d'utiliser autant de nouvelles normes que possible. Quelque soit les univers : HTTP, HTML, DOM, JS, CSS.\n- ‎Tout est autorisé du moment que ce soit une norme non propriétaire et que cela fonctionne dans au moins 2 navigateurs (flags autorisés).\n\nNous parlerons d'un bon nombre de sujets :\n- HTTP/2\n- Web Components\n- Virtual Dom\n- State Management\n- Web Workers\n- Service Workers\n- CSS Grid\n\nJe vous propose de vous présenter les résultats d'un \"fun project\" qui, pour moi, a sûrement été le plus intéressant et enrichissant depuis longtemps si ce n'est depuis toujours.",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        140
    ]
  },
  "142": {
    "id": 142,
    "title": "Venez coder votre 1ère application Flutter !",
    "description": "Flutter est un SDK open-source pour créer des application iOS et Android performantes et adaptées à l’OS. ‘Un peu comme React Native ou Xamarin ?’ vous pourriez vous demander ? Oui, un peu… mais avec une intégration avec les widgets natifs et des niveaux de performance qui vont au delà de ce que Xamarin ou React Native peuvent proposer, le tout avec très peu de lignes de code.\n\nDans ce bootcamp nous allons faire une introduction pratique à Flutter. Et lorsque je dis pratique, c’est du pratique, vous allez coder… Vous arrivez à la séance équipés d’un ordinateur portable, avec Android Studio ou VS Code et vous partez à la fin en ayant développé une petite application Flutter tournant sur Android et iOS, et plus important encore, en ayant intégré les principes basiques du développement sur cette plate-forme.\n\nLe Bootcamp Flutter est donc une introduction accélérée et pratique au développement d’applications mobiles avec Flutter. Vous allez apprendre, mettre les mains dans le cambouis, coder et vous allez enfin cocher la case \"Apprendre à coder des applications mobiles\" dans votre ToDo-list.",
    "type": "💻 Codelab",
    "track": {
        "title": "Les Machines"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Beginner",
    "speakers": [
        141,
        126
    ]
  },
  "143": {
    "id": 143,
    "title": "Rémunération Poker",
    "description": "Le retour d'expérience d'une pratique collaborative destinée à répartir les augmentations de salaires au sein d'une entreprise.\nComment faisions-nous auparavant ? Quelles problématiques cela me/nous posaient ?\nComment cette pratique est venue à nous ? Et le déroulé de notre première session \"rémunération poker\" !",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Graslin"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        142
    ]
  },
  "144": {
    "id": 144,
    "title": "The next big thing in (client side) templating",
    "description": "In this talk we will talk about the evolution of client-side templating, and where the platform is taking us next. \nMaybe you thought ES6 template literals were just multi-line strings - but they are so much more. Your browser now has a native way of handling templating, that is both scalable and extensible - and really performant. \nWe will take the time to dive into the individual parts and understand how combining the template element with template literals might be the next big thing in templating. \nFinally I will share my thoughts on how and why, combining this with webcomponents, could be the future of frameworks. ",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        143
    ]
  },
  "145": {
    "id": 145,
    "title": "Mise en place d'une plateforme centralisée de gestion des logs avec la suite elastic",
    "description": "La suite elastic (Elasticsearch, Logstash, Kibana, Beats, ...) est connue et reconnue lorsque nous désirons mettre en place soit une solution de recherche sur notre site d'e-commerce ou encore une plateforme centralisée de gestion des logs.\n\nSi vous n'avez jamais eu l'occasion de jouer avec ou de la mettre en place dans votre entreprise, ce codelab est pour vous. Nous allons mettre place, en partant from scratch, une plateforme complète de gestion des logs de vos applications et de vos serveurs : de la récupération des logs, à sa visualisation en passant par sa transformation et son indexation...\n\nNous en profiterons également pour aborder des produits moins connus comme X-PACK, Elastic APM ou encore Elastic Cloud.",
    "type": "💻 Codelab",
    "track": {
        "title": "Les Machines"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Intermediate",
    "speakers": [
        144,
        145
    ]
  },
  "146": {
    "id": 146,
    "title": "Testing Out Kotlin",
    "description": "Learn how to use Kotlin through a deep dive into writing tests. Kotlin is a high-level language that is fully integrated with both the Java programming language and Android Studio. It is used for Android development in many popular apps. Testing is a great way to learn Kotlin, write readable tests, and introduce your development team to the power of Kotlin.",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        146
    ]
  },
  "147": {
    "id": 147,
    "title": "It’s just like JavaScript… except where it isn’t",
    "description": "Vous êtes convaincus des avantages de TypeScript ou Flow, mais vous êtes frustrés de leurs limites ? Ce codelab est fait pour vous !\n\nReasonML est un dialecte de OCaml, crée par Jordan Walke (le créateur de React), développé par une petite équipe chez Facebook et une communauté enthousiaste. Le but est de faciliter l'accès au système de type avancé et à l'expressivité de OCaml en lui donnant une syntaxe proche de JavaScript, une toolchain commune et une interopérabilité trivialement simple.\n\nSi ReasonML vous permet aussi de compiler vers du code natif, ce codelab sera centré autour de la compilation vers JavaScript pour le développement frontend. Venez préparés ! Suivez les instructions d'installation de la plateforme et du support de votre IDE préféré sur https://reasonml.github.io/",
    "type": "💻 Codelab",
    "track": {
        "title": "Hangar"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Intermediate",
    "speakers": [
        147,
        148
    ]
  },
  "148": {
    "id": 148,
    "title": "Game of code challenge",
    "description": "Venez participer à ce challenge de conception d’intelligence artificielle.\n\nLes règles sont simples :\n\nune bataille de personnages médiévaux en un contre un\n\nune API REST d’attaque à disposition\n\nune application web de visualisation du combat en live\n\nVous n’avez plus qu’à coder votre IA avec votre langage préféré, réagir en conséquence et affronter l’IA du serveur ou d’autres participants de ce lab.\n\nDes starter kits seront à disposition (Node.js, php, Java), la plateforme sera ouverte 2 semaines avant la conférence.\n\nTournoi avec des lots à gagner à la fin de la session.\n\n",
    "type": "💻 Codelab",
    "track": {
        "title": "Les Machines"
    },
    "category": "other",
    "language": "fr",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        149,
        150
    ]
  },
  "149": {
    "id": 149,
    "title": "SSR, SPAs and PWAs",
    "description": "This talk has all the acronyms! It offers a deep dive into Server Side Rendering (SSR) in times of SPAs and PWAs. We will look at how pre-rendering JS applications server-side does not only improve perceived startup times but enables advanced techniques like incremental startup on the client and even progressive enhancement (yes, really!).",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        151
    ]
  },
  "150": {
    "id": 150,
    "title": "Fast and Beautiful: Modern Image Delivery Techniques",
    "description": "The average website page weight is 50% images and 25% video. As the images and videos delivered to mobile devices get larger and larger, the load time of websites gets slower and slower. Further complicating matters, there are thousands of screens and devices with varying resolutions and CPU power that receive this content. In this talk, we’ll examine strategies to send the perfect image or video to every device, ensuring a fast, beautiful rendering of your content. We’ll look at how to test our content, and describe responsive images, delivering progressive images, and finally optimizing all of this content for fast delivery to each screen. Attendees will walk away with a better understanding of how to efficiently deliver beautiful images to every device that accesses their content.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        152
    ]
  },
  "151": {
    "id": 151,
    "title": "Détectez et trackez les aliens qui se cachent dans vos dépendances",
    "description": "[44% des applications contiennent des vulnérabilités critiques dans les librairies open-source qu'elles utilisent](https://www.veracode.com/products/software-composition-analysis) et cela bien que des bonnes pratiques comme OWASP Top 10 se soient généralisées. \n\nNe laissez plus ces aliens incuber bien au chaud dans le ventre de votre appli! \nGrâce à ce talk, vous apprendrez comment sont répertoriées ces vilaines bestioles (NVD, CVE) et comment est évaluée leur dangerosité (CVSS).\n\nPuis vous verrez comment créer votre première pipeline de Continuous Security dans Jenkins au moyen de [OWASP DependencyCheck](https://www.owasp.org/index.php/OWASP_Dependency_Check)  qui détecte les vulnérabilités et trackez les grâce à [OWASP DependencyTrack](https://www.owasp.org/index.php/OWASP_Dependency_Track_Project) (logiciels open-source) \n \nFaites le premier pas vers le DevSecOps !!!\n\nNote:  OWASP DependencyCheck est capable d'analyser des logiciels Java, .Net et de manière plus expérimentale, Ruby, Node.js et Python.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "web",
    "language": "fr",
    "tags": [
        "🐱‍💻 SECURITY"
    ],
    "complexity": "Beginner",
    "speakers": [
        153
    ]
  },
  "152": {
    "id": 152,
    "title": "Typographie et accessibilité",
    "description": "**Comment la typographie web peut-elle améliorer l’accessibilité d’une interface ?** Puisque le contenu est roi, penchons-nous sur le design du texte à l’écran, et sur sa capacité à améliorer l’expérience utilisateur des personnes en situation de handicap visuel et/ou cognitif.\n\nTaille, couleur, espacement et alignement des caractères ; longueurs des lignes ; polices de caractères adaptées ; personnalisation de l’interface par les utilisateurs ; aides à la lecture… Cette conférence vous permettra de **faire des choix typographiques éclairés en matière d’accessibilité**, et de créer ainsi des interfaces plus accessibles et plus inclusives.\n\nLa typographie étant une composante majeure du design graphique, cette présentation s’adresse en premier lieu aux designers UI. Mais la problématique de la typographie accessible concerne également les designers UX, les intégratrices et intégrateurs web, ainsi que toute personne amenée à contribuer à un projet web et s’intéressant au sujet.",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💚 UX / UI"
    ],
    "complexity": "Beginner",
    "speakers": [
        154
    ]
  },
  "153": {
    "id": 153,
    "title": "Android all the things!",
    "description": "Vous voulez faire votre propre système de maison connectée DIY, mais vous n’êtes pas capable de manier un fer à souder sans tout réduire en cendres ?\n\nJ’ai ce qu’il vous faut ! Tout ce dont vous aurez besoin est un Raspberry Pi, un tas de capteurs prêts à l’emploi et du code Kotlin (et un peu de Javascript). Je vais vous montrer comment j’ai créé mon système domotique à l’aide d’Android Things, Firebase, une app Android et Actions for Google, le tout sans rien enflammer involontairement. Je vais vous montrer comment j’ai utilisé Android Things pour collecter des données et l’utiliser avec un modèle TensorFlow pour essayer de prédire les tendances dans ma maison.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "mobile",
    "language": "fr",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Beginner",
    "speakers": [
        156
    ]
  },
  "154": {
    "id": 154,
    "title": "Shaping your app’s architecture with Kotlin and Architecture Components",
    "description": "Many apps began adopting Kotlin and Android Architecture Components atthe same time. While ostensibly quite different, the interplay of these two changes ends up heavily influencing each other.\n\nPlaid is an open source example of material design concepts. It has a complex functionality but had a large amount of technical debt. We took the challenge of refactoring the app, following the Android Guide to App Architecture, while simultaneously converting the app to Kotlin—while keeping the existing functionality, fixing broken API integrations and adding new ones.\n\nThe Guide to App Architecture provided a good starting point for creating lean, isolated classes. Kotlin features like delegates, high order functions and lambdas, sealed classes and others, end up shaping much of the architecture of the app. This talk covers the architecture lessons learned while converting Plaid to Kotlin and integrating Architecture Components.",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        102
    ]
  },
  "155": {
    "id": 155,
    "title": "Compassion-First Design pour l'intelligence artificielle",
    "description": "La croissance fulgurante de l’Intelligence artificielle nous offre un monde d’opportunités excitantes mais aussi effrayantes. Bientôt, nous interagirons avec la technologie au-delà de nos écrans. Tout objet deviendra espace de conversations. Ces nouveaux environnements permettront de nous immerger dans une réalité intuitive, momentanée et plus interconnectée que jamais. Cette réalité va transformer le métier de designers et soulèvent des défis importants: Comment allons-nous créer une expérience autour d’un moment de vie précis? Est-ce que le mot expérience sera toujours pertinent? Voici le secret: la compassion. Ne mettons pas l’Ai au centre du processus, voyons avec notre coeur. La compassion est le fondement essentiel du développement de l’interaction Humain-Intelligence artificielle. À travers la personnalisation contextuelle, la compassion permettra de passer d’expériences segmentées à la réalité hyperconnectée. \nDe nos défis, nous soulevons des questions de civilisation: si la compassion est apprise à des machines, cette vertu peut-elle être éveiller chez l’être humain? Si nous créons des machines émotionnellement intelligentes, pouvons-nous sauver l’humanité?",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💚 UX / UI"
    ],
    "complexity": "Beginner",
    "speakers": [
        157
    ]
  },
  "156": {
    "id": 156,
    "title": "Au pays des Gophers (à partir de 3 ans)",
    "description": "Au pays des Gophers, les Goroutines gambadent librement, et s’échangent des bisous et des bonbons grâce aux channels.\n\nLes méchants Locks sont tous deads (ou presque), et le Scheduler règne sur ce monde paisible qui ne connaît pas le nom des Processeurs.\n\nLa concurrence en Go expliquée à ma fille de 3 ans !",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Belem"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        158
    ]
  },
  "157": {
    "id": 157,
    "title": "Android Architecture & Architecture Components",
    "description": "Android developers, we propose you to come experiment the MVP & MVVM Android architectures! From a simple Android app, we will work on why and how to implement architectures principles. We will see how to go from MVP to MVVM with Android Architecture Components.\n\nAt the agenda: Kotlin, RxJava, Refactoring, Unit Tests, Android architecture components and Koin.\n\nWarm up your AndroidStudio!!!\n\nRequirements: AndroidStudio 3.0+ with Kotlin plugin\n\nKnowledge: RxJava, Kotlin",
    "type": "💻 Codelab",
    "track": {
        "title": "Les Machines"
    },
    "category": "mobile",
    "language": "en",
    "tags": [
        "📱 Mobile & IoT"
    ],
    "complexity": "Intermediate",
    "speakers": [
        102,
        159,
        160
    ]
  },
  "158": {
    "id": 158,
    "title": "Secret Management with Hashicorp's Vault",
    "description": "HashiCorp's Vault secures, stores, and  controls access to tokens, passwords, certificates, API keys, and other secrets . It handles leasing, key revocation, key rolling, and auditing.\n\nIn this talk I will give an overview of secret management in general, Vault's concepts, explain how to make use of Vault's extensive feature set, and demo which features we successfully use in a current projects.",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "cloud",
    "language": "en",
    "tags": [
        "🐱‍💻 SECURITY"
    ],
    "complexity": "Intermediate",
    "speakers": [
        161
    ]
  },
  "159": {
    "id": 159,
    "title": "Penser son infrastructure comme du code",
    "description": "Recette pour configurer **1** infrastructure : suivre **2** pages wiki, exécuter **3** scripts, lancer **4** commandes, corriger manuellement **5** paramètres, passer **6**h à débugger un élément non prévu, et jouer au jeu des **7** différences avec ce qui était attendu.\n\nLorsque nous exécutons plusieurs fois un programme nous nous attendons à ce que son comportement soit toujours le même. Pourquoi en serait il autrement pour nos infrastructures ?  \nIl est possible d’appliquer à l’infrastructure, les méthodes et outils qui nous aident à fiabiliser nos développements. Après tout l’infrastructure peut aussi être un code comme les autres.\n\nVenez découvrir ou redécouvrir l’**Infrastructure as Code** !",
    "type": "📣 Conference",
    "track": {
        "title": "Belem"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Beginner",
    "speakers": [
        162
    ]
  },
  "160": {
    "id": 160,
    "title": "Créer un datapipeline en 20 minutes avec Kafka Connect",
    "description": "Chez iAdvize, nous utilisons en production Apache Kafka et le framework Kafka Connect pour créer facilement des data pipelines temps réels, scalables et résilients. Nous verrons comment Kafka Connect peut devenir une solution efficace pour vos flux de données entrants ou sortants de Kafka. En 20 minutes, nous créerons ensemble un pipeline d'A-Z, basé sur un cas concret .",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Beginner",
    "speakers": [
        163
    ]
  },
  "161": {
    "id": 161,
    "title": "How do we use Vue.js in GitLab?",
    "description": "At GitLab, we use Vue.js more than 2 years and we are really happy with it.  In this talk, we will talk about the followings,\n\n- Why did we choose Vue.js?\n  - How did we decide to use Vue.js?\n  - Why not the others?\n- How did we add Vue.js to our stack?\n  - How was GitLab's Frontend stack before adding Vue?\n  - What were the problems we tackled?\n- How do we use Vue.js right now?\n  - Tips to use Vue with jQuery.\n  - Tips to use Vue in a legacy Rails app without refactoring everything\n\n",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        164
    ]
  },
  "162": {
    "id": 162,
    "title": "Où sont les femmes ?",
    "description": "Peut-être avez-vous constaté la faible proportion de femmes dans les conférences IT ?\nExaminons les raisons de cette situation et les initiatives créées pour essayer d'y remédier.\nSarah et Cécilia vous proposent de les découvrir et d'échanger avec vous pour tenter d'améliorer la diversité dans les conférences :)",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        178,
        182
    ]
  },
  "163": {
    "id": 163,
    "title": "Git Dammit!",
    "description": "\"T'as deux minutes ? J'ai un problème avec Git\". Telle est la phrase que l'on entend très régulièrement, murmurée dans les open-spaces. Le but de ce talk est de reprendre les problèmes les plus souvent rencontrés sur Git au travers un ensemble de cas d'usages, illustrés par des démos.",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "other",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Intermediate",
    "speakers": [
        165
    ]
  },
  "164": {
    "id": 164,
    "title": "Look mum, no hands! - Mind control in JavaScript",
    "description": "A typical interaction with a device or interface involves touching it. Either you're pressing buttons on a controller, swiping on a touchscreen or clicking on your laptop's trackpad. But what if you could control things without the use of your hands? What if you could use... your thoughts?\n\nI have been tinkering with a brain sensor and developed an open source JavaScript framework for it to allow me (or anyone else) to control interfaces or robots using facial expressions and mental commands.",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Intermediate",
    "speakers": [
        101
    ]
  },
  "165": {
    "id": 165,
    "title": "Crafting a Character: Create a Persona for your Google Assistant App",
    "description": "Do you want to build an awesome Google Assistant app that people will not only use rather out of necessity but actually love to talk to? It all starts with creating a persona; think of it as the front end of your Action on Google, the conversational partner you design to interact directly with users. Defining a clear system persona is vital to ensuring a consistent user experience that builds user trust. In this talk, you’ll learn about useful tools, get tips, and see a few examples of how well-designed personas can completely transform voice-enabled interfaces and boost user engagement.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "cloud",
    "language": "en",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Beginner",
    "speakers": [
        166
    ]
  },
  "166": {
    "id": 166,
    "title": "Hands on Jigsaw",
    "description": "Jigsaw a été  enfin(?) lancé en orbite, il faut donc préparer nos applications à la modularisation selon java 9.\n\nQuoi de mieux qu’un peu de pratique pour tester et découvrir cela ?\n\nDans cet atelier, nous allons donc convertir une application multi-modules au sens Gradle en une application modulaire au sens Jigsaw (et Gradle).\n\nCela nous permettra d’aborder notamment les notions de module path, de gestion des dépendances ainsi que les impacts sur les tests unitaires.\n\nVous aurez besoin des outils suivants (pour gagner du temps vous pouvez les installer par avance) :\n\n* [GIT](https://git-scm.com/).\n* La dernière version du [JDK 9](http://www.oracle.com/technetwork/java/javase/downloads/jdk9-downloads-3848520.html) (ou du [JDK10](http://www.oracle.com/technetwork/java/javase/downloads/jdk10-downloads-4416644.html)) avec la variable d'environnement JAVA_HOME correctement configurée. [SdkMan](http://sdkman.io/) est un excellent outil pour installer et gérer vos versions de java (et gradle, maven, kotlin, ...).\n* Votre/notre IDE préféré [IntelliJ](https://www.jetbrains.com/idea/download/).\n",
    "type": "💻 Codelab",
    "track": {
        "title": "Les Machines"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "📝 Languages"
    ],
    "complexity": "Beginner",
    "speakers": [
        167,
        168
    ]
  },
  "167": {
    "id": 167,
    "title": "Cloud Native monitoring avec Prometheus et Grafana 🚨📊",
    "description": "Prometheus est une time-series database légère et développée selon le modèle de Borgmon (Google).\n\nElle est entourée d'un écosystème très riche, permettant de superviser:\n- des servers\n- des services (applications, databases...)\n- des métriques métier (nombre d'utilisateurs, nombre d'achats...)\n\nPrometheus s'intègre à tout type d'infrastructures, sans être intrusif et peut aller chercher sa configuration dans un service discovery tel que Consul, Kubernetes, DNS, EC2...\n\nEt que serait une platforme de monitoring sans alerting et quelques graphs ?! Nous feront un POC avec Grafana et l'alertmanager.\n\nSteps:\n- 💪setup prometheus\n- 🏋️exporter des metrics: server\n- 🚄encore plus de metrics: services\n- 🚀toujours plus de metrics: metrics métier\n- 🤔requêter\n- 📈visualiser\n- 🚒alerter\n\nLes développeurs sont les bienvenus à ce codelab!\n\nAucun pré-requis n'est nécessaire, mais connaitre Docker vous fera gagner beaucoup de temps.\n\n![heart monitor](https://media.giphy.com/media/ZKw0NDn10ljSE/giphy.gif)",
    "type": "💻 Codelab",
    "track": {
        "title": "Hangar"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Beginner",
    "speakers": [
        169
    ]
  },
  "168": {
    "id": 168,
    "title": "A la découverte des algorithmes génétiques",
    "description": "On entend souvent parler des algorithmes génétiques. Ils sont utilisés dans de nombreux domaines et par de nombreux logiciels qu'on utilise couramment.\nA travers ce hands-on, je vous propose de vous présenter le fonctionnement d'un algorithme génétique ainsi que quelques stratégies d'optimisation 🤓.\n\nEnsuite, c'est à vous de jouer ! Par équipe, vous développerez un algorithme génétique. L'objectif sera d'optimiser le parcours d'un véhicule 🚗 afin qu'il puisse s'adapter au mieux à un terrain plus ou moins chaotique.\n\n\nHappy coding 😜",
    "type": "💻 Codelab",
    "track": {
        "title": "Hangar"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Intermediate",
    "speakers": [
        170,
        171
    ]
  },
  "169": {
    "id": 169,
    "title": "Lisibilité & Design : Construisons ensemble des expériences numériques inclusives",
    "description": "Dyslexie, dyscalculie, troubles de l'attention, autisme, troubles liés à l'âge etc. Il existe un nombre incalculable de réalités très différentes derrière les troubles de la lecture et de l'apprentissage.\nDonc quand lire est un challenge, naviguer sur un médium basé principalement sur le texte peut être douloureux et fatiguant.\n\nHeureusement pour nos audiences, il existe un grand nombre de petites améliorations et idées que chaque designer, rédacteur et/ou développeur peut mettre en place dans les projets pour améliorer la vie de toutes et tous.\nAlors partons à la découverte des problématiques de lisibilité sur notre médium composé à plus de 95% de texte!",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Titan"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
        "💚 UX / UI"
    ],
    "complexity": "Beginner",
    "speakers": [
        172
    ]
  },
  "170": {
    "id": 170,
    "title": "Ready for Angular version 8?",
    "description": "2018 is an exciting year for the Angular platform. Join me in this session where we will cover this year's roadmap for the upcoming features. We will discuss about the new build system, the Material CDK, the new DOM Observables proposal, the new rendering engine and many other great features. Get ready!",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        173
    ]
  },
  "171": {
    "id": 171,
    "title": "Shaving my head made me a better programmer",
    "description": "How do perceptions and stereotypes affect those in software and on engineering teams? \n\nThis talk tells the true story of how I hacked my appearance, by shaving my head, to change the way I was perceived as a programmer.\n\nThis talk also serves as a primer on unconscious bias and stereotype threat, and their effects on individuals and teams. I will provide actionable advice on how to make engineering teams more inclusive, more diverse, and thusly more productive, successful, and attractive to potential hires.",
    "type": "📣 Conference",
    "track": {
        "title": "Titan"
    },
    "category": "discovery",
    "language": "en",
    "tags": [
        "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": [
        104
    ]
  },
  "172": {
    "id": 172,
    "title": "Deliver search-friendly JavaScript-powered websites   --   Un site JavaScript search-friendly !",
    "description": "Créer un site web qui soit à la fois engageant et moderne pour l'utilisateur ET qui dispose d'un bon positionnement naturel dans le moteur de recherche de Google nécessite de combiner des technologies client-side et server-side. Nous proposons de couvrir dans ce talk les best practices pour mettre en ligne des sites et applis-web utilisant des frameworks JavaScript tout en restant indexables par les moteurs de recherche. Les enseignements de cette sessions sont applicables pour la majorité des frameworks modernes, qu'il s'agisse de Angular, Polymer, React, ou autres. Ils s'appliquent aux sites qui utilisent ces frameworks pour une sous-section du site web aussi bien qu'aux sites full-Progressive Web App (PWA).\n\n\nMaking a site that is engaging for users but performs well in Google Search requires combining specific server and client side technologies. Learn about the best practices to build and deploy indexable sites and web-applications with JavaScript frameworks. Lessons from this session can be implemented with most modern setups, whether you use Angular, Polymer, React, or other frameworks to build a full-fledged PWA or just use them for parts of a site. The session will also discuss search-friendly design patterns and SEO best practices.\n\n",
    "type": "📣 Conference",
    "track": {
        "title": "Tour Bretagne"
    },
    "category": "web",
    "language": "en",
    "tags": [
        "🌍 Web"
    ],
    "complexity": "Intermediate",
    "speakers": [
        174
    ]
  },
  "173": {
    "id": 173,
    "title": "AI Takeover",
    "description": "Portés par des avancées récentes comme alpha go ou les voitures autonomes, de plus en plus de médias prônent l'arrivée imminente du remplacement des développeurs par \"l'Intelligence artificielle\". \nDans cette présentation, Tanguy et Nicolas tous deux chez #Valeuriad vont s'attaquer à cette question en implémentant un jeu (type pacman) from scratch en remplaçant le plus de composants possibles par des algorithmes de machine learning. \nL'objectif est double : vous présenter des algorithmes et technos récentes du monde de la data science (Genetic Algorithms, Deep Q Learning, Generative Adversarial Networks, etc...) tout en essayant de démêler le vrai du faux de ce pronostic de remplacement.",
    "type": "📣 Conference",
    "track": {
        "title": "Graslin"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "🤖 BigData & AI"
    ],
    "complexity": "Intermediate",
    "speakers": [
        175,
        176
    ]
  },
  "174": {
    "id": 174,
    "title": "Partir à la découverte du serverless avec OpenFaas",
    "description": "OpenFaaS est un projet d'Alexis Ellis, Docker Captain, basé sur Docker et sur les orchestrateurs Swarm ou Kubernetes. Cette solution facilite la mise en œuvre d'une architecture Serverless à base de fonctions.\n\nA la différence de AWS Lambda ou d'autres services FaaS (Function as a Service) comme Google Cloud Functions, OpenFaas est une solution qui peut être déployée en On Premise, et ce très rapidement et simplement. L'autre différence est que tout peut devenir une fonction, y compris un binaire. On comprend mieux pourquoi depuis sa présentation à la DockerCon 2017, ce projet fait fureur dans la communauté Docker.",
    "type": "⚡️ Quickie",
    "track": {
        "title": "Belem"
    },
    "category": "cloud",
    "language": "fr",
    "tags": [
        "☁️ Cloud & DevOps"
    ],
    "complexity": "Intermediate",
    "speakers": [
        177
    ]
  },
  "175": {
    "id": 175,
    "title": "Ending keynote / Keynote de fermeture",
    "titleMobile": "Ending keynote",
    "image": "/images/backgrounds/keynote.jpg",
    "description": "",
    "type": "📣 Keynote",
    "track": {
    "title": "Titan"
    },
    "category": "discovery",
    "language": "fr",
    "tags": [
    "💡 Discovery"
    ],
    "complexity": "Beginner",
    "speakers": []
  }
}