{
  "101": {
    "id": 101,
    "name": "Charlie Gerard",
    "featured": true,
    "company": "ThoughtWorks",
    "companyLogo": "/images/logos/thoughtworks.png",
    "country": "Australia",
    "photoUrl": "/images/speakers/charlie-gerard.png",
    "shortBio": "Hey I’m Charlie, currently Software Developer @ ThoughtWorks in Sydney. I am passionate about Creative Technologies, Creative Coding, Hardware and IoT.",
    "bio": "Hey I’m Charlie, currently Software Developer @ ThoughtWorks in Sydney. I am passionate about Creative Technologies, Creative Coding, Hardware and IoT. When I’m not coding for a client’s project, I am mentoring at General Assembly, building projects using Arduino and other devices, writing tutorials to share what I learn or reading news. You can also check my [portfolio](http://charliegerard.github.io) if you’d like to know more about me :).",
    "tags": ["IoT"],
    "badges": [],
    "socials": [
      {
        "icon": "twitter",
        "name": "Twitter",
        "link": "https://twitter.com/devdevcharlie"
      },
      {
        "icon": "github",
        "name": "Github",
        "link": "https://github.com/charliegerard"
      }
    ]
  },
  "102": {
    "id": 102,
    "name": "Florina Muntenescu",
    "featured": true,
    "company": "Google",
    "companyLogo": "/images/logos/google.svg",
    "country": "England",
    "photoUrl": "/images/speakers/florina-muntenescu.jpg",
    "shortBio": "Florina works at Google as an Android Developer Advocate. She has been writing code for more than 8 years, mostly for Android.",
    "bio": "Florina works at Google as an Android Developer Advocate. She has been writing code for more than 8 years, mostly for Android. Florina keeps a strong focus on clean code and architecture. Previous work covered news at upday, payment solutions at payleven and navigation services at Garmin.",
    "tags": ["Android"],
    "badges": [],
    "socials": [
      {
        "icon": "twitter",
        "name": "Twitter",
        "link": "https://twitter.com/fmuntenescu"
      },
      {
        "icon": "github",
        "name": "Github",
        "link": "https://github.com/florina-muntenescu"
      }
    ]
  },
  "103": {
    "id": 103,
    "name": "Svetlana Isakova",
    "featured": true,
    "company": "JetBrains",
    "companyLogo": "/images/logos/jetbrains.png",
    "country": "Russia",
    "photoUrl": "/images/speakers/svetlana-isakova.png",
    "shortBio": "Svetlana Isakova began as a member of the Kotlin compiler team, and is now a developer advocate for JetBrains.",
    "bio": "Svetlana Isakova began as a member of the Kotlin compiler team, and is now a developer advocate for JetBrains. She teaches Kotlin and speaks at conferences worldwide, and is a co-author of the book \"Kotlin in Action\".",
    "tags": ["Kotlin"],
    "badges": [],
    "socials": [
      {
        "icon": "twitter",
        "name": "Twitter",
        "link": "https://twitter.com/sveta_isakova"
      },
      {
        "icon": "github",
        "name": "Github",
        "link": "https://github.com/svtk"
      }
    ]
  },
  "104": {
    "id": 104,
    "name": "Alex Qin",
    "featured": true,
    "company": "Code Cooperative",
    "companyLogo": "/images/logos/code-cooperative.jpg",
    "country": "USA",
    "photoUrl": "/images/speakers/alex-qin.jpg",
    "shortBio": "Alex Qin is a Brooklyn based programmer, educator, and public speaker.",
    "bio": "Alex Qin is a Brooklyn based programmer, educator, and public speaker. She believes in universal access to computer science education and in the importance of building technology for good. She is the founder of the Code Cooperative, an organization that teaches formerly incarcerated individuals tech literacy and coding as a means of liberation. She is on the Board of the Computer Science Teachers Association of NYC and on the Associate Board of Mouse. She recently left Gakko where she was the Director of Technology to work on the Code Cooperative full time. Prior to that, she was the Web Engineering Team Lead at Skillshare, and the Curriculum Director at Coalition for Queens. She holds a B.A. in Computer Science from New York University.",
    "tags": ["Diversity"],
    "badges": [],
    "socials": [
      {
        "icon": "twitter",
        "name": "Twitter",
        "link": "https://twitter.com/alexqin"
      },
      {
        "icon": "github",
        "name": "Github",
        "link": "https://github.com/noidontdig"
      }
    ]
  }
}
